{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=1",
                "asin": "B000GB0G7A",
                "page": 1,
                "pages": 296,
                "reviews": [
                    {
                        "id": "R2ZHY7MKMI40C2",
                        "title": "5.0 out of 5 stars Simple Yet Reliable Timepiece - A Great Purchase!",
                        "author": "Eduardo Cuello Suazo",
                        "rating": 5,
                        "content": "I recently bought the Casio Men's MQ24-7B2 Analog Watch with a Black Resin Band and I must say, it has exceeded my expectations. This timepiece beautifully combines simplicity with reliability.The design is classic and minimalistic, perfect for everyday wear or even for a more formal setting. The black resin band is comfortable on the wrist and feels durable enough for daily use. The analog display is clear and easy to read, making time-telling effortless.What really stands out about this watch is its reliability. Casio is known for crafting timepieces that last, and this watch is no exception. It has been keeping accurate time since the moment I started wearing it, which is crucial for me in a watch.Moreover, its water-resistant feature has proven handy in various situations, giving me peace of mind during unexpected weather changes or accidental splashes.For its affordable price, the quality and functionality of this Casio watch are outstanding. It's a fantastic value for the money and I couldn't be happier with my purchase.If you're in search of a no-nonsense, dependable watch that won't break the bank, I highly recommend considering the Casio Men's MQ24-7B2 Analog Watch. It's a reliable companion that gets the job done while adding a touch of understated style to any outfit. Overall, a very satisfying purchase that I would gladly recommend to others.",
                        "timestamp": "Reviewed in the United States December 26, 2023",
                        "profile_id": "AEFTEH3OQIYIK7EJ6V3NDLMHBFOA",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1F65EVRNWX90J",
                        "title": "5.0 out of 5 stars Cheap because it's simple, not shoddy",
                        "author": "J. J. Weel",
                        "rating": 5,
                        "content": "Seeing as I have a tendency to lose watches, I wanted to get one that wasn't too expensive. I was positively surprised to find one on Amazon that met my criteria (simple modern design, clearly legible analog dial, reputable brand) for only $10. As far as I can tell, they are cheap not because they are shoddy but simply because they are simple.The watch has a polyurethane strap, a stainless steel back, and a hard plastic front (\"crystal\"). According to the markings, it is assembled (\"cased\") in China, but the mechanism (\"movement\") is made in Japan. The case is a bog standard model so if you want to put on a different strap you can easily do that. The strap is quite comfortable for a plastic strap, but it's a bit on the short side. It fits around my wrist, but only barely.It's marked as \"water resistant,\" which does not mean you should go swimming with it, but it should be able to withstand some rain or a quick shower. In my experience, if you replace the battery in watches like this it's going to take more than $10 worth of effort to get it back to being similarly water resistant, especially as far as condensation is concerned. For high-end watches it's worth having the battery replaced by somebody who knows how to properly put the waterproofing seal back in, but for a $10 watch, unless you live in Arizona and never wash your hands, you probably want to just replace the whole watch when the battery runs out.Within a day of buying this watch I actually received a compliment about my nice-looking new watch. And I agree. Casio did not attempt to make their $10 watch look like a $100 watch with chrome-plated plastic and other such gimmicks. They produced a simple design that makes the most of the low-end materials at end rather than making a feeble attempt at imitating more expensive materials. And it works.I don't expect this watch to be an heirloom any time soon, but it tells the time and it actually doesn't look half bad, all for ten bucks. Congratulations, Casio! Awesome product!",
                        "timestamp": "Reviewed in the United States July 23, 2012",
                        "profile_id": "AGZ4STPMH4Y5P7OPZVUDDUBS5PPA",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3N91KDJO4OIYG",
                        "title": "4.0 out of 5 stars Good watch for teens",
                        "author": "manuel perez",
                        "rating": 4,
                        "content": "This is an excellent watch, this watch is excellent when using a formal and semiformal outfit. The good thing is that this watch is a simple and classic watch, with good colors which are black and white. However I expected the watch to be a little bit bigger, it is a small watch in comparison to other watches. I have used it like 4 times and I really like it is a comfy watch and really simple. Also it comes with a really nice stand for the watch and the price is very good for this watch. In Summary its a great watch mostly for teenagers and gentleman.",
                        "timestamp": "Reviewed in the United States March 3, 2024",
                        "profile_id": "AH7TO2LQVW2DYXHDVKB5RJMAB5PA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2O7D4TRACPJOJ",
                        "title": "5.0 out of 5 stars The price is right, but the band is short",
                        "author": "johnsantic",
                        "rating": 5,
                        "content": "I bought this as a simple replacement for a more complicated analog watch that stopped working. I like the ease of glancing at an analog watch dial to tell the time. My previous watch (that broke) also displayed the day and date, but it was a nuisance to keep resetting the date after short months. This Casio watch is as simple as it gets - it tells the time only, so it almost never requires adjustment.It looks decent and has big numbers and good dial contrast for aging eyes, plus the price is right. I have small wrists for a man, so the small size of the watch dial is just right for my wrist.The biggest problem is the watch band - it is quite short. Even with my small wrists, the watch band is barely long enough to go around my wrist, with enough extra to tuck the tail into the keeper. I have to believe that the band will be too short for many men. The watch band is thin plastic, which is not an expensive material. Casio really should provide a longer band, and if it's too long for some people, it would be easy enough to snip off the extra with a scissor. But if it's too short, there's not much you can do other than replace the band, and with the watch being so inexpensive, that's hard to justify.Some measurements:If I lay the watch down flat with the band extended, the overall length measures 8-1/8\" (20.6 cm) from the last hole on one side of the band to the buckle pin on the other side. This is the maximum circumference that your wrist can have. If you try to use the last hole in the band, the watch will probably be difficult to put on, plus only a bit of the remaining tail end of the band will go under the keeper, so the tail end will probably slip out of the keeper. A more practical arrangement would be to use the second-to-last hole in the band, which would allow the keeper to work properly. In this case, the maximum circumference your wrist can have is 7-7/8\" (20.0 cm).Where the watch band attaches to the watch body, the watch width is 16 mm, which is one of the standard width sizes for watch bands. Measuring the watch band length in the standard way, it is 7-1/8\" (18.1 cm), which is considered \"men's short\" or \"ladies' regular\".I would recommend this Casio watch, just watch out for the short watch band length.",
                        "timestamp": "Reviewed in the United States November 24, 2014",
                        "profile_id": "AHY5DVOBBO2HQVMZJFEIPXMSFGMA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "R243JKBQWBCXNA",
                        "title": "5.0 out of 5 stars Very good product with a very reasonable price and value.",
                        "author": "Sheldon Forman",
                        "rating": 5,
                        "content": "I like how well it fits on my wrist and looks. I`m a retired senior with alot of health issues right now and I don`t have alot of money to pay for a new watch after paying all my health bills. I`m one human being who doesn`t like purchasing batteries when my watch stops working because alot of times I need to also replace the band so I rather like to purchase a new watch. The price of this watch fit into my budget very nicely so I was able to purchase two of them to switch off.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AHZN67K3HQ2LHCMUXSJR3VEKO7LQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3N79C4XFNM1C9",
                        "title": "3.0 out of 5 stars A good value",
                        "author": "Chris McGrath",
                        "rating": 3,
                        "content": "If you are reading this review, stop after this next sentence and just make a decision. Flip through the other tabs you have open with the other ultra-affordable watches and choose the one that seems most aesthetically pleasing to you and just buy it.At the time of this review the watch is priced at $4 ($3.99 to be exact) and is eligible for Prime shipping--all by itself, even (i.e. not as an add-on). I bought this watch for just under $10 about a month ago. At its current price, it's borderline irresponsible to not buy this watch if you are in the market and the spartan style doesn't turn you off.The watch is nothing special. It is a very cheap timepiece and acts as such. That said, I am remarkably happy with it considering its cheap price.Few people wear watches these days. I didn't until I started having to constantly write the time down for my job and got tired of pulling out my cellphone. Most people wear watches now more for form than function, as is evident through the garish monstrosities that some men wear these days (and the overly ornate and ultra-tiny watches women wear). Having not worn a watch for many years, I was originally quite torn between analog and digital, but ultimately went with analog for its classic style.Aesthetically, the watch is nothing to write home about. It is a very simple looking watch. The watch band is made of non-reflective rubber which almost looks like something less cheap if you aren't looking directly at it and are partially blind. The numbers stand out quite well and the face's bright white backing make it almost luminescent in dim lighting (although without the added cost!). You won't win any awards for fashion with one of these clunkers.Function-wise, the bold letters and white face make this a very easy watch to read. I was pleasantly surprised to discover that the seconds-hand does not make that barely audible tapping that some more expensive watches do--that noise was one of the many reasons that I stopped wearing an analog watch some many years ago, actually. It has quite consistently kept accurate time for the month-and-change that I've had it and I expect it will for a while until the battery starts to run down.My only real complaint with the watch is that the timepiece part seems slightly thick, mostly due to the faux-glass plastic face cover protrudes from the rest of the body and forms a considerable lip. This wouldn't be an issue except that it makes it difficult to fit my shirt cuffs over the watch. Because of this, I find that the cuff winds up shoving the watch into the crook of my wrist and can become somewhat irritating. At that point I usually take the watch off and set it on my desk so as to have easy access to the time still. So bonus points for being a makeshift clock, I suppose.If the body were thinner I would rate this five stars. As it stands, I would not hesitate to recommend this to a friend or family member for the low low $4 price at which it currently stands. For those of you with paler skin, though, the black is quite deep and will contrast very starkly with your skin tone (I know this because it happens with me). So be sure you're okay with this attention drawn to it since the watch isn't exactly a beauty queen.For four dollars and Prime shipping, though, skip going out to dinner and buy four or five of these for the same price (or one and spend the rest of the money on other stuff you don't need--you earned it!).",
                        "timestamp": "Reviewed in the United States December 20, 2012",
                        "profile_id": "AHOE3RTW4REUAG4SYR6BMCMNG3XA",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": ""
                    },
                    {
                        "id": "R15ZZ0DL5499AN",
                        "title": "5.0 out of 5 stars Inexpensive knockaround watch",
                        "author": "Kevin Gulick",
                        "rating": 5,
                        "content": "I bought this watch because I wanted an inexpensive watch I can throw on when I don't want to get my nicer everyday watch dirty, banged up, or otherwise damaged. For that purpose, this watch has worked out well. It's lightweight and feels cheap (which it is), but it has held up well to abuse. The plastic crystal does scratch, but it hasn't gotten any deep gouges making the watch face hard to read at this point. I've worn the watch while fishing and had it fully immersed, resulting in some fogging under the crystal on at least one occasion, but that cleared up and the watch never stopped working. The important thing is it keeps time, and at this price point I can afford to buy a new one whenever mine stops working or wears out, but I don't forsee that happening any time soon.",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AGLN5MNWL5SPGXXJKMF7DRBUVCCA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2140WS3Y528G8",
                        "title": "5.0 out of 5 stars It delievers what it promises.",
                        "author": "John A.",
                        "rating": 5,
                        "content": "When I purchased this watch, I was looking for two things 1) a watch with a second hand and 2) the cheapest possible solution I could find.Personally, I prefer digital watches for work, but for my state CNA exam I needed a watch with a second hand. I already have a digital Casio (that just happened to come from Amazon as well) which I like because of its simplicity, weight, and basic essential features. What I was looking for this time, however was strictly a barebones watch. I found that here.You wont find a back light, glow in the dark, or even an alarm, but if you're looking for strictly a watch, this is probably the most economic option available. Everyone knows Casio watches are built well for their price class; this one appears to be no exception. Made with simple plastic, and the usual soft rubber wristband, this watch is precisely what you'd expect for the price-point. As a bonus, for my purposes anyway, this is about as readable as analog watches get- high contrast, minimally stylized- utilitarian really. This helps with its purpose: quick and reliable time reads for vital sign measurement.As for the other concerns I read before purchase:> I have not experienced the \"itching\" from the clasp of the band; what I did notice (an expected) it the \"sweat factor\" of a synthetic material watchband. That being said it is not by any means abnormal or excessive.> I personally feel it is not ultra thin for what it is, but rather it was as expected for a watch of this category.> Durability wise I except it to last 4 or more years with light usage, and likely 1-2 years of heavier use. The area I see failing is possibly the band attachments to the face- not because of this watch in particular, but in regard to any rubber watchband. If you're concerned about your watch breaking, you need to buy one with a metal band, regardless of the maker.> As for waterproofing, I personally don't trust any watch in a shower.by my estimation, this particular watch should probably be dried immediately after coming into contact with water. For the price-point, its fair to assume it can only survive splashed from hand washing or light rain. Expecting anymore from a watch this cheap is unreasonable.> Some people think this watch isn't fashionable, but in actuality given the popularity of minimalist design today, this watch fits in quite well.Conclusion:For under 8 dollars, thanks to Amazon Prime, I was able to get this watch with 2nd day air. That most certainly meets my criteria for what I was looking for- cheap, utilitarian, and a secondhand.",
                        "timestamp": "Reviewed in the United States September 28, 2010",
                        "profile_id": "AHAW2PRTEBSDSD2367JFQZHKKBAQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1HEIIBKRSNG3J",
                        "title": "4.0 out of 5 stars Stopped working",
                        "author": "Christopher lilomaiava",
                        "rating": 4,
                        "content": "I loved this watch for about a week, then it stopped working out of the blue, which is a shame because it was perfect for what I needed it for. I got an easy refund though.Besides it not working, it looked and felt great on my wrist, I just hope this is not a problem other people have.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AG7QHBA3WSR4ZXW2EGC246FX4Z6Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RJYJ613DF6Z0A",
                        "title": "4.0 out of 5 stars Relog casual",
                        "author": "User",
                        "rating": 4,
                        "content": "Un relog para salidas casuales es muy elegante y tiene una apariencia muy premiun",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEDHUZWC5ZEETPTQASUEFJPIUOVA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GB0G7A",
                "product_name": "Casio Men's MQ24-7B2 Analog Black Resin Strap Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:17:02",
            "updated_at": "2024-10-17 11:17:14",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252638736331066369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=2",
                "asin": "B000GB0G7A",
                "page": 2,
                "pages": 296,
                "reviews": [
                    {
                        "id": "R3NFDKQT5LRQKB",
                        "title": "5.0 out of 5 stars Basic classic",
                        "author": "Morris B. Silas",
                        "rating": 5,
                        "content": "This was a request from hubby who has had a stroke and needs to relearn. It has a clear face that's easy to read and is water resistant.",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AGWQBNKQIMW2TFQOTOB7DBKV76BA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3DDIA3BSY9X0M",
                        "title": "5.0 out of 5 stars Simple, yet quality and beauty",
                        "author": "Tharuedee Thamlikitchai",
                        "rating": 5,
                        "content": "All i want in this one. It isn't big as other men watches so this is perfect for me.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AHSTW47SPYT6SCK3WHKIVEIFHUWA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R25MZGR375H3YD",
                        "title": "5.0 out of 5 stars Can't Complain",
                        "author": "Comotoes",
                        "rating": 5,
                        "content": "Since this is my third one, I must like them. The first broke the band (too much repetitive flexing to put it in the keeper so if you slide the keeper instead of bending the band it will last forever). The second just stopped keeping time but after 3-1/2 years of daily use and two replacement batteries. Unfortunately, the price keeps creeping up so this will probably be my last.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AGE47T2FI7ZMUAYKOBV3B3RDBTIA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3CQVS3D9N4FS9",
                        "title": "4.0 out of 5 stars Too small for Men’s’ wrist",
                        "author": "Eyinimofe",
                        "rating": 4,
                        "content": "The media could not be loaded. I bought this wrist watch for me but my wife ended up using this watch because the size is relatively smaller than expected. The looks and style feels good, and easier to put on. The strap quality definitely looks cheap cos of the price point even though overall the watch looks durable.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AGAR4Y5LUV366DWYZKNYCPXOB45Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3RAFAL5B8LGHH",
                        "title": "5.0 out of 5 stars Light and Airy - Cascio's Answer to Swatch's Classic Watch",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "My favorite summer/hot weather Timex field watch finally died after 20 years. I was looking for a watch that would be light on my wrist and not sweaty for summer outdoor activities. I took a chance on this one because I liked the simple face and black and white - I almost bought the Swatch Classic watch, but I didn't want to spend $70 on a sporty watch to go to the barn. The watch is so light - the band conforms to your wrist so easily and is so light and airy - you hardly notice it's on your wrist. It's a clean simple design you can dress up or wear casually - I am delighted with this watch! For the price and look, it's a steal!",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AEYIBCLRBGSNZLTT4HQIOQT3QIEQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3655WSWCVIAU6",
                        "title": "4.0 out of 5 stars Nice kids starter watch",
                        "author": "Charles",
                        "rating": 4,
                        "content": "My oldest granddaughter has become fascinated with my watch collection and is always after me to let her wear my watches. She just accomplished writing her name by herself for the first time (at 3yo), so as a reward I got her this watch. At 33mm 36mm lug to lug, this is slightly larger than some \"kids\" watches out there, but I'm out to get her able to recognize her numbers consistently and actually tell time, not read a digital display. This is a wonderful piece for that -- super legible, some water resistance, and inexpensive so if she manages to crack the crystal or just loses it, it's not a heartbreaking situation.One thing folks should be aware of, and the product Q&A didn't seem to really hit on, is that the band is absolutely replaceable, but the specs are WRONG. This is NOT a 20mm band. I bought a nice hot pink (of course her favorite color) child's size 20mm band and it's too big. Fortunately for me, I'd at the same time purchased a kids sized Zulu-style strap (also in hot pink -- https://www.amazon.com/dp/B01M04HXPQ) that stated 16mm compatibility.It wasn't easy, due to the way the spring bars are set further back into the lugs than a lot of my watches, but I did get the Zulu installed. You can't do what you'd normally do -- put in the spring bars and thread the strap through, though. The bars being set further back means a 1.3mm thick strap won't just thread through. What you have to do (and I've done this on some Chinese origin pieces I own) is push the strap fully up into the little gap that exists \"behind\" the spring bar holes and push the spring bar fully in against the strap. This isn't easy, and the result has the spring bars under more horizontal tension than I'd like (which means the strap may pop out under normal wear) but again, if it happens and she loses the watch, it's not so expensive I'll be upset in any way.So many watches could learn from the simplicity of this piece. It is amazingly readable even for a 33mm watch. The alignment of the second hand is spot on (which I can't say for some other brands I've spent 20x over the price of this), it's of quartz so of course it is accurate. The crown is a little tough to work with, but it's a tiny watch, so of course it is. It's not screw-down, but it's a $15 watch so of course it isn't.All in all, I'm super happy with this pick up. Granddaughter was ecstatic and loves it.",
                        "timestamp": "Reviewed in the United States August 31, 2023",
                        "profile_id": "AHTV22XCEITN6NDZ6XFFB3P4SW2A",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": ""
                    },
                    {
                        "id": "RLF20YE78XWRX",
                        "title": "5.0 out of 5 stars Durable watch- I love it!",
                        "author": "Cecilia",
                        "rating": 5,
                        "content": "The watch is not bulky or heavy, and was surprisingly durable. The product is listed as “water resistant” and I really put that to the test. I was a lifeguard and it survived dives Into the water, being out in the rain, extreme summer heat, and much more over the summer, all without even a single scratch or the watch fogging up. The band fits comfortably around my wrist and was easy to latch. The watch also looks really professional, with the solid black design. I highly recommend this product and will update this review if anything with my watch does break.",
                        "timestamp": "Reviewed in the United States August 17, 2024",
                        "profile_id": "AETHGEZOJJLIM6ZWY3AQ6G4RYI3A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R24D71YH7L0NQY",
                        "title": "5.0 out of 5 stars Good",
                        "author": "John Dunne",
                        "rating": 5,
                        "content": "Good",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AEGFO4NYQVU6KHAS2SJWOXZQWVBQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RID9K6WBZEWEI",
                        "title": "5.0 out of 5 stars My husband loves it!",
                        "author": "Y",
                        "rating": 5,
                        "content": "My husband loves this watch. It works well and is very lightweight. Happy with the purchase.",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AENGJTB2OSRB5X7IV6GUDNGZW4QQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R20WL8VU1NK3Y0",
                        "title": "5.0 out of 5 stars Husband's favorite",
                        "author": "Sydni",
                        "rating": 5,
                        "content": "My hubby insists on this watch. It's thin and light and keeps time well. The band is good for about 1 to 2 years before it breaks. It's a plastic rubber type that starts tearing where it goes through the clasp. But he still wants the same watch as a replacement. It's very comfortable.",
                        "timestamp": "Reviewed in the United States August 24, 2024",
                        "profile_id": "AH5WNGLRBDQY7BDPRVLKDSW2MVUA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GB0G7A",
                "product_name": "Casio Men's MQ24-7B2 Analog Black Resin Strap Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:17:02",
            "updated_at": "2024-10-17 11:17:39",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252638736331066369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=3",
                "asin": "B000GB0G7A",
                "page": 3,
                "pages": 296,
                "reviews": [
                    {
                        "id": "R1ULHF4LTLFGOW",
                        "title": "5.0 out of 5 stars Great Men/Women's Watch - thick-armed/wristed individuals beware though!",
                        "author": "A. J. Safian",
                        "rating": 5,
                        "content": "I read a lot of reviews for this watch before buying it. In fact I purchased this over the other casio watch Casio Men's MQ24-1E Black Resin Watch because those reviewers complained about the watch having too small of a face and band. Well, this watch I found has the same issue for me. I am an average guy; 5'8\", 190lbs, do a lot of physical work but not buff. I do not have \"cankles\" for wrists (or would you call them \"wrankles\"?). Anyway, point is, just an average male. I bought this watch because honestly, \"watch stink\" from keeping my watch on my wrist 24/7 literally ruined my favorite watch (no replacement bands available for the unique design of the watch face). I had to go through two of these expensive watches to learn what the heck \"watch stink\" even was. But I was not going to throw down a lot of money on yet another of these watches. However being watchless was driving me absolutely crazy! My watch was more important that even having my iPhone on me! So I just caved in and ordered this guy. It was a couple bucks cheaper than the casio black analogue sister watch (link above). I love/hate this watch.In short I do not like this watch for the following reasons: the watch face is slightly small (just a tad), the band is not long enough and is veryyy thin. But I KNEW this before purchasing - I'm only saying it again for emphasize to guys out there. I also do not like paper thin watch bands. I like that thick rubber or nylon feeling. The thin resin strap is cost-effective and does its job, but it's so thin and flimsy I am always tempted to rip it off my wrist at least once a day. The length of the strap is not very long either. So the buckle ends up being almost on the side of my wrist instead of under it, like it should be. I'm at the 3rd/4th to last hole. The watch in person does not look professional.But the resin strap is really the only thing that reallllly bugs me. Aside from that I appreciate that Casio made this watch practical and useful despite its price. There are a lot of junk watches out there at the same price range. These watches will have their finishes peel off, scratch easily and will not be water resistant. They will perform as cheaply as they are made. This watch surprisingly differs in that regard. It's accurate with time, simple simple simple (love that part). And is water resistant up to 50M (just make sure the screw dial pin is pushed all the way in!). The watch face is simple, sleek, and easy to read. No funky numbers, small numbers or other distractions on the face. As much as I want to call this the perfect \"beater watch,\" when I think of beater watch I think of something that's extremely durable under abuse and will last- not so much the other line of thought \"I'll just toss it if it breaks and not cry over spilt milk.\" I don't like throwing things away or using things that are prone to being disposed of early on. So while I want to use this watch for my dirty tasks like work around the house, while working on my car, working with animals, etc. I do not get the feeling that this watch will stand to much abuse. I will test it out though and confirm in an update when/if this watch breaks.If there was a $20 version of this watch - one that had a longer, thicker strap, slightly bigger watch face, and the inclusion of a small date window - I would buy it in a heartbeat! For about $8 though, if you are skinny/have really narrow wrists this is perfect! Also want to mention this is not a gender-specific watch. It's truly universal. Just because it fits on narrow wrists, don't let that fool you. Both guys and gals have thin and thick wrists. This watch is ideal for the narrow-wristed folks out there. Enjoy!",
                        "timestamp": "Reviewed in the United States February 7, 2016",
                        "profile_id": "AF7APKW54PSOVUOKL26L4MGLGQMQ",
                        "is_verified": true,
                        "helpful_count": 14,
                        "product_attributes": ""
                    },
                    {
                        "id": "RKVY7TRQTNO57",
                        "title": "5.0 out of 5 stars Stylish and convenient watch",
                        "author": "Misha",
                        "rating": 5,
                        "content": "Very good watch for its price",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AFVSCVTKEJVZPJEUF7GWTWLK5NHA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1F62HJNWGWB8",
                        "title": "5.0 out of 5 stars Does the job!",
                        "author": "MamaMonkeyBread",
                        "rating": 5,
                        "content": "I purchased this watch about a year ago for trips to the waterpark (they have no clocks anywhere). It does a great job in all of the wave pools, lazy river, and lots of waterslides! That's the only time I wear it, and it's decently durable for that purpose: great low-cost solution when you are looking for a watch to wear in water.",
                        "timestamp": "Reviewed in the United States August 8, 2024",
                        "profile_id": "AFLY4G62SQWEGQN2N2NTFLJHQWEA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RMJ9Y9T9UNTTX",
                        "title": "4.0 out of 5 stars THIS IS SMALL FOR A MANS WATCH. If you're a female & like Swatch mens watches, this is for you",
                        "author": "somestupidhuman",
                        "rating": 4,
                        "content": "I am female and have rather bony & tiny wrists. that being said, I also don't have the greatest vision (near sighted as all get out) and need a larger easier to read watch. got to have hands, can't figure out anything digital too. i used to get used men's swatch watches off ebay years ago and those were perfect, except for the part where when the battery died replacing it didn't work so they were disposable. can't afford to keep tossing watches at $50+ even used, not to mention the bill from a jeweler to replace the special battery, which still never worked. this watch is basically identical to the simpler Swatch men's watch styles, at a fraction of the cost. lots of holes so it fits even my tiny wrist. smaller face than the other casio mens watches have, so it's just right.",
                        "timestamp": "Reviewed in the United States March 9, 2024",
                        "profile_id": "AFREHSSXALODD6GHEQVBB3QGODBA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R28YLI82LJSMQC",
                        "title": "4.0 out of 5 stars It Works",
                        "author": "All Are One",
                        "rating": 4,
                        "content": "It’s a basic wrist watch. I don’t care for digital watches…too many button combinations to set different functions. That’s why I went with Tia Casio analog. Pull the stem out, set the time and push the stem back in…simple.",
                        "timestamp": "Reviewed in the United States June 19, 2024",
                        "profile_id": "AG2GJKC6MW3Z23ZSMGAQ5DCRX2PQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RU465BK8BPJJA",
                        "title": "5.0 out of 5 stars An excellent no thrills watch",
                        "author": "Nancy",
                        "rating": 5,
                        "content": "Bought this for my dad. He lost his first one and liked it soo much we replaced it with an identical one.",
                        "timestamp": "Reviewed in the United States August 19, 2024",
                        "profile_id": "AFKBXZABSFBQCCPE7IXP3JNOCW4A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R22FW1WZHBE622",
                        "title": "5.0 out of 5 stars Casio MQ-24-7B excellent bottom budget do it all watch",
                        "author": "perpetual student 3021",
                        "rating": 5,
                        "content": "I just bought this watch to be my new beater watch for backyard chores such as weed trimming ,sawing dead branches, planting,mulching, watering trees and cleaning the septic tank filter and other tasks that I did not want to wear my daily wear and dress watches to do. I already own several other Casio watches which I am pleased with so I am familiar with the brand. By today's fashion it is a small watch for a man but back in the 50s and 60s it would be considered a full size mens watch. My dad's Timex Marlin back in the early 60s was around 34 millimeters case diameter which was a normal mans size watch back then. The watch arrived in a timely way and in good condition. It is very lightweight and comfortable to wear. Although I am a big guy the watch fits fine on the 4 th or 5th hole on the strap. It looks small on my wrist but since it's purpose is to do chores with, the size is not an issue for me. After initially setting it the second hand lines up well with the indices. I will list the Pros and Cons:Pros:- inexpensive- clean simple minimalist design- easy to read dial- comfortable- made of non absorbant materials and of water resistant construction- easy to clean- reliable and accurate movement- second hand hits the minute markers- proven design and brand- a known quantity- versatility- can be used for everything from digging ditches to dress up occasions.- reasonably durable for a low cost watch per other online reviews- replacement battery is inexpensive- easy to set- easily replacedCons:- size is small for some men by today's standards- battery life of 2 or 3 years is less than some other budget priced Casio watches (i.e. F91-w)- straps reported to last 1or 2 years- some replacement straps can cost more than the watch (unless a cheap replacement is found- No lume if you need to read in the darkIn conclusion this watch is a great choice for people on a low budget that desire an accurate and versatile and handsome time piece. I will post an update on the watch after using it for a while but based on my experience with my other Casios I anticipate keeping this watch for years to come.",
                        "timestamp": "Reviewed in the United States January 18, 2022",
                        "profile_id": "AE3UPW24XQDKQ6ASIFEJ6HVG5ACA",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2X6YL0P9FRWOE",
                        "title": "4.0 out of 5 stars Good basic Analog watch",
                        "author": "Pat Sullivan",
                        "rating": 4,
                        "content": "It's water resistant and can handle taking a shower with me!",
                        "timestamp": "Reviewed in the United States June 15, 2024",
                        "profile_id": "AEKPOZF7TPFGZIXMQQSZVB7L5S3A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RARBC87JXSJ9B",
                        "title": "5.0 out of 5 stars came on time!!",
                        "author": "Ratul Bhowmick",
                        "rating": 5,
                        "content": "Nice watch for everyday use",
                        "timestamp": "Reviewed in the United States August 21, 2024",
                        "profile_id": "AEBCSR574YH7IC6UHWZTIR637OVQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RBWVHHD96PXC9",
                        "title": "4.0 out of 5 stars Nice & big. Light. Sleek.",
                        "author": "Queen Charles",
                        "rating": 4,
                        "content": "I really like this watch. It's sleek and it's the perfect size. I was hesitant to buy it because I thought it was too plain.(I like my watches big & with a little bit of silver.) But when I compared it to other watches on Amazon, I quickly realized that it was more my style than anything else, it was just missing the bling. So,I baught a a silver cuff to pair it with. Problem solved..lolThe fact that it's water resistant is a huge plus and the price is right too. It's also comfortable and light weight. I'm very, very pleased with it...I hope that it lasts for a while.",
                        "timestamp": "Reviewed in the United States February 17, 2024",
                        "profile_id": "AGLAYK3UXAM527OH2UVEHTTBKTZQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GB0G7A",
                "product_name": "Casio Men's MQ24-7B2 Analog Black Resin Strap Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:17:02",
            "updated_at": "2024-10-17 11:17:40",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252638736331066369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=4",
                "asin": "B000GB0G7A",
                "page": 4,
                "pages": 296,
                "reviews": [
                    {
                        "id": "RC6EB356M36K0",
                        "title": "3.0 out of 5 stars Tiny Watch",
                        "author": "Rebecca Callas",
                        "rating": 3,
                        "content": "Casio is an excellent brand so don't get me wrong, I love Casio. This watch is tiny. When it arrived I tried to put it on my husband and it looked like a child's watch. I went to the Amazon site to be sure I had ordered a Men's Watch...yes it is listed as a men's watch. Surprising really cause it is pretty small. I would suggest it might be great for a woman or child.",
                        "timestamp": "Reviewed in the United States July 29, 2024",
                        "profile_id": "AHDZCCO25OIOSZL5LX4CQMDV7V7Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3C4YY13X221ST",
                        "title": "5.0 out of 5 stars watch",
                        "author": "RosaTroia",
                        "rating": 5,
                        "content": "My son was very pleased with casio' watch .",
                        "timestamp": "Reviewed in the United States August 14, 2024",
                        "profile_id": "AEPSQNMLZQ5EKLDVKQKOT7GQZUEA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1QTFIZ04DWMIK",
                        "title": "4.0 out of 5 stars Casio watch",
                        "author": "Kevin.D Overton",
                        "rating": 4,
                        "content": "This watch works as it should. Just like any other Casio product. It is a Men's watch however is is kind of small for a Men's watch. Other than that for theoney it is a work horse of a watch and takes alot of abuse",
                        "timestamp": "Reviewed in the United States April 24, 2024",
                        "profile_id": "AGFQBDJOWWPE5KTCFLC6MBTHUBMQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RHOEY2AL8KFE1",
                        "title": "5.0 out of 5 stars Simple, basic, reliable",
                        "author": "southern NH",
                        "rating": 5,
                        "content": "I needed a watch, but hate wearing one. My husband recommended this one. Take off one strap and, and it fits in a pocket. Easy to retrieve, lightweight, slim. Easy to read face. My husband has had his for about 2 years with no problems.",
                        "timestamp": "Reviewed in the United States July 19, 2024",
                        "profile_id": "AHW6CWSNJXSKBV7PJBOCT642RYOA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1YS5REEEBQAQ6",
                        "title": "3.0 out of 5 stars A bit small",
                        "author": "Raul",
                        "rating": 3,
                        "content": "Most likely my mistake when shopping this watch , but , it's incredibly thin and looks a lot like a toy, works great , but yes.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AHF5EZK6P5TC3RAGKUDYWTQ2SWTQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2YHSMBEICRJ5B",
                        "title": "5.0 out of 5 stars Security watch",
                        "author": "Jack McCubbins",
                        "rating": 5,
                        "content": "Perfect little black professional Casio watch for my security outfit. Keeps perfect timing and it's nice, lightweight, and clean looking for our required professional look!",
                        "timestamp": "Reviewed in the United States July 29, 2024",
                        "profile_id": "AH7ADCNWIQ24B4NDQ4BD2P44MJ2Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RJXUP45F31LV8",
                        "title": "5.0 out of 5 stars Simple, Small, Affordable, Lightweight (but has durability issues)",
                        "author": "bsg2004",
                        "rating": 5,
                        "content": "This is a very simple, small, basic, practical and affordable watch that performs the most important function of watches, tell time, without any bells and whistles and distractions! It doesn't take up space and it doesn't have things that protrude too much and can get caught up in sleeves. It isn't affected by washing hands or washing dishes. It is hard to ask for more from a ten dollar watch!However, it is not perfect. I bought two of these in the Fall of 2010. Of the two that arrived, one was dead on arrival. Amazon promptly replaced it with a new one. Of the two working ones, in about 2.5 years, the wrist straps on both of them broke off. One of the two ran out of battery. The loop on the wrist strap broke on one of the two. So if you are looking for a watch that will keep ticking for many years without any maintenance, this is probably not it.The watch costs slightly more than what watch care stores charge to either replace the battery or the wrist strap. So if you really like the watch, you can instead get a brand new one (instead of changing the battery or the wrist strap). This way, you get a new watch, new battery and new strap and you can save the previous watch as spare parts if something breaks on the new one.In my case however, the wrist strap proved to be the weakest link. In one customer review here, this Voguestrap TX16G13 Allstrap 16mm Black Regular-Length Fits Casio Sport and Diver Watchband was recommended as a replacement strap. It costs about half the price of the brand new watch. So instead of getting another watch, I am giving the Voguestrap wrist-strap a try. I only used it for about two weeks, so it's too early to tell.Changing the wrist strap on this one is fairly simple. You just gently push on the bar that holds the strap inwards and down at the same time. There are plenty of tutorials online if you google them. I am rather clumsy but I was able to replace the wrist-strap using a small screwdriver and patience.I did not attempt to replace the battery on my own. I took it to one of the local watch care shops.Overall, I love the simplicity, practicality, and lightweightness of this watch. The price is hard to argue against. The only issue is that its strap and battery may need replacement every 2-3 years. If you are okay with that, all is well! But some prefer to have things that just work as they are and don't want to deal with fixes or replacements or hassles.",
                        "timestamp": "Reviewed in the United States March 28, 2013",
                        "profile_id": "AE4CQXRSGUXWPSONX3OE7DMXILKA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R18VTPKTGWUWHG",
                        "title": "3.0 out of 5 stars VERY small watch face, not regular size Men's Casio",
                        "author": "Old man",
                        "rating": 3,
                        "content": "3.4 mm watch face on my old Casio, this one has a 2.6 mm face and watch band is 1.5 inches shorter than my old one. I use my Casio to exercise outdoors so I replace it when the battery dies. I am disappointed but have decided to keep this. I am short with a small wrist but I am sure there are many that will be shocked at the small size. It should say child size I think.",
                        "timestamp": "Reviewed in the United States July 15, 2024",
                        "profile_id": "AFCBIVGJYKOSOMSYVZHF3HUIZUDQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3LF2C8O0AAPGZ",
                        "title": "5.0 out of 5 stars Prefect work watch",
                        "author": "Wade S.",
                        "rating": 5,
                        "content": "This is my 2nd Casio watch. I like it for a work watch. The reason for the replacement is the band broke and I could not find a replacement.",
                        "timestamp": "Reviewed in the United States July 18, 2024",
                        "profile_id": "AGC4R75B75MEAWQAVBKXPZL5BR7Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R30BQCY4IIBUZT",
                        "title": "5.0 out of 5 stars Simple, Classic, Reliable",
                        "author": "SyncopeD",
                        "rating": 5,
                        "content": "First time I used this product was about 15 years ago. Design & quality hasn't changed which I love. This wristband also works for smaller people.I came back to this product for the purpose of my tropical travel which I knew would require a lot of salt water activities. It did not fail me. Water or moist did not enter. I was mostly on shallow water and didn't do any deep diving so I don't know if it will be the same for those type of activities. From what I remember I would only have moist issue after I had opened it up to replace battery.It's a good product overall.",
                        "timestamp": "Reviewed in the United States April 23, 2024",
                        "profile_id": "AEKJ4JW2LXI2ANNNZ6EDHQ2R7QUQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GB0G7A",
                "product_name": "Casio Men's MQ24-7B2 Analog Black Resin Strap Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:17:02",
            "updated_at": "2024-10-17 11:17:41",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252638736331066369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=5",
                "asin": "B000GB0G7A",
                "page": 5,
                "pages": 296,
                "reviews": [
                    {
                        "id": "R1E6ETE0XNWKNF",
                        "title": "3.0 out of 5 stars good",
                        "author": "M",
                        "rating": 3,
                        "content": "A relatively simple watch that is easy to use and a little small",
                        "timestamp": "Reviewed in the United States August 29, 2024",
                        "profile_id": "AFXOPDQRGY6CN3WKOBKSZIFYODDA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2MPK5I3JKOZX8",
                        "title": "5.0 out of 5 stars Good basic watch",
                        "author": "Richard U",
                        "rating": 5,
                        "content": "I wanted a good but inexpensive watch for times when I did not want to wear my good watch. I have found Casio to be a well performing less expensive brand. Previously I tried their digital watches, but I would end up bumping buttons and having the watch showing something other than the time. So I decided to get this analog one. No buttons to bump, no added functions I never use. It works well. It is very light, and also easy to read. Overall happy with this watch, and for the price it would be hard to beat.",
                        "timestamp": "Reviewed in the United States April 25, 2024",
                        "profile_id": "AHQLJMGDESL757HJJCSCAHYNH4LA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1RTASPM9HHUE0",
                        "title": "5.0 out of 5 stars a must have",
                        "author": "john guagenti",
                        "rating": 5,
                        "content": "Great for LONG battery life, the digital watches seem to go through batteries too quickly",
                        "timestamp": "Reviewed in the United States July 25, 2024",
                        "profile_id": "AGMRM2SM4572DTRTQJAAXJ6LKPRA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R27SRFM2136FKK",
                        "title": "5.0 out of 5 stars Loving This Watch Already!",
                        "author": "Nicole",
                        "rating": 5,
                        "content": "I came across this watch after muddling through hundreds of watches online, looking for just the perfect one for the clinical classes I'm about to start in nursing school this coming summer. I needed a watch that was comfortable, cheaply priced (I'm a broke college student), easily replaceable, with a secondhand and for personal tastes, one that looked simple and sweet. This watch has fit all of my expectations, plus it's comfortable. It's so light, and I can't even feel the band pulling or tugging or irritating my skin or anything like that so I'm pretty happy because I hadn't even thought of the comfort myself before previously buying it. Moving on, I saw a review on here that gave it a bad rating because they thought it was difficult to set the time, and honestly, I would say ignore that review! It's literally so easy to set the time, and it even has the manual telling you how in one sentence. But, basically all that you do is pull out the little silver crown on the side (which by the way don't be afraid to pull, I was hesitant to pull it to roughly at first also) until you hear or feel a little click, and then simply rotate it to the time you want, push the crown back in, and tada! All done. I was so fearful because of the one review I saw but I was surprised to see how it easy it was. Anyways as to durability, water resistance, and all that, I'm not sure yet because I've only had it for a an hour in a half but even if it's not that great, I don't think I'll be upset because the price tag is so low that I can tatter it up in clinical classes, and easily get a new one without feeling so down and out about the money being spent. But that being said, I do plan to check back in for you guys at the end of summer and let you know how It fairs after all the hand washing, and heavy use. I'd also like to mention that I'm a woman and that if you're thrown of by the title because it says \"Men's,\" don't be! This watch looks equally as good on women, it's not to big, it's in just the right spot to be what I consider unisex. I'd even lean on the side of saying that it's kind of small as many reviewers have mentioned. But I think that people with medium sized wrist can get away with it, I'm not 100% sure because I personally have small wrists. Adding to this, If it's of any help to anyone, I wear mine on the 7th hole as someone with small wrists, so I think that for people with medium wrists there's still plenty of room on the band. Overall, I think that if you're thinking of going for this watch you should! It's a great value for a simple and classyish-looking every day watch.",
                        "timestamp": "Reviewed in the United States April 26, 2015",
                        "profile_id": "AEI67AGZUM6ITDDJE3P63GYUYHZQ",
                        "is_verified": true,
                        "helpful_count": 197,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1Q0JOATZN48EZ",
                        "title": "5.0 out of 5 stars Awesome watch!",
                        "author": "Stewart Vardaman",
                        "rating": 5,
                        "content": "Wearing it now and love it!",
                        "timestamp": "Reviewed in the United States August 2, 2024",
                        "profile_id": "AETBOAWLK4DMXMUPSKXEPHX2PGHA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R90FL9OFSLADP",
                        "title": "5.0 out of 5 stars Just Excellent",
                        "author": "Thomas M. Slover",
                        "rating": 5,
                        "content": "Bought this watch several years ago as a \"throw away\" (for $9.99 at the time) which I could wear to work in a garage without concern about breaking, scratching or ruining it. Well, I am still wearing it today and I love it. Simple and functional and always super easy to read. Just change the battery once a year and it's a winner.",
                        "timestamp": "Reviewed in the United States June 4, 2024",
                        "profile_id": "AHASNRI6LDAXLFNLWQC6B4DC4Q7Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R324C5MSTQCJEA",
                        "title": "4.0 out of 5 stars Works great, a little smaller than expected",
                        "author": "Patrick Smith",
                        "rating": 4,
                        "content": "Light, inexpensive, easy to read. The body/face feels a little small compared to other watches I’ve had. It functions fine, doesn’t weigh much and does what I need and want. I buy cheap watches because I do lots of physical work that will damage it over time. My last watch was torn off my wrist when it was caught by a machine I was moving and slipped from my grip. By breaking away it saved me from injury, so it did exactly what was needed. Thank you Casio for making watches that are cheap, they have a purpose and a market.",
                        "timestamp": "Reviewed in the United States November 22, 2023",
                        "profile_id": "AEVNWRH6RPB4T63U5QT7KNWN4FEQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1DD1AHRDWFGRQ",
                        "title": "4.0 out of 5 stars Small but comfy",
                        "author": "colton ryan",
                        "rating": 4,
                        "content": "Smaller than you think. Unique and comfy watch",
                        "timestamp": "Reviewed in the United States April 23, 2024",
                        "profile_id": "AHSVZ5T3NYPS53A3KIP47D7C4JKQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2N4VNPYUIWSIQ",
                        "title": "5.0 out of 5 stars Exactly what I wanted",
                        "author": "Charles Maddox Jr.",
                        "rating": 5,
                        "content": "I have very hands-on job, so my watches always end up getting damaged. This one has a very thin and sleek design, so it's easy to get work done without taking my watch off every time. And the high contrast of the face means I can read it at a glance.",
                        "timestamp": "Reviewed in the United States May 22, 2024",
                        "profile_id": "AHXT5MFELIYEXGRPRREHSSTMS77Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3RJHFWZAMBY6V",
                        "title": "3.0 out of 5 stars Great watch until the cheap strap breaks and you lose it",
                        "author": "Satisfied Customer",
                        "rating": 3,
                        "content": "I loved this watch. It was stylish and easy to read. I wore it all the time - during lap swimming, water aerobics, and showering. It never clouded up or lost time. I'd still be wearing it, but the cheap strap broke and I lost it somewhere. I replaced it with a different watch because I didn't want to lose another one.",
                        "timestamp": "Reviewed in the United States June 13, 2024",
                        "profile_id": "AH5IIXIPXMLG6VPPXCC6ZHPTM4QA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GB0G7A",
                "product_name": "Casio Men's MQ24-7B2 Analog Black Resin Strap Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:17:02",
            "updated_at": "2024-10-17 11:17:42",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B000GB0G7A?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252638736331066369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:17:02",
        "domain": "com",
        "geo_location": null,
        "id": "7252638736331066369",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B000GB0G7A",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:17:42",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252638736331066369",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252638736331066369/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252638736331066369/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252638736331066369/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638736331066369/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}