{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=1",
                "asin": "B000GAWSDG",
                "page": 1,
                "pages": 1053,
                "reviews": [
                    {
                        "id": "R3RZZSEIIQ2N2T",
                        "title": "5.0 out of 5 stars Unbeatable value and quality",
                        "author": "M. Sharp",
                        "rating": 5,
                        "content": "This watch is perfect. It is super compact, super durable, super simple, and it costs as much as a fast food meal. It is the most sold non smart watch ever. If you need a watch and don’t need it to connect to your phone, there is literally no reason to buy any other watch, unless you are one of those weirdos that are obsessed with how watches look. It is also super intuitive and easy to use, and the alarm function works great as well. It has 7 years of battery life, which, at a $20 price point is less than one cent per day to always know the time, have a stopwatch, and have an alarm. At night, the light works great, and during the day, it is easily readable. I’ve already bought this watch twice, and I just got it again for an upcoming trip where I won’t have my phone. However, I’ve realized that having a watch is just better. Instead of fishing around in your pocket and getting sucked into YouTube, you can just glance at your wrist. Smart watches are dumb and gimmicky. Dumb watches are the way to go, and this is the best dumb watch out there. And if you are even considering buying an analog watch I genuinely don’t know how to help you. Can your analog watch set timers, have a 24 hour clock, have a stopwatch, or be super precise? I didn’t think so. And this watch is waterproof too.",
                        "timestamp": "Reviewed in the United States May 12, 2024",
                        "profile_id": "AE63MTPKRBK36ANXWN3VYEGGSCLQ",
                        "is_verified": true,
                        "helpful_count": 49,
                        "product_attributes": ""
                    },
                    {
                        "id": "RWJPJEWZ3LU9B",
                        "title": "5.0 out of 5 stars Great watch and price can’t be beat",
                        "author": "William Greene",
                        "rating": 5,
                        "content": "Simple watch for a very low price but gets the job done. Fits and feels nice on the wrist with a retro look. Shows time digitally and has a built in stopwatch and alarm features.",
                        "timestamp": "Reviewed in the United States August 8, 2024",
                        "profile_id": "AGOBJYGMGPAY4LWQZ7YVYP5T7PEA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R298JJZMMHVPYG",
                        "title": "5.0 out of 5 stars A True Utilitarian Classic Watch",
                        "author": "IT Gal",
                        "rating": 5,
                        "content": "I love this watch because of its simplicity. I consider this watch to be utilitarian and perfect for anyone who works with their hands, outdoor laborious work; basically a tradesman’s watch. It is basically the same watch from many years ago introduced by Casio that started the digital watch revolution. Its old style uniqueness is a conversation starter as well. The price and watch is such that you can put it through the wringer and not worry or feel bad about it. It certainly will hold up to whatever you throw at it. Yes, it’s small, the band could be better, but it’s actually just perfect how it is and what it is for. I love this watch and it makes me smile every time I look at it - a sort of nostalgic simplicity that is just there, kind of like a reliable friend. Great watch, but know your expectations and requirements before ordering to make sure it will be what you want.",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AF7HPCW72CZ2CZ5JRO4PPCGUDR4A",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1TKGQU3XXQ0E8",
                        "title": "4.0 out of 5 stars Great value",
                        "author": "Isaac De Silva",
                        "rating": 4,
                        "content": "Its durable, accurate timekeeping, and inexpensive. The strap is way shorter than other casios/gshocks, so you cannot do that thing where you leave the clasp at the lowest hole so you can put on the watch and tighten it with one hand without looking. The resin kinda sucks compared to other casios/gshocks, but if you get it on sale (DONT buy this full price) its a good value. If this is at full price, id just get the gshock on amazon for like 40-50 bucks.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AF4PBXT6S5AVIUOIYNIT2MTKNSUQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3EA3RZGQLGC13",
                        "title": "5.0 out of 5 stars Fantastic buy, good quality, simple but reliable. 11/10",
                        "author": "Spiffy McPerson",
                        "rating": 5,
                        "content": "A lot of products I used to love have gone notably down in quality over the past few years. Not this one. The price is a bit higher but it's worth the buy. One watch lasts me at least three years of continuous use with no battery change (I haven't tried for longer so it may go longer than that still). I've never had any problems to speak of with these- they stand up to grime, wear and tear, jostling, and water up to a reasonable level (they're not meant to be submersed, but have survived my forgetting to take them off when jumping in the pool, ocean, or shower multiple times, and have never gotten damage from rain or splashes). Easy to clean, easy to take on and off. I have a bad metal allergy to some mental and have never had any issue with this watch, and the band is a soft rubber that resists chafing. 11/10 would recommend.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AEGXUOE6ARMYL4ASDMIGDZVH7KOA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "R79V0HAUS3RSU",
                        "title": "5.0 out of 5 stars Sleek, lightweight, utilitarian watch.",
                        "author": "Houston Watson",
                        "rating": 5,
                        "content": "I have never really been a watch guy, and especially am not into smartwatches. But I decided to try another watch out and decided on the Casio F-91W based on reviews. I was not disappointed. Immediately I noticed it is a very lightweight watch, which to me is a plus. It's very slim too, and has a low profile. Again, I like this. The strap is comfortable. I enjoy the subdued colors—my favorite color is blue—so the black with blue outline is perfect. Goes with anything. The buttons and setup are very intuitive, I didn't look at any instructions and figured out how to set time and do stuff with it very quickly. The water resistance is good enough to where it won't break when washing dishes, but as the manufacturer says, you shouldn't submerge it or act as if it's water *proof.* Only downside to this watch, as others have mentioned, is the extremely dim light. It sucks. But honestly for $11 (I got it on sale), I can hardly complain. Overall a really nice watch, perfect for someone who just wants a comfortable piece that tells the time and looks decent.",
                        "timestamp": "Reviewed in the United States April 2, 2024",
                        "profile_id": "AECAEVVZKABHGN5KGDTBGTPIIJ5Q",
                        "is_verified": true,
                        "helpful_count": 11,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3JTHNKQJRB12Y",
                        "title": "5.0 out of 5 stars Proven watch. Retro style.",
                        "author": "F.Lastname",
                        "rating": 5,
                        "content": "For the price, it is unbeatable, best selling watch of all time and for a reason. Very comfortable, small and slim. Easy to use, easy to read. Battery life is amazing and if it breaks, well it is very easy to replace with the same exact thing without breaking the bank. The watch is so affordable where it isn't even worth using the warranty because you can give the broken watch to a kid to wear and replace it with a new one. This is simply one of the most loved watches by all walks of life and even respected by high end watch guys.",
                        "timestamp": "Reviewed in the United States June 25, 2024",
                        "profile_id": "AFO74ORBP6CISSV6UKQJXYJHLZMA",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": ""
                    },
                    {
                        "id": "RN3KGCZKPYOSN",
                        "title": "5.0 out of 5 stars The BEST WATCH under $15. Terrorist or not.",
                        "author": "Aratron",
                        "rating": 5,
                        "content": "Well. I contemplated for some time if I should write a review for this ultra affordable watch or not ... after some thoughts, this Casio deserves every bit of my highest recommendations so I decided to go for itIf you are reading this ... either you stumbled on the F91W-1 by looking at some of the cheapest Amazon stocked watchesOr you read from Wikipedia, or some watch forums, or other sources that this Casio is the favorite among the terrorist group.Well regardless what your motivation is ... this watch is worth every penny.Some background information. I been collecting mechanical watches for about 16+ years. And right now I own over 50 watches... From this humble $11 Casio to a few Rolex, Zenith, Omega, JLC that cost 500 times its price. I also service some of my own mechanical pieces. Although I do not have much experience with quartz watches. I do know quite a bit about material, design and many aspects of a proper horological machine.And the down right truth is, there is nothing this Casio can't do. As far as a practical machine, it can beat up your datejust/ submariner any day of the week. (Although this might not be that big of a deal in todays cell phone oriented world)Pros:It is designed to be simple and intuitive, the trait of most Casios. Button placement and functions are down right instinctive once you use it for a day or two.It is deadly accurate (duh), its quartz.The battery life is an amazing 7 years (given you use certain functions only once or twice a day.) Although some \"upgraded\" version has 10 year or solar battery. The battery life is more then reasonable for any practical purpose.This is the most comfortable watch I own, due to one reason - the weight. It feels like you are wearing a feather or nothing at all. 20 grams to be exact... or 0.7oz. Crazy how light this thing is.The retro styling is another plus .. it may not have been cool in the 80~90s. The nerdy black resin square case is now hip again...The construction of this watch is very well thought out to simplify the manufacturing process. Which, btw, is done in Thailand. Case is a single piece resin with slightly protruding plastic crystal. All the electronics are on a one piece of ic board. The case back is made from stamped stainless steel, secured by 4 screws, and the interior is where the alarm speaker goes. A rather large rubber gasket surrounds the movement. Light weight rubber strap with some mysterious reflective inclusion.ConsWater resistance: The case construction does not allow any serious form of water resistance... as a matter of fact, in the Casio manual they do not recommend anything more then hand washing. The real problem is the pushers, they lack any gasket so water will pour in when use underwater. The tolerance of the case and SS back is decent. But the gasket sits too low so a 100% secure seal will not be possible. Crystal seems to be glued into place, so no problem with water there. I think degrees of water resistance is how Casio separates their cheapest products from the slightly more expensive one.You can hear something rattle when you shake this watch ... it is nothing major howeverIf you are used to today's super large watch... namely, Graham, Panerai, 44mm, 50mm or the likes. This watch will look puny to you at 35mm. But if you like most watches in the 70s or 80s ... this is just the right size.The bottom line is ... this is a hell of a watch for the money. As utilitarian as it could be yet possess some of the funk from the past decades. It also carries a good amount of interesting back stories if you tell people about its popularity among the terrorists. A great watch! And the best $9.99 I spend on a watch.",
                        "timestamp": "Reviewed in the United States August 26, 2011",
                        "profile_id": "AEE6HHLJR7AKQP4DH66HWJGMG42A",
                        "is_verified": true,
                        "helpful_count": 104,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1NBP6F90I3WPQ",
                        "title": "5.0 out of 5 stars Got Me Through Bootcamp",
                        "author": "Lili",
                        "rating": 5,
                        "content": "This watch has seen some stuff. I wore it all day, everyday in bootcamp. I never took this thing off, not even to shower. I wore this thing while crawling through sandpits, climbing up ropes, and doing pushups on concrete. When I would wake up in the middle of the night, I would use the light to see what time it was and if I should go back to bed. When I was in a formation, I would wear it backwards so the person behind me could see what time it was. When I was in the shower, I would set the alarm really fast so we wouldn't be late out of the shower. This is THE bootcamp watch. And if it can get someone through bootcamp, then if you're looking for a simple cheap watch that has the very few features you need and none of the features you don't, then buy this one. This is the perfect watch for most use cases. No, it's not pretty. No, it doesn't have any crazy features. But when you need to know what time it is, when all the days seem to blur together, and when you have real work to do, this watch will keep time. Always there on your wrist helping you know how many more hours until your next task. Ol' Reliable.",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AH2PRRTYS6VIUGP4OK4K2WLEP5TA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RVHSVUUS4Y6OY",
                        "title": "5.0 out of 5 stars still love them, but mostly I just want a watch ...",
                        "author": "James Davis",
                        "rating": 5,
                        "content": "I’m over big, bulky watches. I’ve got my Suunto and a couple G-Shock watches. I still wear them, still love them, but mostly I just want a watch that keeps nice, precise time, doesn’t stand out from my wrist 3/4 inch and hopefully looks juuuust a little dorky. I’m also cheap. Waterproofness is important to me. I work a desk job. I commute by bus or train- watches help with that. I like to go on a run a couple times a week and wear a watch. I don’t sleep or shower with my watch on unless I’m camping or in a hotel. I like digital over analog because I kind of like to know exactly what time I think it is and I only ever estimate when I’m reading an analog watch because I’m lazy. Also, when I’m in a meeting or I’ve been pinned-down by someone I don’t want to talk to and I want to know if this really is taking forever or if my perception of the passage of time is just being warped- it’s easier to sneak a peek at a digital watch and get a precise read. I realized a few months ago that I really am just as happy wearing a $15 Casio as I am with my $250 Suunto and that most days I don’t need to know the barometric pressure. Some days, yes. Most days, no. But I like having a variety of watches (including the Suunto, which is fabulous). And I like to choose which watch to wear each morning. That’s fun for me. Recently I got on Amazon and ordered a bunch of new cheap Casio watches. I got four new watches for $52. I think Timex’s are over-priced. That’s how cheap I am.Casio W-800HAV ($20-ish) Digital Black. My eight-year old son and I each got one of these watches for Christmas 2016. We both love it. We both have other watches but wear this one the most. It has a fairly low profile- doesn’t catch on pockets or shirt sleeves. I love the light- it looks stupid, like piddly. But it actually lights the face well. I go jogging at night sometimes. The light works well enough for me to see how slow I am even while I’m bouncing down the road. And it’s got “Dual Display”. I don’t know what else to call that. It shows the time on one part of the screen and at the same time it show the stopwatch numbers. Nice to keep track of both. Or, If I’m out and about, I’ll set a stopwatch when the train goes by because I know that the train comes by every 15 minutes. So I can see when I’m coming up on another 15-minute mark and also see the time on the sub-display.Casio F-201WA ($10.47) Digital Black. Comfortable. Lightweight. Easiest buttons to push. Good light. I like that it has countdown timer and lots of alarms. I miss being able to see the time when it’s in stopwatch mode like I can with the W-800HAV and the WV-200A.Casio WV-200A ($40-ish) Waceceptor Digital Black with chrome and red. Looks good. Like the steel case. Good protection for the glass. Relatively heavy. A liiiiitle too thick. Really nice buttons. Great electro-luminescent light. This one is the only watch of the group that you can set it so it doesn’t beep every time you push a button. I really like being able to turn the beep off. Sometimes I like to set a stopwatch in a meeting so I can see how long somebody is going on with some bullsh*t. Strangely, timing somebody’s bullsh*t is a nice distraction from the bullsh*t. But I don’t like my watch to beep when I’m doing pushing buttons. “Dual display”- you can still see what time it is when you’re in other modes. Countdown timer is nice and many of my other watches don’t have one. I don’t give it extra points for the whole Wave Ceptor thing. Doesn’t add any value for me and it kinda sucks battery. This watch has been on my wrist for a full day of snorkelling and handled it beautifully. I live in a land-locked state, so when I get to the ocean, I’m in the water ALL DAY LONG. I can’t dive deeper than maybe 20 feet, so it’s not a serious test for a watch that says it’s good to 200m. But if you’re diving to 200m and time is critical, you’re going to spring for something more than a $40 Casio. (I love you, Casio).Casio HDA-600 ($14.79) Black Analog. Not the most comfortable. Kinda squeezes my wrist from bone to bone or flops around a bit. I dunno, it just fits weird. YMMV. Love the face protector. Can’t wait until it starts to look a little banged up. Glowy dots on the hands aren’t really impressive. Date window works perfectly. Looks tough but it’s probably not. I like it a lot.Casio MQ24-7B2 ($14-something) White-faced Analog. Incredibly light. Truly forget that you’re wearing it. Easy to read. No date window. No lumi. Nice, simple and never catches your sleeve in a dress shirt. Yes, I’m fancy. Some people are smart enough to read an analog watch that doesn’t have numbers on it- just dots. I’m not one of those people. I screw it up enough when there’s numbers. This has numbers. I like numbers. Haven’t tested this one for waterproofyness. Casio only says it’s water resistant. I hardly ever do underwater demolitions anymore.Casio A168W-1 ($16.15) Stainless Digital. I love / hate this watch. I don’t know if Casio was really trying to make a watch that looks fancy but it’s really a dork-bomb, or if they we’re going for dork-bomb as their aim. Either way. This watch is a stunning success. I think this watch is the pinnacle of nerd-swank. 1980’s wannabe stockbroker, cool old guy who doesn’t give a sh*t, little bit of silver under the sleeve to catch someone’s eye- oh wait it’s a friggin Casio digital. I mean, it’s chrome-plated PLASTIC for crying out loud. How awesome is that? I love all of that. Love it. It’s got the Illuminator light, which works great. Clock, date, stopwatch and alarm. No countdown timer. The metal band is not comfortable. It’s got edges and it pulls on my arm fur. Clasp works great and it’s wicked-easy to adjust. Slips under a dress shirt easily. Again: super-dorky. Makes me smile every time I put it on. Then wince when it pulls the fur.Casio F91W-1 ($11.35) Black Digital. I like this watch a lot. It’s super thin. Very lightweight. The light looks stupid but it works well. The buttons are easy to hit. It ranks pretty high on the ‘Dork’ scale. People recognize it. Hold that one button down and it says CASIo. It’s great. Proud to say I’ve never worn this watch along with flannel and a beanie. Never.",
                        "timestamp": "Reviewed in the United States October 4, 2016",
                        "profile_id": "AHQTXCKARFJUVOLUCPBBIDALN4OQ",
                        "is_verified": true,
                        "helpful_count": 859,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSDG",
                "product_name": "Casio Men's Vintage F91W-1 Resin Strap Digital Sport Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:07:29",
            "updated_at": "2024-10-17 11:07:40",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252636332218929153",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=2",
                "asin": "B000GAWSDG",
                "page": 2,
                "pages": 1053,
                "reviews": [
                    {
                        "id": "R1PM2UYEGMK0NX",
                        "title": "5.0 out of 5 stars Great for tradesmen",
                        "author": "Roman.L",
                        "rating": 5,
                        "content": "I didn't have high hopes for this sub 20$ watch, however, the sleek, lightweight, and durable little guy has stood the test of everyday life. As a tradesman, it's perfect for when I don't feel like damaging my Apple Watch during a regular work day and functions just fine at what a watch is meant to do. Tell time. It doesn't get in the way when I'm working in smaller crevices and definitely feels like an extension of your body when wearing it for longer than a few hours. The fit is also great as my wrist are a little smaller than average and the watch does a great job at not slipping during everyday use. I look forward to buying more Casio watches.",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AHPSTUNDZW2YUMXPK7M3ROJI5MAQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R81SGJFFZIOF9",
                        "title": "5.0 out of 5 stars Best watch",
                        "author": "naols",
                        "rating": 5,
                        "content": "I love this watch. I use it everyday, I am a barista and a college student and put this thing through it all. I have accidentally swam in it, showered in it, hit it on things, never has broken. I used to wear an apple watch everyday but actually prefer this because it gives all the info i need (day/date/time) without the distractions of every other app that i have on my phone. Plus my friend says hers has lasted for about 8 years",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AECKYPADLRKM2YIXQTHCGBC4WCQA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R39F47BE35YWSH",
                        "title": "5.0 out of 5 stars Classic Casio",
                        "author": "Kindle Customer",
                        "rating": 5,
                        "content": "Reminded me of the 80s right down to the disappointing back light. Were my eyes seriously good enough to see that back then? For less than a mediocre bottle of booze you can travel back to a time where neglect was wide spread, racist stereotypes were still funny, cars and music still had personality, and making bad decisions was still the best way to learn.",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AHYS6RPR7FBKNNHBEMV3AZNIIBCQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3NEEH1OHFBFRY",
                        "title": "5.0 out of 5 stars Just perfect!",
                        "author": "Iggy",
                        "rating": 5,
                        "content": "Simple, discreet and useful! My favourite feature is the option to have it beep every hour. It helps me know what time it is without constantly looking at it.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AF7FWSXQJ3JTZHAVB7JPSKBNMBOA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R92QQ7LTQLDMG",
                        "title": "5.0 out of 5 stars What is this, a watch for ants!!",
                        "author": "Sandy",
                        "rating": 5,
                        "content": "Nothing wrong with it. But it's tiny. I guess I should learn milimeters before buying another tiny watch.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFXLNTZ6K45MCTVOIW53VLJTPZWA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2KT8ALLG3JE5M",
                        "title": "5.0 out of 5 stars Too many reviews",
                        "author": "Matt",
                        "rating": 5,
                        "content": "There are simply too many reviews of this watch. So instead of a review I’d like to share with you a conversation I had the other day with one of my co-workers.Co-work: What’s that on your wrist? Did you borrow that watch from you 10 year old son? It’s so small and cheap looking. I didn’t think you ever knew how to read a LCD display.Casio F-91W Owner: It’s a Casio F-91W, and no I didn’t borrow it from my son, but sometimes I let him borrow it from me. I know that I typically, prefer analogue watches with a mechanical or automatic movements. I did need to read the instruction manual I figure out how to read the digital display. Once I figured out that the colon on the display is separating the hours (on the left) from the minute (on the right) and the smaller numbers on the far right represent the seconds; it’s actual easier to read that the 3 hand analogues.Co-work: So, why did you buy this watch? It doesn’t seem to fit in with your Seiko 5, Orient, HMT, Citizen Eco-drive or that Chinese knock-off of an expensive German watch you can’t afford, that you typically wear to the office.Casio F-91W Owner: It’s nothing like my other watches, but this watch is one of the great classics. This model was first made in 1991, and was the smart watch of its time. The features and price-point is also unbeatable. I got it specifically because I am going on vacation to the beach and I wanted an affordable watch to wear of the beach and in the pool. This is proven technology; this model has been manufacture for over two decades and it’s almost bombproof.Co-work: Doesn’t WR mean Water Resistant; like splash and rain resistant only. I thought you need at least a 50m or 100m rating to take it swimming.Casio F-91W Owner: You are completely correct, and completely wrong. A watch worth worrying about needs at least a 50m or preferable a 100m rating just for swimming on the surface more or less. Personally, I wouldn’t take any of my other watches swimming on purpose, even though some of them have a 100m rating. However, this Casio is very modest in cost and I consider the manufactures water resistance rating is very under stated. Sure, if I ruin this watch swimming, the manufacture going to tell me to fly a kite, if I made a warranty claim, but this is a ten dollar watch. If you have ten dollars to wager, like I do, throw caution to the wind or perhaps dive in head first with it. It’s a lot like jaywalking, it’s not recommended, but you not trueing living your life to the fullest if you follow every rule. I sure a G-Shock with 200m water rating is manufacture with more seals and offers better water protection, but I also think that the water resistance rating is partially just marketing to separate Casio’s $10 watches from their $100 watches. I’ve taken this watch in the ocean and dove in swimming pools with no problems. I’d recommend not pressing the buttons when it’s wet, as well as not being a cry baby if you ruin it, but this watch is suitable for swimming in my book.Co-work: Wow, what a risk taker, they must be paying you too much, if you have ten bucks to risk like that. So you say it’s was the smart watch of its time back in the day. What’s so smart about this watch?Casio F-91W Owner: Well for starters, a day-date complication with annual calendar, that only needs to be corrected for leap years. It switches between AM/PM and 24 hour format with a single push of a button. It has a hourly repeater that can be turned on and off. A stopwatch function, and am alarm. Did I mention it has a very dim light, and I believe it was y2k compliant nearly a decade in advance.Co-work: Wow, I think my iwatch can do all that, but I don’t know how to. I also paid a lot more than you, and I can’t take it swimming. How about battery life? Where’s the charger plug? Is it self-winding, like you Seiko 5, and going to die after a few days off your wrist? I know for sure that in 1991 there was no such thing as wireless charging.Casio F-91W Owner: It’s much for low tech then wireless charging, or self-winding. It’s powered by a replaceable battery. Casio claims 7-years on a single battery with no daily recharging required. It’s more likely that the strap will break, before the battery will need to be replaced. It doesn’t need any sunlight either, some people claim to get 10 years on a single battery, it really depends on how frequent the light and alarm functions are utilized. In theory you could hide out in a cave for years without worrying about charging or replacing the battery.Co-work: Hey, one more question. I know you are married, but ascetically speaking, do you think I watch like this would be helpful in attraction women? It’s kind of ugly looking.Casio F-91W Owner: Well my friend, with you ugly face and abrasive personality, if a woman takes the time to look at your watch, she’ll be excited to see a practical watch on your wrist. Well unless she’s a gold digger type, but you don’t need that. Any women that can’t appreciate a classic watch like this doesn’t even desire to go dutch at McDonalds with you. However, for you, I’d strongly recommend the Casio CA53W, if you want a line of highly desirable ladies wanting to go out with you. If you wear a Casio CA53W and a lady starts a conversation about your watch, you’ll need to take her somewhere nice, like a sit-down type restaurant, and pay the whole bill, and she’ll surely want a second date when she see you generously calculate 18% gratuity with your calculator watch.",
                        "timestamp": "Reviewed in the United States October 10, 2016",
                        "profile_id": "AE6Y5H5MN7ZDVUXJD4SN6RD3TF3Q",
                        "is_verified": true,
                        "helpful_count": 419,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2CC2BLHYRVKJ3",
                        "title": "5.0 out of 5 stars This watch will grow hair on your balls.",
                        "author": "K Hall",
                        "rating": 5,
                        "content": "This is a man's watch. I felt my testosterone levels surge as soon as I strapped this classic bad boy on my wrist. 10/10. It's look is timeless. Retro yet modern at the same time, and cheap enough that you won't mind when it inevitably gets scratched up a bit.Do yourself a favor and buy this watch.",
                        "timestamp": "Reviewed in the United States September 16, 2024",
                        "profile_id": "AEBNPXBJFSX5N3TWOR2T6EORPZEQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2WAP3OA4S57KR",
                        "title": "5.0 out of 5 stars Best watch ever",
                        "author": "Asia Darakjian",
                        "rating": 5,
                        "content": "I ahd one of these for about 13 years and never had to replace the battery. The strap wore out before anything else. One of the best products ever made by virtue of its reliability, durability and endurance. Few items are made so well anymore. I did notice however that the battery guarantee has been reduced to 7 years as opposed to the previous 10. So, there is that. Planned obsolescence at its finest...There is nothing great that can't be made worse.",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AEJXJG6ZX5OJE2UMVH7QYSL5T7UA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2610WXE4QLHIT",
                        "title": "5.0 out of 5 stars Watch",
                        "author": "Lizzie",
                        "rating": 5,
                        "content": "Best watch I've had. If your a simple guy, get one of these.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AHB2RN2IIEYYORKP5W6TE4BYN5AA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RM1QXRP68QW1S",
                        "title": "5.0 out of 5 stars GOOD PRODUCT",
                        "author": "chris kersey",
                        "rating": 5,
                        "content": "Good watches been wearing for years working , tough ,good price",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AG4MLPNB4P5Z4HRAMOQNY4D62NIA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSDG",
                "product_name": "Casio Men's Vintage F91W-1 Resin Strap Digital Sport Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:07:29",
            "updated_at": "2024-10-17 11:07:41",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252636332218929153",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=3",
                "asin": "B000GAWSDG",
                "page": 3,
                "pages": 1053,
                "reviews": [
                    {
                        "id": "RJIX8K157YIKI",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "James davis",
                        "rating": 5,
                        "content": "Love this watch as my everyday beat around at work watch. Classic styling",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AFL223YXJAQIHJSRWBR6XZCHW65Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RT73O59HJ4KPZ",
                        "title": "5.0 out of 5 stars The iconic classic",
                        "author": "Carlo Gonzalez",
                        "rating": 5,
                        "content": "No brainer everyday beater watch. The cheapest and simplest on the market.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AEE4IZG5ZBHU5T2R5S72R6OOVCFA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R332AZAK5CZPY6",
                        "title": "5.0 out of 5 stars Works great",
                        "author": "Startrust",
                        "rating": 5,
                        "content": "Long life",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AEODT25G3A4F7QNDKHYVZBVP4KDQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3F038H6E5ZESN",
                        "title": "4.0 out of 5 stars Great Watch with a Classic Design",
                        "author": "Patrick Mains",
                        "rating": 4,
                        "content": "I had been looking for a relatively cheap digital watch, preferably from Casio, as a simple watch to start the New Year off with. When I searched \"casio digital watch\" this was about the second product listing, so I knew it had to be a decent watch. I had worn it for a day or two and have since replaced it with the [insert link here]. Here is my review of the Casio F91W-1 and an explanation of why I replaced it.---------------------------------------------------------------------------------------------------Design & Build:For just over $10, this Casio has great build quality and a cool retro design. In fact, the Casio F91W has been produced since 1991 and even has its own Wikipedia (https://en.wikipedia.org/wiki/Casio_F-91W) page! The design of the Casio is simple and classic and is probably one of the reasons why this watch is still successful after 25 years! The watch is very thin, - only 8 millimeters - especially for a digital watch, which is about the same thickness as an iPhone 5. The watch face is made of plastic and is not recessed into the body, meaning that while it is flush with the casing it can be scratched easily. The casing of the watch is made of resin which is pretty standard in most digital watches. The band is also made of resin and is comfortable enough for a $10 watch. One complaint that I have about the watches build quality is the material of which the band buckle is made of. The band buckle is made of ordinary black plastic which I can see breaking in a year or two. While I can't vouch for the longevity of this watch, I can almost confidently say that that plastic buckle will be the first part to break. Other than that, the watch features nice easy-to-press buttons which stick out from the watch a millimeter or two. The buttons are very easy to press, which can be both a good thing and a bad thing as they might be pressed accidentally. The top left button activates the display light which is very weak and only lights up from one side of the display, meaning that the left part of the display is kind of bright while the further you get to the right side of the display the light dims drastically. This seems like one of the areas Casio had to cut corners with in order to cut the cost, however, it is only a minor complaint with a $10 watch. The light shines a green light and only turns on while the button is depressed, which is kind of annoying. Digital watches I have owned in the past stayed on for a few seconds, but again, this is only a minor complaint with a $10 watch. Finally, the Casio features water RESISTANCE, not waterproofing, therefore I wouldn't go swimming with it, however, other users have reported diving with it so the decision is ultimately up to you. Overall, the Casio F91W features a simple and timeless design, as well as pretty good build quality for $10. The display light has some issues and the watch is only water resistant, but these things don't matter too much in a $10 watch.---------------------------------------------------------------------------------------------------Fit:I have around a 6-inch wrist and this watch fit great. I used a hole more towards the end of the band away from the case and it fit comfortably while not being too loose. The watch is very light and once it is on you almost forget it is there. The case is also thin and doesn't add much bulk to your arm. For me, the watch face was a good size proportionate to my wrist. It might have been a little small for my liking but it definitely didn't get in the way. Overall, I am happy with how the F91W fit on my wrist.---------------------------------------------------------------------------------------------------Overall:This watch is a great watch for the price. While I can't vouch for the longevity of this watch, I can say that it features a great design and decent build quality, as well as a good and comfortable fit (at least for my wrists). To conclude, if you have a bit over $10 to spend on a digital watch, you really can't go wrong with the Casio F91W.---------------------------------------------------------------------------------------------------Pros:- Classic simple design- Decent build quality- Comfortable- Thin and light- Easy-to-press buttons- Good fit for me- Accurate time-keeping (Casio claims that the watch is accurate to ±30 seconds per month due to the quartz movement of the watch)Cons:- Weak plastic band buckle- Easily scratched plastic face- Weak and poorly designed display light- Buttons may get accidentally pressed- Only water resistant---------------------------------------------------------------------------------------------------Why I Replaced it:Even though the Casio F91W is a great watch for the money, I decided I wanted something a bit nicer, even if it meant spending a little bit more money. After browsing Amazon for other Casio watches, I came across the G-Shock G100-BV Men's Black Resin Sport Watch . The reason why I replaced the F91W isn't because it isn't a good watch, instead, I replaced it because I wanted something a little nicer with a more rugged design. To conclude, I replaced the F91W not because it wasn't good, but because of personal preference.---------------------------------------------------------------------------------------------------If you found this review helpful I would appreciate it if you clicked the \"helpful\" button below this review. Thanks!",
                        "timestamp": "Reviewed in the United States December 31, 2016",
                        "profile_id": "AGHDO3ALRH5AOCPJCD7VTSXVIIRQ",
                        "is_verified": true,
                        "helpful_count": 16,
                        "product_attributes": ""
                    },
                    {
                        "id": "R19VPLY1CWJMD4",
                        "title": "5.0 out of 5 stars Best digital watch",
                        "author": "E****y",
                        "rating": 5,
                        "content": "I just got this watch as a replacement for my old one that got lost, and I have to say that it (like my old one of this model) is the best digital watch for a Luddite runner. Everything is simple and intuitive. I was immediately able to reset the time and date with no fuss. All I want is a simple stopwatch - I can get distance off an online map at home, or my phone if I am off road; from those two pieces of info I can calculate pace and calculate intervals if I want to. A while back I got a fancy Garmin, but it has a lot of down sides. It has to be charged all the time, whereas the Casio comes with a 7-year (!) battery. The Garmin is huge and clunky, whereas the Casio is fairly small and light. The Garmin comes with all sorts of features that I do not need or want, making operation extremely complicated and non-intuitive. I ended up never using it. Sometimes low-tech is the best option. I highly recommend this watch for anyone who does not need gratuitous bells and whistles and just wants a clock/alarm/xstopwatch.",
                        "timestamp": "Reviewed in the United States July 5, 2024",
                        "profile_id": "AH3IAJFYPNJVYWJHJQ5BVWUNTI5A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R15O61R9IHTR6U",
                        "title": "5.0 out of 5 stars \"The\" watch",
                        "author": "Erik McLeod",
                        "rating": 5,
                        "content": "It's funny, I'm not a watch person. I bought this for some specific use cases. I will say, when it popped in my search, it just looked \"right.\" But I mean, for $16, what prestige is there?Well it's been half a week, and a handful of people have already complimented it. \"Love the watch, man.\" \"Whoa you got the OG on.\" \"That thing never gets old.\" Literally the first day I wore it, my first client client of the day pointed at it and said \"I HAVE ONE TOO!\"And now I don't want to take the thing off. And I guess I like watches now. Crazy how that works.",
                        "timestamp": "Reviewed in the United States August 11, 2024",
                        "profile_id": "AEKAPWPDQPSVTBVHH6WVLO7HLHFQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R24QRIZNB46WQC",
                        "title": "5.0 out of 5 stars Good Casio that provides great service.",
                        "author": "Enrique D.",
                        "rating": 5,
                        "content": "A bit thin but worth the value",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AGK6D2H6MH2GMVBHNUBLNZRQRB5Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3H3ICLTX28GZF",
                        "title": "5.0 out of 5 stars Greatest go-to watch",
                        "author": "Scott P",
                        "rating": 5,
                        "content": "Greatest go-to watch. Lasts years. underwater, elevation, everything",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AEY65MHDRBWCI5BS7EGTKZUPDIRQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R21G5TI94BHB8O",
                        "title": "5.0 out of 5 stars Reloj",
                        "author": "Alex",
                        "rating": 5,
                        "content": "Me acompaña día a día en el taladro de perforación RIG",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AGUCUJTP65NCEK7SZOSHOA7CLDZA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R391WPSYNKJ817",
                        "title": "5.0 out of 5 stars recomendado a la comunidad. articulo tal cual la descripcion",
                        "author": "Daya",
                        "rating": 5,
                        "content": "articulo tal cual la descripcion.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AFGJTTABE7ZTGPNEVLQMT6Q4W2XQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSDG",
                "product_name": "Casio Men's Vintage F91W-1 Resin Strap Digital Sport Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:07:29",
            "updated_at": "2024-10-17 11:07:42",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252636332218929153",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=4",
                "asin": "B000GAWSDG",
                "page": 4,
                "pages": 1053,
                "reviews": [
                    {
                        "id": "R1ZMQK0HN7N1CR",
                        "title": "4.0 out of 5 stars Lo que es",
                        "author": "Pepe",
                        "rating": 4,
                        "content": "Tal cual a la imagen. No más no menos",
                        "timestamp": "Reviewed in the United States September 16, 2024",
                        "profile_id": "AHHUHU5ETNA2ZK5FV6TES74G5YDQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R5QE8UOBQKTRB",
                        "title": "4.0 out of 5 stars Like the watch, hate the casing (and the band)",
                        "author": "R. Schoonover",
                        "rating": 4,
                        "content": "The watch itself does its job quite well. LIght isn't that great, but the buttons to set the time are easy to find and functionally quite good. However, the rest of the casing and the watchband leave much to be desired -- it seems here is where Casio goes overly cheap. For starters, the watch band is not quite large enough for my wrist. Ok, I'm a full grown male human and this watch may have been designed as a starter watch for a young person. But that's why I wanted it - simple design to do one thing well. And I have replacement watch bands, but that's where Casio got, in my opinion, too cheap. Instead of the spring-loaded hinge pins found on most wristwatches, on this item the watchband is mounted to the watch casing using simple straight pins. Not replaceable, as the only way to remove them I coulld figure out was to bend them with needle-nose pliers, after sawing off the watchband pieces with a hacksaw. So the watch itself is quite good for what it's supposed to do, but check that the intended recipient's wrist measures 7.5\" or less. For myself I managed to mount my all-time favorite watchband on it using paper clips, but I wouldn't suggest that for most people",
                        "timestamp": "Reviewed in the United States May 7, 2024",
                        "profile_id": "AH5PZMJ6XVYDDR475LY364HMSIGQ",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3426T50LOTNWY",
                        "title": "4.0 out of 5 stars Retro love",
                        "author": "David Batts",
                        "rating": 4,
                        "content": "My retro heart is in love with this simple digital watch, which apparently hasn't changed in 40 years. I've been floored by the number of friends I have who have seen it and said, \"Is that an F-91W? Niiice.\" My only complaint is that the illumination function is all but useless, it lights up about 10% of the left side of the face...not enough to actually read the time. But that's ok, I'll still be getting another one when this one croaks in a decade or so.",
                        "timestamp": "Reviewed in the United States July 23, 2024",
                        "profile_id": "AEPIYEDU6JIEAUU3TNEPXTZTZN3Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3GITEKO4XF5WE",
                        "title": "5.0 out of 5 stars A well made product ...",
                        "author": "Norman L. Biegner",
                        "rating": 5,
                        "content": "Purchased this about a month ago - initially set the time according to a cell phone app from the the US Naval Observatory Master Clock. In a month's period of time it is fast by one second.AWESOME!",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AHFLPVBHECP2BYWUYBLAAEPSQO4A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1XZUCXQIGD36X",
                        "title": "5.0 out of 5 stars 10/10",
                        "author": "Moisses",
                        "rating": 5,
                        "content": "10/10",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AENQSX3MCD7VKNCWP6CATPJXR3AA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3B7T7LQHOY32O",
                        "title": "5.0 out of 5 stars My go to for watches",
                        "author": "000-000",
                        "rating": 5,
                        "content": "Classic. I work in a high stress, high impact prone environment. This watch does well in harsh conditions. I am prone to wet areas and the possibility of damaging the watch comes often. For those in my career who buy \"sport\" options tend to have to replace their watches more often. I have been working with the Casio F91W since I began and only had to replace it once due to a cracked screen. But for the price, it is worth while. 24h settings are hard to come by now in digital watches and the light is minimal and not so bright to give away that I am looking at the time in dark environments.",
                        "timestamp": "Reviewed in the United States July 27, 2024",
                        "profile_id": "AFKRMEF5LKP63HJ75EA722OWS7AA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3KJHIEQL4EJQ5",
                        "title": "5.0 out of 5 stars Low profile, multiple modes",
                        "author": "DRinFL",
                        "rating": 5,
                        "content": "The watch itself has a low profile, not too bulky. Has a stop watch, time, alarm, water resistant and a display light.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AEAFIKBTCDNMADDQEXOA5W5ILGKA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2FTUH9VRD4RY8",
                        "title": "5.0 out of 5 stars Awesome",
                        "author": "Ruben Torrez",
                        "rating": 5,
                        "content": "I use this everyday super simple and at a good price this is worth it in my opinion not to shiny so you can be ok to smashing it here and there",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AET3HUXDKI47A37AIJ66NP2AC4DA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RSUI2LPJLM6OH",
                        "title": "4.0 out of 5 stars Simple and no frills, works well",
                        "author": "PY",
                        "rating": 4,
                        "content": "Needed a digital watch with alarm due to no cell phone allowed where the kid was going and this was great!",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AHNYBQGNQCL3WALBSGM53E2SJPAA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R33SGSQAN5ZU3T",
                        "title": "5.0 out of 5 stars Can’t beat it",
                        "author": "mark",
                        "rating": 5,
                        "content": "Like the title says can’t beat this watch for what it is",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AFIJQTKPEVZVTRYZH6Q4T4FOOOQA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSDG",
                "product_name": "Casio Men's Vintage F91W-1 Resin Strap Digital Sport Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:07:29",
            "updated_at": "2024-10-17 11:07:44",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252636332218929153",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=5",
                "asin": "B000GAWSDG",
                "page": 5,
                "pages": 1053,
                "reviews": [
                    {
                        "id": "R1CC7PFJTY0UQI",
                        "title": "5.0 out of 5 stars Does everything a watch should!",
                        "author": "Josh Stein",
                        "rating": 5,
                        "content": "Does everything a watch should!",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AELQB4NBXQRF3KCFRR46MCR5CXEQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2TX130I4DRH1I",
                        "title": "5.0 out of 5 stars Light weight and fashionable",
                        "author": "FFwash",
                        "rating": 5,
                        "content": "I purchased this watch because I was going on a cruise and I wanted to have a normal watch and not a smart watch for the purpose of time, zone changes and lack of Internet this watch is made of hard plastic and very durable. I had a military green color which was great looking. it is water resistant with a cool screen that gives you the date as well. I’ve had it for awhile now and haven’t made a scratch yet and as a fireman that says a lot. It has a normal adjustable band with stop watch features. Just a plain Jane awesome watch.",
                        "timestamp": "Reviewed in the United States July 28, 2024",
                        "profile_id": "AG3I2R5AY7TDYG745DDHVSRFP4GQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3MULV32SHOU1C",
                        "title": "4.0 out of 5 stars Casio watch",
                        "author": "Alan Pashkowitz",
                        "rating": 4,
                        "content": "Not as large as shown, but still adequate",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AEHBKM6RKCQEGGCXTLIWTRNTWZNA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1Y3JDUMI8V4KN",
                        "title": "5.0 out of 5 stars Amazing Watch for the Price + [Makeshift] Button Repair Help",
                        "author": "Henryen",
                        "rating": 5,
                        "content": "There's nothing bad I can say about the watch. Seriously. I'm a 16 year old kid (you know how reckless we can get) who has had this for I think over a year now, and I can honestly say this thing is REALLY DURABLE!!*How durable* you ask?I wear this thing to school nearly everyday, never having to worry about it. Yes, that means I travel with this thing very often. At school I sometimes even abuse my watch in front of my friends by slapping it on the table with full force to show them that they DO NOT wanna get slapped by this thing (it's just a joke; I would never hurt anyone unless there is very good reason since I'm pretty passive, but they're now aware I have a makeshift weapon with me at all times). I went to Cambodia last summer for a whole month, taking it across the ocean with me, swam in saltwater with it, and traveled most of the country. Surprisingly the airport security all 8 times said nothing about my watch, as it is related to being the official Al-Qaeda watch... something which is a fun fact to tell people.This thing is *still* going strong. It's clear as day to read, with very minor scratches on the face of it. The scratches are not even noticeable at 2 feet away from my eyes (even after the abuse)! The light it has is very long lasting as well, and is bright enough that you can use it as a very makeshift flashlight for things that are very close to you by facing the light away from you and pressing the button for it. It has helped me find light switches in the dark many of times.For settings things, it's very very easy. You may only need to look at the manual probably 2-5 times before you remember everything necessary because it's just so simple. If any buttons are broken it's a pretty simple fix as well; here's what I did: 1a.) Unscrew the thing on the back if you have the right kind of screws. If not, look for them on Amazon. They are I think a -2 Phillips. 1b.) Take out the screws very carefully and put them somewhere they won't be lost. They are very small, hard to handle, and easy to lose. 2.) Gently take out the rubber thing that covers the internal edges. Feel around if you don't see it right away, you will eventually. 3.) Grab a pair of small scissors, meaning the tips of the blade can fit into a small space. 4.) In the watch there are Signal Connectors, which look like small arms coming from the middle edges of the actual machine. 5.) Simply bend them perhaps 45 degrees toward the actual machine using the scissors as pliers. Make sure the button does not lay under or over the Signal Connector, only to the side of it where it can be pressed. 6a.) Repeatedly press the button time to time to test if the function of the button is restored. 6b.) Adjust the angle in step 5 as necessary. You want to bend the Connector to the point it doesn't always touch the Receiver (the thing that actually performs the function of each button), or you will have a frozen watch. 7.) When the button finally works again after some toying around, put the rubber thing back in, pressing every corner back into place, and then screw the case back into place very tightly. 8.) Drop the watch in water before you wear it to ensure you won't get electrocuted.The alarm has gotten me up most of the times, and I'm not a light sleeper. Although I'm also nowhere near a heavy one. The inaccuracy can seriously vary... once it was off by a minute in a week. This week it is only off by about 7 seconds. Really, just sync it weekly and you should be fine. The watch is very good if you just need a very good idea of what the time is.Thanks for reading! I would definitely recommend this watch and perhaps will buy it again if the dang thing finally breaks!!",
                        "timestamp": "Reviewed in the United States April 4, 2014",
                        "profile_id": "AF4EVWTRCWXEAVPIOF7REUQJOMGQ",
                        "is_verified": true,
                        "helpful_count": 23,
                        "product_attributes": ""
                    },
                    {
                        "id": "RN3000CLZHSXM",
                        "title": "5.0 out of 5 stars It was a great watch",
                        "author": "Brent Johnston",
                        "rating": 5,
                        "content": "It was a great watch for my 18 year old son.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AEOY5IP47DHFWC42YWDTBAWTG3VA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RCC658A09ERUZ",
                        "title": "5.0 out of 5 stars *****CLASSIC*****",
                        "author": "William Henryson",
                        "rating": 5,
                        "content": "FAST SHIPPING OVER NIGHT. YES!!THIS IS A OLD BUT CLASSIC CASIO WATCH. VERY COMFY. Bulletproof. 🙋‍♂️💨💨💨",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AG5BSVRDLB6YA6BSSPLKN4BFOJXQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1I8M2N1Y1JX1Q",
                        "title": "5.0 out of 5 stars Noice",
                        "author": "Vallen",
                        "rating": 5,
                        "content": "Reliable as always … I got small wrists and it fits well at the midway point so if you got big wrists it may fit snug. The watch is lightweight but overall gets the job done.",
                        "timestamp": "Reviewed in the United States August 26, 2024",
                        "profile_id": "AFHVQRL4BFC4KDP3IGKOQ4X655CA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3UZA8KEEKXZQI",
                        "title": "5.0 out of 5 stars Very Useful",
                        "author": "Mike M",
                        "rating": 5,
                        "content": "The watch has great functionality and is quite durable",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AGS56QVNVJ5KG3XF5NHQG33M5VOQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1MX199D471V2M",
                        "title": "5.0 out of 5 stars Better than the Apple Watch",
                        "author": "Peif E.",
                        "rating": 5,
                        "content": "No need to charge every night! I've never once looked down at this watch to check the time only to find out it was completely dead! I would much rather take the 7 year battery life of this watch over the 16 hour battery life of the Apple Watch any day!",
                        "timestamp": "Reviewed in the United States August 12, 2024",
                        "profile_id": "AFQB2Z7BYOP4JXIDKWPXHE2FFIUQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2MK2GGH9KDIGK",
                        "title": "5.0 out of 5 stars Great price",
                        "author": "Thomas Franklin",
                        "rating": 5,
                        "content": "Love this watch",
                        "timestamp": "Reviewed in the United States September 16, 2024",
                        "profile_id": "AEWRFB56QG2RCVZ6GBLLEYKRAPMA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSDG",
                "product_name": "Casio Men's Vintage F91W-1 Resin Strap Digital Sport Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:07:29",
            "updated_at": "2024-10-17 11:07:45",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B000GAWSDG?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252636332218929153",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:07:29",
        "domain": "com",
        "geo_location": null,
        "id": "7252636332218929153",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B000GAWSDG",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:07:45",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252636332218929153",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252636332218929153/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252636332218929153/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252636332218929153/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636332218929153/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}