{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=1",
                "asin": "B000GAWSHM",
                "page": 1,
                "pages": 490,
                "reviews": [
                    {
                        "id": "R3L0Y7A7VQAK14",
                        "title": "5.0 out of 5 stars Gets the job done",
                        "author": "Grim Reaper of Boston",
                        "rating": 5,
                        "content": "Though this watch is small and cheap, it gets the job done and looks good doing it. I've had this watch for about 6 months and in that time, it's become about 30 seconds slow - not bad for $16. I've also worn it in the rain countless times, and even in the shower on occasion, all with no issues. My only real complaint with this watch is that the plastic \"crystal\" is prone to scratching.Earlier today, I looked down to discover that the watch no longer worked and the crystal was completely cracked - definitely my fault. If this was any other watch, I'd be upset, but thanks to its ultra-low price, I just bought another one.Bottom line: if you're okay with wearing a very small watch, I can't recommend this one more. It'll survive almost anything you throw at it, and even if you do manage to break it, it costs as much as one meal at Chipotle.",
                        "timestamp": "Reviewed in the United States April 12, 2024",
                        "profile_id": "AEZOYSL5OZL7XHMWNK6FZSUTYV3Q",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "REIMU2HTMIOLQ",
                        "title": "5.0 out of 5 stars Comfortable, practical and aesthetic.",
                        "author": "Este anuncio es falso. Recibí unos tenis de una marca DAMAYUAN, que no es para nada lo que pedí. Me parece una falta de respeto y un acto muy irresponsable.",
                        "rating": 5,
                        "content": "The media could not be loaded. I recommend this product without thinking twice, it is for small hands, but it is super practical and aesthetic, I use it daily. And it's 100% waterproof, it hasn't given me any problems. The material is of quality and it is one of the things I like the most.",
                        "timestamp": "Reviewed in the United States July 19, 2024",
                        "profile_id": "AHINZENNW5XCOADWCJ6FV3M6LFNA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2SPE1RX71MKAS",
                        "title": "5.0 out of 5 stars Second time buying",
                        "author": "Trey Thomas",
                        "rating": 5,
                        "content": "I bought this watch from Amazon 8 years ago and I loved it from then til now. Had the same battery the whole time and accurate movement. The band eventually broke apart from the casing, so here I am buying it again. The price increased from $10 -> $12. The face is small like a woman's watch, but it looks good and I don't mind reading it on my wrist. Great value.",
                        "timestamp": "Reviewed in the United States April 18, 2024",
                        "profile_id": "AGVD3Z2YMZ6GZKWTG7U6XCORVJFA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1N96E0VQ41X1V",
                        "title": "4.0 out of 5 stars Decent, cheap watch",
                        "author": "JT",
                        "rating": 4,
                        "content": "When my wristwatch broke I had to wait to have it repaired. In the meantime I needed something to use as a placeholder. This wristwatch looks nice enough and functions well. It's clearly on the cheaper side, but is a good backup watch.",
                        "timestamp": "Reviewed in the United States March 16, 2024",
                        "profile_id": "AGBWVJLSP6YXVLYMFZXDKBFHIU4A",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R107GDF8PGXB24",
                        "title": "5.0 out of 5 stars Nice and basic",
                        "author": "Angie Gómez",
                        "rating": 5,
                        "content": "",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AGCMXHPIIE26VWNME45VRQRH3RRA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "RA02YTB4UEBEU",
                        "title": "3.0 out of 5 stars Nice design but very small.",
                        "author": "Amazon Customer",
                        "rating": 3,
                        "content": "It’s a nice looking watch but the size of it looks a bit feminine. I’m a pretty skinny guy and it still looked like I had on a women’s watch. If your a lady this would be a nice watch.",
                        "timestamp": "Reviewed in the United States July 3, 2024",
                        "profile_id": "AEZY4Z7SINZEEAT4DLFNBAAF7PDA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1Q9J0REMD8BPI",
                        "title": "5.0 out of 5 stars Good and very light, not heavy on my hand.",
                        "author": "Very light. Recommend this watch.",
                        "rating": 5,
                        "content": "The media could not be loaded. I normally don’t wear the watch. But not I bought this Casio watch. It is very light, comfortable on my hand and reasonable price.",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AHLWUCHDMDLLS5DF4ABCVVZ7EDSA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R29Z04M3SGJNCL",
                        "title": "4.0 out of 5 stars Slim and classy",
                        "author": "ED",
                        "rating": 4,
                        "content": "Affordably speaking, this is a great watch. Accurate and sleek. This brand has always been great about affordability and style, and in some cases durability",
                        "timestamp": "Reviewed in the United States February 15, 2024",
                        "profile_id": "AEP5HWPAZ6UJJYLWWCLVJMF7Y5JA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R17GZ20KDY762A",
                        "title": "5.0 out of 5 stars Mi amado esposo",
                        "author": "Dorisela Medina Medina",
                        "rating": 5,
                        "content": "Ideal para el diario",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AG6HZ46TFBQGIXAR3RXMFU4NOQYQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RUHO2PJDBDX36",
                        "title": "5.0 out of 5 stars The perfect size",
                        "author": "Weon H.",
                        "rating": 5,
                        "content": "It's my third on a row from this brand and model. Never dissapoints.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AE6NYNX63Y3OAUWDYWCYRCKSTHEQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSHM",
                "product_name": "Casio Men's MQ24-1E Black Resin Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:23:06",
            "updated_at": "2024-10-17 11:23:22",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252640263951104001",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=2",
                "asin": "B000GAWSHM",
                "page": 2,
                "pages": 490,
                "reviews": [
                    {
                        "id": "R1SA6111XRGOQ",
                        "title": "5.0 out of 5 stars A Classic Watch, Epitome of Intricate Japanese Craftsmanship",
                        "author": "Curtis Ho",
                        "rating": 5,
                        "content": "There is nothing more in the world you can ask for with this price. A 35mm resin case, strong acrylic crystal, black face, minimalistic design, and gold accents. You can wear it like a dress watch or an everyday watch, and is definitely a piece that needs to be in every watch collector's collection. Definitely an investmenet worth making.",
                        "timestamp": "Reviewed in the United States July 25, 2024",
                        "profile_id": "AGGPOXFPZDMJ4OOPDS3U3M6SYXAA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R172SSXBDGRKUN",
                        "title": "5.0 out of 5 stars a tale of the good.. and bad?",
                        "author": "Stephen Johnson",
                        "rating": 5,
                        "content": "After 5 months, this watch is great and I’ll tell you why.It was last night, dead in the middle of southern Texas and if you know Texas it is hot, and humid, and overall not enjoyable in the barrios with no AC. As anyone else would do, I was enjoying a nice iced tea to combat the fires of hell lingering outside my doorstep, when I began to get tired. Taking off my Casio Men’s MQ24-E Black wristwatch, I tossed it on my bed and it lay there teetering between the edges and the floor, perhaps teasing me at the back and forth idea of its inevitable action, resulting in contrasting outcomes.I payed little attention to it as my eyes drew heavy, I withdrew the remnants of my energy keeping my body moving, and fell onto the bed with an eloquent thud, and it is in this thud where tragedy strikes.My watch, my dear watch, paying no heed, took the leap of faith and into my iced tea that remained on the floor below it, unbeknownst to myself.There, he stayed for 17 hours (I did not know until I got home from work the following day)Distraught, I pulled it out and quickly grabbed a napkin. My heart pacing and knees weak, I began to preach to a higher power to take me instead and not my beloved watch, and soon it followed with anger at how this could happen, how any benevolent being of great divine intelligence and will that transcends the boundaries of contemporary life could allow this to happen.*tick*This faint sound caught my ear,*tick*Yes...Yes! This faint sound was none other than the watch itself! Still clinging onto dear life after facing a sure death.I checked the time on the watch, 6:11 it read.The only true test to determine if my watch fought his battle and won and not regressed into a decaying husk of false temporal information, was to look at my phone clock and see it is matched.Those few seconds it took to look, were the most sweat filled, nausea inducing, heart pounding seconds I have ever experienced. My life flashed before my eyes. I saw my child self walk past me, and it made me long for the innocence that time takes away from us, and this angered me, however,It is the time that gives our lives meaning, it heeds for no thing, no man or woman, no good or bad, time marches on.With this newfound realization, I knew that if this watch did not work, it was okay, I knew that my lost innocence too was okay.Nothing is permanent, nothing is meant to last forever, but the simple fact it existed and meant something to me is what matters.I opened my eyes, and both the phone and watch read 6:11.Best 12 bucks I have spent.",
                        "timestamp": "Reviewed in the United States February 16, 2018",
                        "profile_id": "AGD4MQTC2JA6CL6PFMJPBWYM23SA",
                        "is_verified": true,
                        "helpful_count": 28,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1QGBNSPV5X3B3",
                        "title": "3.0 out of 5 stars Small",
                        "author": "Tony",
                        "rating": 3,
                        "content": "Read description and should have listened. Ladies watch size.",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AFEDGLB4EZX6SKHVE43WXDHEHQZA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2U3EO3KDVBHUZ",
                        "title": "4.0 out of 5 stars ... wanted to be the 1st to say that thiswatch is a bit small and dainty",
                        "author": "ReaderRabbit",
                        "rating": 4,
                        "content": "I just wanted to be the 1st to say that this watch is a bit small and dainty. however I have small wrists, & I actually try to buy watches with smaller faces. When I opened the box, the size did shock me & my family, however. So I am documenting that here. I don't mind the size, but I would have liked for the description to plainly point out that this watch's face is a bit smaller than traditional men's watches of this day.It keeps time. It keeps time really well. & I really like the simplicity of the face. I like the gold hands and the gold increments, they go well over black. The watch says \"CASIO\" with \"QUARTZ\" underneath, on the face. In small print under the center radius of the hands is \"Water Resist\" Which I will say, is very true. I do not take this watch off when I take a bath. I submerge it completely in the tub, up to 3 times a day! It has NO condensation under the glass/crystal, and it has NOT lost track of time. It's a tough little watch. Sizing increment holes were great. I think the band is a bit cheap looking but in a millennial classic kind of way lol. I cannot hear ticking unless i have the case next to my ear. I cannot even hear ticking in the dead of night with the watch on.I noticed a small scratch on the glass/crystal earlier today. I assume that was from accidentally hitting the wood frame of the bathroom door this morning. If wood is scratching this model's glass/crystal face, I would have to assume this model's glass/crystal face scratches easily. I'm sure a little tooth paste will buff the scratch right out, especially if it's acrylic.I would recommend this watch to anyone looking for an everyday watch, whom does not mind a small size. may be prone to scratches. If you can't stand to lose 10 bucks, don't submerge this one, as I've heard it is only rated for splash. I've read some reviewers complain that theirs got water inside after submerging. Mine personally does not have any problem with being submerged. (yet!) it's been great for baths.",
                        "timestamp": "Reviewed in the United States December 12, 2016",
                        "profile_id": "AGKEUMLMI2WU4ANGR3MK547SSDWA",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": ""
                    },
                    {
                        "id": "RAAKZ0DIXTZSK",
                        "title": "4.0 out of 5 stars Good watch",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Is smaller than I expected but works great, it's the most simply watch",
                        "timestamp": "Reviewed in the United States April 21, 2024",
                        "profile_id": "AGBAR6R3EHXCCZRPUQEAL6VGLDTQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3Z8TQUS42QEM",
                        "title": "5.0 out of 5 stars great value",
                        "author": "Ch",
                        "rating": 5,
                        "content": "great value",
                        "timestamp": "Reviewed in the United States August 9, 2024",
                        "profile_id": "AHUM5MCC2LE5AK3NFWZIJPA7LFMQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3QFRHT3BOYPF7",
                        "title": "5.0 out of 5 stars Great cheap watch",
                        "author": "Rob Berry",
                        "rating": 5,
                        "content": "Let some other character wear the expensive watch! I’ll take the affordable one that keeps accurate time, is okay to wear into the shower, and is easy to read, even in low light, such as in a boring movie. In fact, I’ll get three — two for myself and one for my cats—so they know when dinner time is and, equally important, when it isn’t. I and my cats will tell excellent time, as well as anyone with a watch costing more than a glass elevator. And if we visit an aquarium and the watch falls into a pool, it’s no big deal—the watch can easily be replaced and it didn’t happen on porpoise.",
                        "timestamp": "Reviewed in the United States January 11, 2024",
                        "profile_id": "AG2VYNYDWRIJ6HWX4YX5ML2ZCUCQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R16L25VXTA465K",
                        "title": "5.0 out of 5 stars best watch",
                        "author": "Dave",
                        "rating": 5,
                        "content": "This is my second one from this model. My last one lasted 3 years through immense amounts of abuse and neglect, and only needed to be replaced because the wrist band wore out and cracked in half (now that one is permanently attached to my motorcycle dash). Multi-day kayak trips, swimming, left out baking in the sun, bashed with equipment at work... this thing just kept going. In my opinion, this is the best watch you can get for the price if you just want to tell time (or occasionally find North).",
                        "timestamp": "Reviewed in the United States March 4, 2024",
                        "profile_id": "AG6VGS5ECZDZCJF43WRU6AUJLHUQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R21CN6TWB9Z72U",
                        "title": "3.0 out of 5 stars Watch is very small",
                        "author": "A. D. Smith",
                        "rating": 3,
                        "content": "I wish the watch face was 5-10mm larger. On my 7.25 inch wrist, the watch looks comically small. Other than the size issue, it was a great deal, and it is very accurate.",
                        "timestamp": "Reviewed in the United States May 29, 2024",
                        "profile_id": "AEISHWTEETF4NQ6AHV6Z24T75QWQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2NAKETE8E94VJ",
                        "title": "5.0 out of 5 stars Loved it",
                        "author": "Michele",
                        "rating": 5,
                        "content": "Really good watch, but lost it while vacationing. Have to buy a new one!",
                        "timestamp": "Reviewed in the United States June 26, 2024",
                        "profile_id": "AHXX2NXKUVRJJ45DOXJGUEZ5MKNQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSHM",
                "product_name": "Casio Men's MQ24-1E Black Resin Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:23:06",
            "updated_at": "2024-10-17 11:23:23",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252640263951104001",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=3",
                "asin": "B000GAWSHM",
                "page": 3,
                "pages": 490,
                "reviews": [
                    {
                        "id": "RINQLAQVLQCPQ",
                        "title": "4.0 out of 5 stars Only lasts 1.5 years but looks fantastic",
                        "author": "Nick",
                        "rating": 4,
                        "content": "I’ve bought this watch 4 times in 5 years, the band always breaks or deteriorates. It’s the only watch I’ve found that matches my style: low profile, sleek, and humble. I don’t mind putting out $20 every few years to meet all my watch requirements. That said if I found one of the same style but better quality I would instantly pay $60 for one that lasted 4 years. A glow would be fantastic as it’s impossible to see at night, and I’ve had one watch that had some moisture bleed into it.",
                        "timestamp": "Reviewed in the United States June 16, 2023",
                        "profile_id": "AG7SRDAM5CTCZF7GNKG3SY6QQ2EQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3YEKWHZG1FN5",
                        "title": "4.0 out of 5 stars Good watch for the price, but remember you're only paying $10...",
                        "author": "Raymond Wlathe",
                        "rating": 4,
                        "content": "I bought this as a cheap watch I can wear every day. It feels super cheap and \"plastic-y\" but that is probably why you bought it lol. I didn't have any expectations about this watch, all I wanted was the cheapest water resistant black watch with gold hands and gold markers (dashes/lines). At this price I expected the dial design to be printed on but I really thought they would put more effort into making it look decent. This is the least reflective gold ink they could have used for the markers. I understand it is a black watch but all my other watches I can easily read in a dark room. I gladly would have paid the extra 50 cents or so it would have cost them to make the markers more shiny.However, since this is pretty much the cheapest watch they offer I can't complain much. When I accidentally splash it while washing my hands it still works, the time is accurate, it's comfortable enough, and it still works after almost one year owning it.They make plenty of leather and nylon bands in this size too so you can replace the nasty plastic band if you want. I just wanted a small watch I can wear every day and not worry about damaging it and this fits the bill perfectly.",
                        "timestamp": "Reviewed in the United States March 15, 2018",
                        "profile_id": "AEU5GOVUVDEHCOQH2HG5NV27KKGA",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2LBE9PKAG7KIC",
                        "title": "4.0 out of 5 stars Unbelievably cheap watch",
                        "author": "Danny",
                        "rating": 4,
                        "content": "First of all, everyone should get Amazon Prime, because $11.35 for this Casio watch is an absolute deal, especially with the free 2-day shipping. You cannot find any inexpensive, but quality-appearance watch anywhere else, even in retail and department stores.With that said, when the Casio packaging arrived, I was actually expecting a watch that was a bit more strong in the frame and strap, but that was not the case. The wrist strap is flimsy, and the clock frame glass could easily be damaged if the owner does not take good care of it.Appearance: WOW! It looks like a high-quality watch, with the black frame, gold hands and roman numerals. It just looks great. From afar, one would probably think it's a fairly expensive watch. However, if worn casually like on a sunny day, the wrist strap does take away a considerable amount of glamor away from the watch. The wrist strap is the biggest concern for me, but it will not for most people.Comfort: This is a fairly comfortable watch for its prize, but if worn for a long period of time, it can get comfortable and leave red marks on your wrist, but that is expected. Overall, a comfortable watch.Price: Again, you can't beat this price anywhere, especially since Casio is an established, proven watch company. $11.35? That will definitely not hurt your wallet.",
                        "timestamp": "Reviewed in the United States June 28, 2010",
                        "profile_id": "AHNDLKA34RZXTRJSXGZRXOPKTQTA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2PDT37E198UOK",
                        "title": "5.0 out of 5 stars Simple, discreet.",
                        "author": "Naila Judge",
                        "rating": 5,
                        "content": "My fourth purchase od the watch. I usually break it every two years when the battery is close to dying anyway. I'll never search for a different watch as long as this is available and cheap. Nice and small, doesn't get in the way like most men's watches do.",
                        "timestamp": "Reviewed in the United States February 16, 2024",
                        "profile_id": "AE3BQP42EXCAA5TJKXJ7IL5NDXGA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3MBXNFYZ2P3K6",
                        "title": "5.0 out of 5 stars Reliable, stylish, cheap, simple - great watch",
                        "author": "Viviana",
                        "rating": 5,
                        "content": "The style of the watch is great. It's very versatile and has a nice minimalist appearance. I've gotten compliments on it. Not something I expected to hear given the price.Every standard cheap Casio review applies - the watch is very reliable. It will not break, malfunction, stop, slow down, etc for years. Waterproof. The only reason I needed to replace mine is because I lost it.Very comfortable for my average size male wrist. The rubberized strap feels great. Sweat doesn't collect on it, unlike some metal watches. Not a huge watch face, so I can bend my wrist without the pin jamming into my hand.Not a performance watch - if you want something to use when backpacking, for sports, on the job site, etc. I'd probably get a different one. Minimalist face might require a bit more mental effort to read if you're not used to analog, and there is no night light.Just a great everyday watch.",
                        "timestamp": "Reviewed in the United States May 2, 2022",
                        "profile_id": "AHCDUXJWI4FOJF37KMBRCERFKLPQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2CKB0VSDR9AWG",
                        "title": "5.0 out of 5 stars Right fit",
                        "author": "Sista",
                        "rating": 5,
                        "content": "He loved it",
                        "timestamp": "Reviewed in the United States June 18, 2024",
                        "profile_id": "AG53KEXNFPD6WG3KCDDFJBYUQYEQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2S5L9B3K03UFD",
                        "title": "2.0 out of 5 stars Too Small",
                        "author": "Octavio",
                        "rating": 2,
                        "content": "Great price and nice looking watch but way too small for me taste, have to return it.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AHW5UT3ROMFWAP3KDWIDJ4UY7Y2Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3TQH46EGCCKPX",
                        "title": "4.0 out of 5 stars Impossible to go completely wrong",
                        "author": "Thomas",
                        "rating": 4,
                        "content": "I'm terrible about losing things, especially watches, so I was looking for a cheap analog watch that looked alright and was not too conspicuous. THIS IS THAT WATCH. I even wore this watch with a black tie and suit, and it looked like it belonged. My thought process for buying: There are several watches that are even cheaper than this and do more, but all of the watches below this price seem to have considerable quality and reliability issues. By spending $10-$15 on a focused simple time watch, you can more greatly ensure that it is well-constructed. The time is easy to read. The golden marks are shiny enough that you can interpret the time even in dim light. LOOK OUT though. The face is plastic. I've gotten some scratches that are visible at certain angles. This is the only watch I've ever owned that is lightweight enough and low-profile enough for me to want to sleep with it on. The funny thing is though: there's no light on it, so if I wake up in the night, I can't really check the time.It's really impossible to go completely wrong with this watch. Cons: No date or day, no glowing light, plastic face scratches.That's just what you get for such a bargain price. Even if you decide you don't love the watch, it only set you back a little bit.",
                        "timestamp": "Reviewed in the United States February 4, 2016",
                        "profile_id": "AEUVUGJSOXHYC5C7XY6LO7UWNOBQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "RPGAFNESSR3TX",
                        "title": "5.0 out of 5 stars Economic",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Looks expensive without the price.",
                        "timestamp": "Reviewed in the United States June 10, 2024",
                        "profile_id": "AH4WTPGYJRNJPLKAKUOOFCJ35H4A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R17RNCPUCV7IZ9",
                        "title": "5.0 out of 5 stars Slim, and good looking",
                        "author": "Timothy J Adams",
                        "rating": 5,
                        "content": "Did not test water resistance",
                        "timestamp": "Reviewed in the United States June 4, 2024",
                        "profile_id": "AFMPHO5LXOYQ5EVHQJGXV6UUQPWQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSHM",
                "product_name": "Casio Men's MQ24-1E Black Resin Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:23:06",
            "updated_at": "2024-10-17 11:23:24",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252640263951104001",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=4",
                "asin": "B000GAWSHM",
                "page": 4,
                "pages": 490,
                "reviews": [
                    {
                        "id": "R2GVULL3QVI8G1",
                        "title": "5.0 out of 5 stars Fantastic, exceptional watch, with much room for improvements",
                        "author": "KirillV",
                        "rating": 5,
                        "content": "What really matters in a watch, is not how it tells the time, but how it looks like when you're wearing it; and this watch looks very very good. If functionality is still maintained, that is even better. This watch blends functionality and aesthetics perfectly.People will often remark on how good it looks, and believe it costs 10 times more than what it is. They even all think that the plastic face casing is glass.But although it is functionally and aesthetically sublime, the materials of which it is made of are questionable. The plastic face scratches quite easily, and the rubber/silicone wristband just begs to be switched to leather to finish off the clean look of the main part of the watch.If this watch only had a glass face casing, a calm, slim leather wristband, and made it easy to replace batteries... I would pass this watch down for generations. I would buy it even if it cost $100, $200. Reasonably, though, if they made the following adjustments and set the price at about $30, it would be the best selling watch on Amazon, especially if they made different colors besides gold/black and white/black.Please, Casio, if you really want a lot of money, do the following adjustments and I will buy around 2-3 of these, and buy more to give away as gifts. I am sure others will as well.As a last remark, in dark light, the metallic hour and minute hands highly reflect low light and are easily seen. The marks for which hour it is, though, are harder to see because they aren't metallic. Every part of the watch should be switched to metallic, or glow-in-the-dark for the hour marks.",
                        "timestamp": "Reviewed in the United States September 16, 2012",
                        "profile_id": "AHUQOWZX6PPWTQMNN3IE57AMF7GA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R38SD0E2M87VQ3",
                        "title": "5.0 out of 5 stars Inexpensive, easy to wear and tells the time",
                        "author": "AT",
                        "rating": 5,
                        "content": "I purchased this watch because I was tired of having to pick up / look at my 15lb. cell phone whenever I wanted to know the time. (Also, I'm constantly late, so I want to know HOW late I am...)Although this is listed as a Men's watch, it is small and easily works for a women's wrist. (I have average sized wrists, at 5'9\" - not too big or small). The price point is great, and I love that it isn't flashy - the matte band and casing make it super low key. I own other fancier watches that I simply can't wear because they interfere with typing, the low profile of this watch makes it a go-to for every day.Waterproof? I don't take it off when washing dishes, and I did drop it in the tub for one second once - it held up! Though generally I wouldn't shower or bathe with it on.Pros:Totally inexpensiveLooks goodTells the time accuratelyLow profile - comfortable to wearCons:The plastic bezel will scratch eventually - however at this price point I would just replace it.The only real negative - these seem to be off-market or recalls? The watch came with the battery already engaged. Again, for $11 no big whoop.Buy it.",
                        "timestamp": "Reviewed in the United States February 7, 2020",
                        "profile_id": "AFX74LAG4VEK4FDLXWK3AEYDIRGQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R13UXQZSY580T4",
                        "title": "3.0 out of 5 stars Cheap watch",
                        "author": "Ethan",
                        "rating": 3,
                        "content": "Pictures make it look bigger and nicer than it actually is. It's cheap and small but I guess for the price that's to be expected",
                        "timestamp": "Reviewed in the United States March 30, 2024",
                        "profile_id": "AE6HZFMUTXV4NHPA4FCMFY5DXPKA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3GV0KMVLO0O1C",
                        "title": "5.0 out of 5 stars Bueno",
                        "author": "El artículo q me llegó no es el mismo q pedí , no se parece en nada al d la foto , no tiene ni marca",
                        "rating": 5,
                        "content": "Super bueno y lindo , lo utilice para un regalo",
                        "timestamp": "Reviewed in the United States May 15, 2024",
                        "profile_id": "AFZQ52UUIB2LGAMHR6QR4PGGEQVA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R37IVSXV3M2TIK",
                        "title": "5.0 out of 5 stars excellent value",
                        "author": "m",
                        "rating": 5,
                        "content": "It's tiny. It's black plastic. The gold tone is very obviously not actual gold. It will probably cost you more money to replace the battery than to just buy a new watch. The plastic face gets scratched very easily.It's water resistant. You don't have to worry about damaging it because it's cheap and durable and in a worst case scenario the cost of buying a new one is probably cheaper than the cost of the sales tax of the one you were looking at before you came here. The gold tone hands reflect light and allow for great night viewing without resorting to glow in the dark hands or backlighting. It has hour, minute, and second hands with hour and minute/second demarcations on the face. There is very minimal branding and there are no numerals. It keeps time perfectly. It is everything you need and nothing you don't.I love this watch. I have kept my eyes open for a long time, trying to find one that's just a little bit larger, just a little bit heavier, just a little bit more comfortable, but still keeping the minimalist aesthetic, the excellent value for the dollar, and the complete lack of show-offishness. I still haven't found one.Oh and this thing is completely silent too.",
                        "timestamp": "Reviewed in the United States August 20, 2019",
                        "profile_id": "AGV3NQRCNK7CDQGRREFU5XLAH3XQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RVKUGW9LUI2K3",
                        "title": "4.0 out of 5 stars Versatility and appeal",
                        "author": "Doxy",
                        "rating": 4,
                        "content": "I haven’t purchased a good, everyday watch in a few years. I have been looking for something that is simple, yet, eye-catching. In other words, I wanted something that could pretty much go with many different styles, but still be able to draw attention no matter what I am wearing. Then, I came across this watch.This Casio watch is advertised as a men’s watch, however, I believe both men and women can rock this watch. Admittedly, I was a little hesitant when first purchasing this product because of the low-cost, however, the simple and sleek design won me over in the end. As stated before, this watch is very simple, but it has a classy edge to it with it’s all black color and golden accents.Pros:~Simple design~Goes with almost any outfitCons:~The band of the watch feels cheap~A sort of snug fit on my wrist~The face of the watch seems a little smaller than expected.I would definitely recommend this product to someone who needs a versatile and cheap, everyday watch. I would not recommend this to someone who is trying to invest in a nice high-end watch that will last for years to come. Overall, I am very happy with my purchase.",
                        "timestamp": "Reviewed in the United States September 17, 2016",
                        "profile_id": "AFG5IPUEJMJM3N7R3N6JACX62T3A",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2UZK3C3NQ57DO",
                        "title": "5.0 out of 5 stars Thin, legible, dressy, modest, discreet, comfortable",
                        "author": "Sam H",
                        "rating": 5,
                        "content": "You don't want people to see your stupid $100-$400 dress watch (or some humongous quartz chrono) and think you're some pretty-boy that's trying to be fashionable, do you? This watch looks like, (a) you don't care what other people think of your watch, and (b) you know what watch looks good. It works as a dress watch and you can go totally casual without taking it off, because nobody's gonna think you're a stuffed up peacock with this on. At the same time, they won't think you're a plebe for wearing a $100-$400 quartz watch.Give it a try... it's only $10, and then you can go higher if you need to.Of the MQ24's I'd say this is the best one, followed by the MQ24-7B and the MQ24-1BLK. The white dial versions don't do as well in short sleeves, in my opinion. The other MQ24's don't look tasteful at all.Also consider the MW-59, which is a bit larger with a date.A practical note: I originally got a MQ24-1B a decade ago because my backpack kept getting caught on a bigger watch when taking it off. It was thin enough to avoid that problem. And likewise, the MQ24 today is still thin enough to slip under any sleeve.",
                        "timestamp": "Reviewed in the United States February 12, 2018",
                        "profile_id": "AEFL65LIRQE5UY5OZB6NDTNEFAFQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2P7YKAFH4TKHI",
                        "title": "4.0 out of 5 stars This is something 808s & Heartbreak-era Kanye West would wear",
                        "author": "mikedoeseverything",
                        "rating": 4,
                        "content": "At first, the MQ24-1E will appear to look like a joke watch--something a kid would wear. Some may even argue: \"This is a woman's watch.\" It's small. This is true; make no mistake. And you may think, what self-respecting adult would ever wear something like this? I get that, truly. And again, the watch is fairly small (hence the 4 instead of 5 stars). But if you can get over the size of the watch (and I cannot stress this enough, this watch is TINY) it really, truly is a minimalist masterpiece. As a matter of fact, with each passing day, I can begin to see how a smaller-sized watch like this could enhance the appeal of something as minimal in design as this timepiece. It is black with gold accents and that's it, pretty much. No Indiglo. No Sapphire Crystal. No chronometer. Just simple, to-the-point, cheap and efficient and elegant. There really isn't much else say.NB: Pictures of this product are, in my opinion, very important, as it really can come as something of a surprise (the size of this watch) to some people if they are uninformed. Attached, are four pictures of the watch to remedy this situation.",
                        "timestamp": "Reviewed in the United States March 20, 2015",
                        "profile_id": "AHB32CSQDR36OLNL26XUI7YPVICA",
                        "is_verified": true,
                        "helpful_count": 116,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3L7HDI3IO2F45",
                        "title": "4.0 out of 5 stars nice watch but battery life a question mark",
                        "author": "Lance B. Sjogren",
                        "rating": 4,
                        "content": "I bought two of these about the same time so I would have a watch plus a spare watch. One went dead today. I dug through my old orders to see how long I had it. Got it in May 2012 and it conked out late Dec 2012.So that is 6-7 months life on one battery. I was going to buy a new one since I figure the battery is liable to be more expensive than just getting a new watch.I am used to watches lasting years on one battery. Probably because this is nice and lightweight it probably also has a nice and lightweight and unfortunately also low-lifespan battery.I may try to spend a bit more and get a watch that runs longer on its original batteries.------Note: Of the two watches I got of this model at about the same time, the battery went dead on one in about half a year but the other is still running after about 15 months. I conclude that there must have been something faulty about that one. So this watch does not seem to have an inherent problem with low battery life as I previously believed. I will bump up my rating to 4 stars instead of 3 if I can do so.",
                        "timestamp": "Reviewed in the United States December 31, 2012",
                        "profile_id": "AHXII33KPKM4TBF3UCZJUOVHU3YQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R32DGUWIB2I3CJ",
                        "title": "5.0 out of 5 stars Pretty tough classical design watch.",
                        "author": "RiverTim",
                        "rating": 5,
                        "content": "Withstood a week of kayaking in Caribbean just fine. I've owned 5 of these. The battery lasts 1-2 years. I like that it has a slim profile: won't catch on stuff.",
                        "timestamp": "Reviewed in the United States February 7, 2024",
                        "profile_id": "AERUTIEVFL2TQY4UAN3WOLSQI6FQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSHM",
                "product_name": "Casio Men's MQ24-1E Black Resin Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:23:06",
            "updated_at": "2024-10-17 11:23:26",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252640263951104001",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=5",
                "asin": "B000GAWSHM",
                "page": 5,
                "pages": 490,
                "reviews": [
                    {
                        "id": "RH6KQT47D1EZY",
                        "title": "5.0 out of 5 stars The Best Is Not Always Expensive",
                        "author": "Lew Troop",
                        "rating": 5,
                        "content": "I now have several of these fine, inexpensive watches simply because I fear the day that Casio will realize that it's too great a bargain and withdraw it. Beyond the fact that it keeps excellent time, there are some more subtle virtues. It doesn't look expensive or cheap. It's looks black and discretely sophisticated. It goes with anything including, I'm told, I've never tried it, a shower or a swimming pool and, if it does and things don't work out, at the price offered you can easily, quickly (It's on the Prime list so there's no cost in shipping and it arrives promptly in a couple of days...) and no one knows-or probably care-that you've had to replace a watch. (A friend suffered the embarrassment of having to take a \"used\" smart phone to the repair place. So far so good. They had questions about certain \"substances\" that were found in it which was when it was revealed that it was recovered by a plumber from a clogged toilet.It's reliable, comfortable and the only slight negative is that if it's very hot, your wrist might sweat a bit. Of course, if it's that hot, other places will also be sweating and who will care about a sweaty wrist? AND if you're paranoid about sweaty wrists, at the price you can easily have a spare that is dry and ready to roll. An excellent purchase which I've had for several years. And worth every month of it.",
                        "timestamp": "Reviewed in the United States February 28, 2014",
                        "profile_id": "AFAREGILHZH2KUBEMIPIIC2K6RRA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2QUC6HP4215YX",
                        "title": "5.0 out of 5 stars Love It",
                        "author": "Daniel Manz",
                        "rating": 5,
                        "content": "Looks great and no one would ever guess it costs under twenty bucks. My only wish is that it had more holes as I often find myself either a little loose in one or a little tight in the next, but I have small wrists.",
                        "timestamp": "Reviewed in the United States December 4, 2023",
                        "profile_id": "AFYGHFW2HU2SNMCPLONT26HGI46A",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R13F1YBOH252ZY",
                        "title": "5.0 out of 5 stars Best watch for working men.",
                        "author": "Sparkyskr",
                        "rating": 5,
                        "content": "Lasted longer than many watches. Watch band broke and replacement difficult to find. New watch was cheaper choice.",
                        "timestamp": "Reviewed in the United States March 26, 2024",
                        "profile_id": "AEFL7KCEBJDZY3P6C27XLKGG2NZQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3J27OP894PICN",
                        "title": "4.0 out of 5 stars Watch has arrived",
                        "author": "Lucy",
                        "rating": 4,
                        "content": "Plus: Watch arrived on time.Cons: Watch is for husband as part of a surprise along with another watch. First glance at it, disappointment is the only word to describe how I felt. The watch doesn't look as nice in person as the picture even though it is the right product.I have a feeling that it is not 100% new, because the manual was not placed at the right section and the watch hands were already moving. Generally a new watch would not come as such to prevent the battery from being drained.I may have to give this to hubby early instead and if he doesn't like it as a generic watch to wear around, then I will have to return it.I will update again after getting a closer look at this watch later.Update 1/9/2013:I upgraded from 3 stars to 4 because I gave the watch to hubby last night who seems to like it more than me. When he removed the plastic off of the dial, the watch did become better looking in my opinion. Hubby said it is a cheap watch so he doesn't have to worry about scratching it like his other watches. The band length is good and fits his wrist fine.",
                        "timestamp": "Reviewed in the United States January 8, 2013",
                        "profile_id": "AGL3VZ7WEA3Q3TXBP5X65UVVMIWA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RIP9HPMMXI8XG",
                        "title": "4.0 out of 5 stars Don't fit",
                        "author": "Erick",
                        "rating": 4,
                        "content": "The watch didn't fit in an adult's hand.",
                        "timestamp": "Reviewed in the United States September 17, 2023",
                        "profile_id": "AE34QDL7TU57APUWU2ZCV77ANEFA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R28GYOCFL8YUDG",
                        "title": "5.0 out of 5 stars I keep buying this watch.",
                        "author": "Anthony",
                        "rating": 5,
                        "content": "I first bought one of these in the mid '80s, when it was $40 and minimum wage was $4. I've bought three more since then. I love the minimalist face, and the lack of bulk - I don't need the whole world to see that I have a WATCH, just something I can put on my wrist and tell time.A few caveats:It's smallish, so if you need to show off your watch, it's not the right one. You should probably get a big gold watch instead.It's analog, and has no numbers, so you need to be able to read a clock without the numbers there for you. And be able to recognize if the writing on the face is upside down, as the current styling doesn't distinguish the 12 from the 6 unlike previous versions.The face scratches; if you go rock-climbing, or work with sand a lot, it will become unreadable eventually.The o-ring seal inside doesn't always go back into place nicely after you've changed the battery; this led to the untimely demise of one of mine. You can get replacement o-rings, but it's a pain.The band is cheap plastic; it will eventually break and you'll need to buy a new band. This will happen far sooner than anything else will go wrong, unless you're very gentle with your watchband.",
                        "timestamp": "Reviewed in the United States February 26, 2015",
                        "profile_id": "AHP4GHMO2V5SCF2Y6RJRKFQM7ZSA",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": ""
                    },
                    {
                        "id": "R4G1HMM8IEI3W",
                        "title": "3.0 out of 5 stars Small",
                        "author": "Abdugani",
                        "rating": 3,
                        "content": "I gave it to my brother but it is better suited for women or children",
                        "timestamp": "Reviewed in the United States February 9, 2024",
                        "profile_id": "AHRYN7K572MWBEVYZJ6DN457NJQQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3R8JKXZ69AD3X",
                        "title": "5.0 out of 5 stars Perfect size",
                        "author": "Tiffany givens",
                        "rating": 5,
                        "content": "Bought for my son and he loved the size. He has a smaller wrist and it was a good size for him and easy to see",
                        "timestamp": "Reviewed in the United States January 14, 2024",
                        "profile_id": "AEO2W5GSHCJQLGNF3RXN4N5WMSNA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3I6FUSXIJDJMM",
                        "title": "5.0 out of 5 stars Beautiful",
                        "author": "Martín Reyes",
                        "rating": 5,
                        "content": "Works great and does the job of giving the time correctly. What else can I say? 5/5*",
                        "timestamp": "Reviewed in the United States February 23, 2024",
                        "profile_id": "AFHH7K5OERGRNE3BNRQIHPX5AWIQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3FTAAR7FYUNNE",
                        "title": "5.0 out of 5 stars they say every watch makes a statement. The statement here is: \"I do not care.\"",
                        "author": "Some Guy",
                        "rating": 5,
                        "content": "the Casio Men's MQ24-1E analog watch is like a friend who doesn't put up with small talk. It doesn't give a rat about life's deeper questions like \"why are we here?\", \"what happens when we die?\", or \"what is today's date?\" it doesn't have any of these answers, because it doesn't care. it cares about one thing, and that one thing is the current time. it doesn't even care if it is AM or PM. Hell, it doesn't even have numbers on the dial. you have to figure that stuff out for yourself. it's made of plastic, because nothing says \"i do not care\" like plastic.black plastic.it costs $10. if you buy a $10 wristwatch you are either so old that you think a high-quality watch should cost less than a low-quality beach-towel, or you do not care about the quality of your watch as long as it tells the time. Even if you get one that doesn't keep good time, it cost you $10. You spent more money on coffee and lunch yesterday.Way more.I bought this watch, and i couldn't be happier with it. I think it's at the bottom of a suitcase in my closet, but I'm sure if i went and looked for it, it would still be keeping perfect time and not caring about any of my other time-related questions.I won't though.",
                        "timestamp": "Reviewed in the United States December 3, 2012",
                        "profile_id": "AE33OWWVAURYINBKTADIVEKADAHA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B000GAWSHM",
                "product_name": "Casio Men's MQ24-1E Black Resin Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:23:06",
            "updated_at": "2024-10-17 11:23:27",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B000GAWSHM?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252640263951104001",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:23:06",
        "domain": "com",
        "geo_location": null,
        "id": "7252640263951104001",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B000GAWSHM",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:23:27",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252640263951104001",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252640263951104001/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252640263951104001/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252640263951104001/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640263951104001/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}