{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=1",
                "asin": "B009KYJAJY",
                "page": 1,
                "pages": 855,
                "reviews": [
                    {
                        "id": "R2J26OHZW91SIH",
                        "title": "5.0 out of 5 stars Simple, elegant and durable!",
                        "author": "VAARK",
                        "rating": 5,
                        "content": "As my eyesight gets worse with age, I was looking for a durable, waterproof, easy-to-read watch with a simple timer that looked great on my wrist. I own both a Fitbit and Apple watch – I was getting tired of being tracked all the time and getting notifications about everything (which yes, I know can be adjusted). I’ve owned Casio watches before and still have a G-Shock digital that’s been running great for almost 20 years, so after reading many reviews here on Amazon and elsewhere, it was an easy decision to make.I went with the black face and bezel model, although you really can’t go wrong with any of the other colors offered. It’s a classic diving watch that, in my opinion, looks sturdy, cleaner and more elegant than some of the more expensive competitors. Given Casio’s proven durability over the decades and the price point of this particular watch, you can't miss with this one.There are a ton of You Tube videos and review articles online about this diver (which is a bit of a cult classic it seems) – the vast majority of which are overwhelmingly positive, so I won’t add much more here that hasn’t already been stated there. One common “complaint” that I noticed though is regarding the stock watchband. Many are critical of it, but I tend to disagree.I did take the advice of some and tried a few different aftermarket bands – the Barton elite silicone, a Ritchie classic leather band, and a Ritchie nylon NATO strap (all available on Amazon). With the exception of the NATO, I personally found the stock Casio diver band the watch comes with to be the most comfortable of the others tried – not taking away from or knocking the others by any means, it’s just a “why spend the extra money” type thing for a $50-ish watch. Simply a personal thing…Re the NATO strap in my pics: I did keep the Ritchie Premium Nylon strap to compliment the watch. It really does dress it up and make the timepiece pop for more “formal” occasions if you will – and very comfortable too. For everyday use though, the stock classic diver-style band turned out to be the most practical for me – one I recommend over aftermarket options and especially for those in the trades or who are knocking around on the beach, out hunting, at the lake, etc.If I had to be critical of any aspect of this watch, it would be the luminescent capacity of the hands and markers – something also frequently mentioned in many of the reviews I read online. It’s marginal at best. When blasted with high intensity light, the markers glow brilliantly initially, but it does seem to fade quick. I mention it because if this is an important feature for you night owls, it is something to consider. For me, it’s acceptable and not enough of a factor for me to change my rating of the piece.Bottom line is that I highly recommend this waterproof diver. It’s superior quality with Casio durability and reliability at a price that can’t be beat. It keeps d***-near perfect time and doesn’t have to be charged on a daily basis or wound ever – just a simple, inexpensive battery keeps it going for a couple of years. You will not be disappointed with this one! Thx, DTEdit 2/2/2024: A word on timekeeping: Having owned this watch for a while now, it does GAIN a few seconds every month. I go to www.time.gov to set adjust time every now and then... It's still more accurate than my other watches though - amazing considering this is a $50-ish dollar piece. Highly recommend this watch!",
                        "timestamp": "Reviewed in the United States October 23, 2023",
                        "profile_id": "AFU24NBF2BCRWKS6SGSYCWO63L2A",
                        "is_verified": true,
                        "helpful_count": 54,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R21GLJC3I3HZ7N",
                        "title": "5.0 out of 5 stars great watch",
                        "author": "Kevin Matthew Spears",
                        "rating": 5,
                        "content": "This watch, especially for the price is amazing. Time Keeping is amazingly accurate and 200m/20 atm water resistance is really good along with the screw down crown. Its not over done on the dial and is a nice purely simple diver watch with a moving bezel and date window. $57 and its a great looking watch that goes with casual or a bit more dressed up clothing. The main thing I'd recommend changing is the watch comes with a 22mm watch strap. The rubber one that comes with it is a bit cheap feeling, but its easy to change with a small flathead or correct watch toolkit as amazon sells, I had an extra nylon front/leather back (wrist side) sitting around on a watch i wasn't wearing and was same 22mm, swapped them around not only is the nylon one more comfortable, it looks better too. Images in review show the casio swapped with the other watch i swapped the bands on, the silver case is the casio with the band that came factory from the black case one with the casio factory strap, as i don't wear that particular watch as often as the casio. This casio is comfortable and very accurate as well as seeming to be very sturdily built.",
                        "timestamp": "Reviewed in the United States August 22, 2024",
                        "profile_id": "AHZFSSHIPK3R4LSUC6P2MYFJEZRQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2MUW64CR5F68Z",
                        "title": "5.0 out of 5 stars Nearly Perfect",
                        "author": "Still Chilly in Colorado",
                        "rating": 5,
                        "content": "Have had this for about a week now and love it. Set it to the atomic clock via phone when I first got it and it hasn't lost or gained a single second yet. That kind of accuracy for a $45 watch is incredible. It's hefty and rugged, but not overwhelming, and sits perfectly on my wrist. Both the second and minute hands align perfectly with the indices on the dial as they make their way around the watch face. Also, the case back is perfectly aligned with the 12/6 axis on the front of the watch. The lume on the face and hands is more than bright enough to see what time it is in the dark, thought it takes a bit of concentration to locate the second hand since the lume on it is quite small. The rotating bezel has a very solid click to it, and only rotates counter-clockwise so as to be truly useful when I go diving (those who complain that it doesn't rotate in both directions are clearly not divers and don't understand how a dive watch is supposed to function). My only challenge with this watch is that my poor presbyopic eyes can't make out the tiny date without my glasses on, however there are many jewelers that can affix a small magnifying bubble over the date window for very little cost, which should easily remedy the problem. At least I knew going into this purchase that I'd need to address the unmagnified date at some point, so I'm not going to deduct anything for that. Still, Casio could fix this very minor shortcoming for next to nothing. The 200m water resistance is also a very nice feature, and is much of the reason I bought it. I don't want to have to worry about forgetting to take off my watch when I shower, dive, do dishes, wash the car, mess with the lawn sprinklers or any of the other myriad things involving water that I'd have to be a lot more conscious of with a more delicate watch. I can work in the yard or on the car and get filthy, then just wash up and not fret about getting Goop or other hand-cleaners on the watch. Being able to rinse it off or even lightly scrub it with a toothbrush and some mild soap is a huge bonus. Just make sure the crown is securely screwed all the way in. Mine was a little tough to manipulate in that I couldn't really tell at first if it was all the way out for initial adjustment, plus the first and second pull-out stops were not overtly obvious. However, given the incredible accuracy of this watch, that is a one-time adjustment until the battery eventually dies (or I travel to another time zone and have to reset the hour hand, but I can easily live with that 5-6 times a year and, if anything, will get more intimate with exactly where the proper crown click is).I switched back to a good ol' fashioned analog watch when I came to the conclusion that I just don't use all of the bells and whistles on my digital watches any more. I can read this one in the dark with nothing more than a slight turn of the wrist. No more having to fumble for a backlight button. It looks like a far more expensive watch than it is, and it's classy and \"timeless\" design will always be in style. A nice leather band will dress this up very nicely. In the event I ever lose this one or beat it up so badly that it just won't work any more, I will absolutely buy the exact same thing as a replacement.",
                        "timestamp": "Reviewed in the United States April 10, 2017",
                        "profile_id": "AHLIFEGEA4TSG2M45GZMTDLQ2IKA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1Z0U4L7W0SKP8",
                        "title": "5.0 out of 5 stars Value for money… Is a no-brainer",
                        "author": "Matt Wilmoth",
                        "rating": 5,
                        "content": "Value for Money:At its price point, the MDV106 offers exceptional value. Its high-quality construction, reliability, and stylish design make it the best watch you can get for the money.Conclusion:The Casio MDV106 is a durable, functional, and stylish timepiece at an unbeatable price. Whether for diving or everyday wear, it’s a highly recommended addition to any watch collection. Casio understands that if they are going to make a watch that is 200 m the bezel has to be competent. There are a lot of Subs on the market that have multi directional bezels. This is not one has the buzz only clicks to be left. This is a very Horton feature, if you’re diving with a watch, you don’t want to stay down and have your basil move attention to detail from Cassia for a $50 watch.",
                        "timestamp": "Reviewed in the United States May 27, 2024",
                        "profile_id": "AHAYRKV5AQ2YV6Z4UGWKLNWL3KDQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3M4DPAUX44E66",
                        "title": "5.0 out of 5 stars Gift for Boyfriend",
                        "author": "AJ Jonkoski",
                        "rating": 5,
                        "content": "My boyfriend only had two cheaper watches, and this watch looks so clean and nice for the price. According to him, its easy to use, and durable. I got him a leather band for it which was also easy to switch. Both bands have a good adjustment and fit nicely for any wrist.",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AGLFINYJMCPWGJIX32JNYXL2UA5Q",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RXB66OUNZD6R8",
                        "title": "4.0 out of 5 stars Casio Duro: Get It Before It's Gone!",
                        "author": "Bill Foster",
                        "rating": 4,
                        "content": "This is by far the most elegant design ever put out by Casio. No wonder it has such a cult following. When I heard Casio had released a new model without the Marlin logo due to some licensing deals expiring, I said it was time I got my Marlin! Here are a few things you may want to know before you buy: Specs: - Case Size: 44 MM- Thickness: 12 MM- Lug-to-Lug: 48 MM- Lug Width: 22 MM- Weight: 92 grams- Movement: Quartz (Casio 2784) - Crystal: Mineral Glass- Water Resistance: 200 Meters - Screw-down Crown and Case Back- 120-Click Unidirectional Bezel (Timer Function)- Battery Life: 3-5 years (anecdotal)Pros 👍👍👍- Design: Simple, Classic, and Elegant. - No Ticking Noises: If you're anything like me and hate the ticking noises mechanical clocks and watches make, you will love how quiet this watch is! - It Clicks: Satisfying bezel action.- It's a lot smaller than the dimensions would have you believe. - Value: At 50 bucks, this watch is insane value for your money. Even at an MSRP of $75, it's an excellent choice for just about anyone. Cons 👎👎👎- Honestly, I can't think of any! - One more thing: considering the price, anyone complaining about the quartz movement, lack of sapphire crystal, or stiff resin band should be ignored. It's a 50-dollar watch, and an excellent one at that! Final Thoughts 🧐This is an iconic Casio watch. Whether you're a Casio enthusiast wanting to complete your collection or you just want a diver-style watch on a budget that looks good and works reliably, this Casio Duro is an excellent choice. It looks great and wears well. However, if you have a smaller wrist, this particular model may feel a bit bulky, and at 92 grams, you will feel it on your wrist. That should not be a problem if you only wear it once in a while when you want to dress up for an occasion. I use a Casio Royale as my daily watch and switch to a Marlin on occasion. I've fallen in love with this watch, and so will you! I hope my review has helped you make an informed buying decision 👍😊✌️",
                        "timestamp": "Reviewed in the United States June 30, 2023",
                        "profile_id": "AE27QLIMXYQBTPI3UFZ6V5WZRQ7A",
                        "is_verified": true,
                        "helpful_count": 27,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1QHYF887YJK81",
                        "title": "5.0 out of 5 stars Best Budget Watch on the Market",
                        "author": "Ken Matthews",
                        "rating": 5,
                        "content": "I’ve wanted a diver watch for a long time. The appeal of wearing a watch style made popular by navy seals and action stars is obvious, but as a budding watch collector on a budget, often the price tag for a good diver is staggering. When I found the Casio Duro I was at first dubious about the quality due to the price. Having smaller wrists also made me concerned that it wouldn’t even fit. But after reading an article on Hodinkee about the Duro, and spending hours on Amazon reading reviews I decided to go for it.The Casio Duro lives up to the hype. I’ve been absolutely loving this watch. It looks, feels, and wears like something much more expensive. The screw down dial and bezel (a little stiff at first) work as advertised, and the lume surprised me with its performance at night. The weight feels great on the wrist, and it doesn’t feel too big or chunky even on a smaller guy like myself.It keeps time well, and though I’ve had to adjust it about once a week for a 30-60sec correction, it really doesn’t bother me.Be sure to get some bands to go with it. The stock band isn’t terrible, but it’s not great either. NATO works well for me. Be careful about the lug measurement though. I ordered 20mm for my bands, and they didn’t fit. I think it’s more likely 22mm, but I haven’t confirmed this.Overall, for $50 this is one of the best budget watches on the market. Casio has built its empire on budget friendly quality watches, and the Casio Duro is quite possibly the greatest testament to that legacy.",
                        "timestamp": "Reviewed in the United States June 13, 2024",
                        "profile_id": "AGRMN32P33AMSZNVNUTXHF353HZA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1VFORFELKE7BY",
                        "title": "5.0 out of 5 stars Thank you Casio Updated 4-27-21",
                        "author": "dave",
                        "rating": 5,
                        "content": "I received this watch on 1-20-2018. I received my first Casio watch on Christmas morning somewhere around 1979. That watch, a simple, black plastic digital one, kept working for about 15 years, on the same battery. This wasn't any great feat in my mind at the time. It was just all I really knew, except for the time when I got an Armitron calculator watch at some point. Not only did the Armitron not last, it also felt like it wouldn't last. The buttons were flimsy, the edges rough, and it had an overall plasticky feel, even though it was gold. My old Casio shined by comparison. My dad got himself the same one as me that Christmas, except in stainless, and anytime it came up in later years, he'd laugh and say something like \"David, I think I wore that watch for thirty years and I only replaced the battery once.\" So that is what Casio is in my mind.One time at the office I said to a coworker that Casio was the best watch in the world. Of course he laughed and quickly pointed out that there are FAR better watches. And he was certainly correct, but not for the money.I've had a few other Casios in my life. A Forester model which was really cool because of the forest green color and the fact that it was a fishing watch. What \"fishing watch\" actually meant was that it would tell you the about the ocean tides. Living in New Mexico, this was totally useless, but I still liked the little fish that would appear when the tide was high or something. Another Casio I got was the one with the world time with the atomic clock sensor. This one was a little off. The light stopped working after a while and setting it was a pain. But it's still ticking in my drawer right now after eight or so years and I still wear it here and there.But probably not anymore.This watch...this watch has me all smiles. I don't really have words to say. I'm not necessarily a \"watch guy\" in that sense, but I have always had one on my left arm since the age of ten or so. And honestly if it wasn't for Casio, I probably would have skipped wearing one mostly.Casio doesn't always hit it out of the park. After all they live and breathe like the rest of us. Maybe that's what makes this one such a beauty.I bought a very nice Bulova a couple years back for around $400. I like that watch. I get compliments on it and for good reason. It's solid. It's heavy. They paid very close attention to the design and the finish is beautiful. It feels like a $400 dollar watch or more. It is perfect for wearing to the office. Well, not really. Not since 1-20-2018.I don't dive. I have never diven (?) OK I have never dived. But something about a watch that is designed to be SIX HUNDRED FEET UNDER WATER AND STILL WORK gets me interested. There are many watches that can do this and much more, but they are not this watch.If I was a Viking, this would be the watch I wore.So what can I say? Yes, the date is comically small. I need reading glasses for small print and still can't read the date with them on. I guess most people who have not just come out of a coma should know the date. Touche, Casio.Oh and the Lumiglo or whatever is weak and nearly pointless, but at least it's there. I do like to light it up with my phone flashlight and look at it in the closet, however.But if I tap the crystal with my fingernail you know, it feels like I am tapping bulletproof glass.The bezel has a great click and I actually find myself using it! I use it to time my commute, or to time how long the waiter takes to bring the food out after I order.This is the kind of watch that is not going to win you any likes or impress anyone, unless they are a very smart, unselfish engineer type. Maybe. With my Bulova, people have actually wanted to hold it, they have examined it closely and then complimented me on it, gave it back, and then looked at it on my arm as if they may mug me later. This one won't really do that. You are the only one who will ever truly appreciate what this watch is. It's a secret love affair. I like that about it.A few things that I will say that I haven't read about it in those other reviews. The band for one thing. It's pretty good. It looks all plasticky and horrible in the pictures, I thought anyway. But in fact it is pliable, if not supple, and rather well proportioned, if not svelte. The clasp is also sort of excellent. It's not cheap. It's like they actually realized that the clasp is just as important as the other parts. It's like some executive with Casio said \"The clasp is the most important part of any watch. It's what keeps it on. Make it beefy.\" Yep. That's exactly what happened. It is well made, with a soft, rounded finish, and it makes a nice clink sound when you are putting it on.There's really nothing more to say.Except when I look at this watch to see what time it is, I know the time within .003 seconds of my eyes seeing the face. It's just so clear. And functional. And simple. I never really thought about that with any other watch, and I love it.So I'll stop now, but expect an update when this watch becomes less of what it is now, or in the year 2040, whichever comes first.***UPDATE*** April 27, 2021The watch has become slightly less of what it was then, but not really. Let me explain. This thing has lived on my arm most days since I bought it. That's about 1,200 days. Before you ask, I do not take the watch into water. No showering with it, no swimming with it. I don't sleep with it, but I do remodel homes here and there and other sweaty messy things too and it gets dirty sometimes.Anyways, my first tiny little bummer happened last June, though it was so tiny I did not do an update. The bummer was that the battery died. Bummer. So I took the watch in to some random fancy jewelry store I found on Google maps, and they replaced the battery. I waited five days for the job to be completed and it cost twenty bucks. I got the watch back and all was well. Then about four months later it died again. This time slightly more furious, I went to a little jewelry store I happened to be driving past and this guy took it apart, checked the battery, which he said was perfect, cleaned it really well and said it was probably just dirty inside. I suspected shoddy workmanship and/or a lack of attention to detail on behalf of the fancy place. So I was on my way with a clean, healthy watch. The guy didn't charge a dime and did this on the spot and it took five minutes. He was a pro.The watch actually seems to keep even more perfect time since that happened. Seriously.And then the other day the band broke while putting it on. (See pictures)I just ordered a genuine replacement band from Casio, and I noticed in the pictures that the replacement says Casio JAPAN on it, while my original one says CHINA. (See pictures) So I have high hopes for the new one.Other than these two things, the watch has been stellar.",
                        "timestamp": "Reviewed in the United States January 27, 2018",
                        "profile_id": "AHZ5PGXLPW6C5E562KCKQX5EPOGA",
                        "is_verified": true,
                        "helpful_count": 1530,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3K9VIGI8CZX0N",
                        "title": "5.0 out of 5 stars Value diver look, less tough than I originally thought",
                        "author": "Buddy",
                        "rating": 5,
                        "content": ">>Update 12/16/23<<I loved this watch for a few years. I loved the value for such an elegantly simple watch with such a rugged design. I really like the expansion of the new design options. Over the long term, however, I no longer have faith in the build quality of this watch.The first two of these lasted just over a year before they started loosing time. The case is bullet proof and the band is probably the toughest I’ve ever seen from a soft, flexible silicone/plastic band. However, my third one started loosing time only a few weeks after I started wearing it daily. I suspected this happened with the first two because the case is so heavy that kinetic type shocks and vibrations happen with extra force due to the extra mass which eventually damages the movement inside, likely the gears. But it happened so quickly with the third one and there was no sharp strike or vibration which should have caused it.To be clear, I’m EXCESSIVELY rough on my work watches (see the original review below). However, I became disappointed with the sturdiness of the movement installed in this watch. This watch does have a great, simple diver look and if you don’t beat the heck out of watches working in them they may hold up just fine. However, due to my waning confidence and the fact that the price has increased from $32 to $49 (but mostly the former) I don’t think I will be purchasing this watch any more.On the other hand, my current favorite work watch is the Casio AQ-S810W, “Tough Solar”. It’s not the same look as this watch but it has held up much better. In fact, it has held up the best as a work watch of any watch I’ve ever had. If you’re looking for tough maybe give that one a look. If you’re just looking for that diver look (but maybe not quite as tough) I still think this one is a good deal.>>Update 12/16/18<<I mentioned the simplistic look in my original review. Paired with the black silicone band that comes with the watch it is a bit of a utilitarian look. That’s fine for a work watch, quality silicone bands have a lot of advantages: they are very durable, very comfortable & very easy to keep clean day in & day out. On the other hand, I bought a few NATO/Zulu watch bands to swap around & use on a few of my watches for about $9-$13 each and what a difference!Almost all of my watches take a 22mm band (including this Casio diver) so I could swap them around & see what pairings I like the best. In addition, NATO/Zulu bands take about 5-10 seconds to swap out (without the use of tools once you have the old strap removed & spring bars in place).I added 2 pics to my review. One is my work watch (that I’ve been working in for about a year now) paired with a nylon band. By the way, it was actually my least favorite band which is why I put it on the work watch but it still looks really sharp! The other is my newest watch paired with a leather band (yep, I love this watch so much I got another one so I’ll have one I haven’t beat to death by working in it). It looks absolutely outstanding to the point it even makes a beautiful dress watch (albeit one that will take a heck of a beating!).Guys, I love watches. I already had an excellent dress watch. I have a Luminox blackout that I love. I have owned, literally, dozens of watches. This watch is the best value of any watch I have ever encountered and is one of my absolute favorites, ever. It’s an excellent work watch, an excellent dress watch and anything in between.>>Original Review<<To summarize: I’ve found this watch to be tough, functional & an unbelievably good value.Now, I’ve worn a watch 24/7/365 since I was in 3rd grade. If I can’t wear a watch to bed, in the shower & when I jump in the pool it’s not for me. While I have different watches for different needs (work, every day, dress, SCUBA diving) I have no need for a delicate, fragile watch. Also, doing HVAC, I work with my hands. Suffice it to say, I beat the everliving crap out of my work watches. I have been through dozens of work watches of various styles & brands through the years. By now Casio is pretty much the only brand I buy for work watches. In my experience, no other brand has even come close to the right balance of features, toughness, value & looks.I got this watch for a work watch. It has a clean, simple look, as most divers do, which makes it pretty easy to tell the time at a glance. It’s a tough, tough watch that takes a heck of a beating. That goes for the band as well. You could pair this watch with a better looking band but the silicone band that comes with it is made for comfort & longevity. Bands like this tend to last at least 2-3 years, even with the roughest of daily wear and they are extremely comfortable, especially after you break it in for a few weeks. The rotating bezel makes for a good, simple timer and the highly visible red second hand makes for simple timing for shorter periods. The low profile & smooth edges means it doesn’t get caught easily, even in tight areas.I’m going to give you some information but I want you to keep it in perspective. The dozens of work watches I’ve gone through before I started using Casios rarely made it even 6 months. I’m HARD on work watches. So my first one of these watches made it about 13 months before it developed a problem. It would loose time about once or twice a week. It would loose, maybe, 15 or 30 minutes suddenly and replacing the battery didn’t help. Now, for a work watch to last more than 12 months is very rare for me. Even the Casios that are still in working order after a year are so beat up I would replace them, always with a different watch that I thought had an interesting & useful set of features. But, for the first time, I replaced this watch with the same watch because I had liked it so much. My current one is 11 months old and still holding up quite well. Who knows, this may be my work watch for now on. This solid stainless steel case is practically bullet proof.That brings me to the negatives. That solid stainless steel case is relatively heavy. I have had heavier watches that beat up my hand & wrist. This one isn’t quite that heavy to me but if you’re used to Casios (which tend to be, overall, lighter than most watch brands) you may notice this watch is a little heavy. Having said that, it’s noticeable when you first put it on but I’ve gotten used to the weight very quickly & easily & it doesn’t bother me at all. Also, I would note the simplistic look. There are advantages & disadvantages to that extreme simplicity but it is perfectly inline with the style of a diver. I like the look of divers but it isn’t exactly the flashiest style for a dress watch. On the other hand, you could put a different band on it and enhance the stylishness quite a bit.So, this watch is, in my opinion, probably the best value I’ve seen. It’s a tough watch for a great price.",
                        "timestamp": "Reviewed in the United States November 5, 2018",
                        "profile_id": "AHDDZOT5ZGKNLYEDM27VRTZBHUQQ",
                        "is_verified": true,
                        "helpful_count": 209,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3OOGHC38NM5ZJ",
                        "title": "5.0 out of 5 stars Casio MDV106 - Best Dive Watch for the Price",
                        "author": "Karim Morgan",
                        "rating": 5,
                        "content": "Let me start by saying that I'm a watch collector with over 50 watches in my collection, most of which are automatic and some very expensive watches. I bought this watch to use as a beater watch to replace my Seiko SNA411 that jumped up in price drastically. I was going back and forth between this 44mm and the newer MDV-10 38mm. The MDV-10 isn't really a dive watch and all the specs are a downgrade compared to this MDV-106 in my opinion.THE GOOD-------------Well, where do I start? For $50, nothing beats this watch and I mean it. The quality of the finish is outstanding. The dial and hands look super nice. Being a quartz, the watch is super accurate. Mine runs at around +15s/month. The hands line up very well with the indexes on the dial. The watch has a proper screw down crown that sits almost flush with the crown guards and a proper screw down case back. The bezel is a unidirectional 120-click bezel that has an amazing click feel (much better compared to my Seikos) and lines up perfectly with the chapter ring and the dial indexes. There's absolutely no play at all in the bezel. While many reviews bashed the strap for being a low quality strap, I actually find it quite comfortable and very suitable for daily wear. The watch is super easy to dress up or down depending on how you like to wear it.THE BAD-----------There's really not much to complain about at this price range. One of my gripes (not a problem with the watch itself) is the size. This watch has a 44mm case diameter. I have a 6.25\" wrist and the watch looks big on my wrist. But it sits nicely with no wobble because the case thickness is around 12mm and lug to lug measures at 49mm, which is reasonable. Lume is mediocre but again, it's a $50 well built watch, so nothing to complain about here. My final gripe is the date window and the text size for the date being too small for my aging eyes.THE VERDICT----------------Don't think twice about this watch. If you're looking for a daily, reliable, accurate, good looking, well made, true diver watch, this is the one to go for. I regret not adding this to my collection earlier.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AEXQKJW7YB7RBUHXZVUMDACUGRGQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B009KYJAJY",
                "product_name": "Casio Men's MDV106-1AV 200M Black Dive Watch (MDV106-1A)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:42:36",
            "updated_at": "2024-10-17 11:42:44",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252645169701330945",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=2",
                "asin": "B009KYJAJY",
                "page": 2,
                "pages": 855,
                "reviews": [
                    {
                        "id": "R1VQ3SSP23T4VQ",
                        "title": "5.0 out of 5 stars My first dive watch I love it, thank you!",
                        "author": "KrypticAwakening",
                        "rating": 5,
                        "content": "The plastic strap that comes with it is not horrible, but then again I'm not too picky with straps. I like how the rubber isnt sticky like some other rubber straps, so it feels fine even after a shower. I also wanted to try 2 different straps for the duro, one leather for formal occasions and one nato strap (which I modified cuz it's better) as a daily. And I got a black nato strap with black coated hardware, it's awesome and is my fav way to wear the duro so far.It's my first dive watch and it looks and feels amazing, next dive watch to get would be the citizen promaster that is next for sure.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AH3OCO5BYKNGWLOU7PQZXZWU47QQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RAPHZ2BRQWVSD",
                        "title": "5.0 out of 5 stars Oustanding Dive Watch",
                        "author": "John M",
                        "rating": 5,
                        "content": "I bought the Casio MDV106 \"Duro\" because of the favorable reviews I've seen on YouTube and wanted an actual diver style watch for an affordable price. I wanted something that could be versatile and built for daily wear. As the reviews have said, it's an elegant and sophisticated looking watch that I can take swimming or to a nice restaurant. I'd love to buy a Seiko or Citizen dive, but my budget doesn't allow for that. This is a really nice alternative that doesn't look or feel like a concession. As for the watch's aesthetics, the black background with white hands and silver lining reminds me of some of the the Seikos I've admired. The hour markers are simple, but elegant. The date window very legible. The size and weight are perfect for my 7.5\" wrist. Any larger and it would look unwieldy, any smaller and it would look like a woman's watch.One important note: The crown is locked. To unlock, rotate the crown counter-clockwise until it pops loose, then you can pull it out for time & date adjustment. After you've made the adjustments, push the crown in slightly and turn it clockwise simultaneously. Keep turning clockwise until it stops. If you don't \"lock\" the crown, as described, taking the watch into water will ruin it.",
                        "timestamp": "Reviewed in the United States August 22, 2024",
                        "profile_id": "AFX5DYLW6GFQFIOVCVAMNIQHYMWQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RYMY8LFEV05BX",
                        "title": "5.0 out of 5 stars Such a great watch for the price!",
                        "author": "Al M",
                        "rating": 5,
                        "content": "I loved this watch so much that I bought two of them on the same day, (one with Casio stainless bracelet, and one with the rubber strap). I’m sure I’m not the only one who can agree that this watch is way out of its price range! It’s such an outstanding timepiece and the quality can be compared to that of Swiss Army Victorianox, or a Citizen Promaster Dive Watch, or a Seiko Dive Watch even. At such an unbelievable and unbeatable price, it’s impossible to turn this beauty down! The marlin imprint on the back case and on the bezel, is truly amazing to look at. This watch should be priced in the 400-600 price range. You get it at a fraction of that cost! Must have for sure!",
                        "timestamp": "Reviewed in the United States September 16, 2024",
                        "profile_id": "AETS4EEGWQ5LYUQBIL4YF2N436CA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3DQNI4ZMBFUKF",
                        "title": "5.0 out of 5 stars quality appears to be good",
                        "author": "JRRRRR",
                        "rating": 5,
                        "content": "This watch is water proof as stated. I have used it in the pool several times and there have been no issues with water getting into the watch. The only issue is the date window is very small and hard to see, also the luminous markers do not glow for very long but not an issue for me, just don’t rely on seeing the markers at night.",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AEGK6UEPW5SWE6YAEOFVX5F34LMA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1JOB08JGQ8S7N",
                        "title": "5.0 out of 5 stars Duro fits the Mako oem 22mm bracelet!",
                        "author": "Crisis Doc",
                        "rating": 5,
                        "content": "So of course, like millions of other watch lovers, I eventually succumbed to the hype and purchased the venerable casio Duro. I held out for so long fearful of the 44mm size, mineral crystal and quartz sensibility.In the end what got me over the hump was losing yet another orient mako in the dust; my first one was lost at sea when a particularly robust wave in Hawaii hit it knocking it off it's bracelet and a second used model recently, when I foolishly tried to regulate it myself (risks of ebay purchases) and just couldn't keep away from the hairspring (this one also had a stuck day pusher so wasn't completely missed).I still had the OEM bracelet from the original mako, since I never really liked it on the watch, feeling it was too bulky for the 41mm case, and this was probably why I lost the watch (the aftermarket bracelet I swapped didn't fit as well).However I still kept the bracelet as it remained the only reminder of the watch which was gifted to me from friends and colleagues when I left a particularly loved place of work, for a move out of town. However, this time I waffled on getting yet another orient mako, as I wasn't as enamored of it as I was previously. I hated the bezel that looked great but could barely be turned. And I was never a fan of the day date window (too cluttered and date is sufficient) and non winding inaccurate automatic movement. I wore it rarely...So I decided this time to look into possible alternatives to fill the cheap name brand Japanese dive watch slot achingly waiting to be filled, and hopefully one with 22mm lugs so I could repurpose that bracelet and still be reminded of that gift. However all the options, aside from the mako, were well above 200$ (unless I risked going used and perhaps reenacting how I lost my last Japanese dive watch). I wondered if it was worth risking only $50 to see if the Duro would fit. And it did!And like so many others, after finally seeing the Duro in the flesh, I succumbed to it's charms. it's not that big...an omega planet ocean 43.5 is as big if not bigger so well wearable on my 7\" wrist; also on casio quartz watches, the seconds hand hits all the markers! the lume while not superb still reads at 4am if charged before bed, which is better than my Invicta 1953. The sunburst dial and marlin logo is charming. And the 120 click unidirectional bezel is much better to use than the mako one and still aligned correctly, unlike the one on my 1953. Also the mako bracelet size and minimal taper fits this case size much better than it ever did on the mako. And the bracelet seems to elevate the duro as well, making it seem so much more premium. A match that works in so many ways! And now with many more watches in my collection, I see the value in having a quartz daily as it is always ready to return to when I've rotated something else in temporarily.Now I have a new daily beater that I like wearing a lot more. It allows me to see that gifted orient bracelet on a regular basis and keeps yet another important sentimental item in the rotation. So glad I went for it!Addendum: as this is the mdv 106 (vs the 107), this is the model that has the Marlin which is now discontinued per the license apparently not being renewed. I'm glad I got this version as it won't be available when the current stock runs out. Something to consider if you are on the fence and want a new Duro watch with the marlin logo on it.",
                        "timestamp": "Reviewed in the United States October 2, 2023",
                        "profile_id": "AHWKLYQZQOTX6KSXY3BDCN7FEOSA",
                        "is_verified": true,
                        "helpful_count": 20,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3PTC971YZHY1X",
                        "title": "5.0 out of 5 stars Great Inexpensive Waterproof Quartz Watch",
                        "author": "Customer",
                        "rating": 5,
                        "content": "I'm a watch snob. I hate quartz. I prefer mechanical watches. Even so, I really like this watch and I wear it now as my daily driver. I'm quite surprised that I could learn to love a cheap $40 watch like this one.I have a collection of elegant mechanical wristwatches, that include everything from the basic stainless steel Swiss dive watch to more expensive French and German horological timepieces with power meters and moon phase complications (but no tourbillions). I bought this watch to replace my daily driver, which was a fully mechanical oyster day-date watch by a famous watch company. My previous daily driver had a band that kept failing due to a heavier than steel case and a band that allowed too much force to be transferred to the spring bars when I would bump the watch into something. As a result the band would bend the spring bars and detach from the oyster case whenever I bumped the case once too often and too hard. (I do this a lot, I'm very hard on watches and I end up eventually destroying every watch that I wear as a daily driver.) My last daily driver invariably ended up have a let-go by the strap while loading some gear, causing it to go bouncing to the ground. My nice day-date mechanical watch ended up taking regular beatings. I typically had to replace the spring bars once every month or two. The third time that I had to replace the crystal I decided that the body was so beaten that I wasn't going to repair it any more. I needed a more durable cheap / disposable watch that I could afford to sacrifice to the rigors of daily activity. The Duro fit the bill.I had reservations about the Duro for several reasons, one being that it's quartz, and I hate quartz watches. I got into mechanical watches because I don't like dealing with the hassle of replacing quartz batteries. Another reservation is that no real dive watch can have a quartz battery, for obvious safety reasons. Another reservation is that I don't particularly like leather or rubber/silicone bands, and prefer a heavy metal oyster-type bracelet. Perhaps the biggest reservation was the ridiculously large size of the Duro, which is so large that it's comical -- the lug-to-lug distance is 48mm and the case diameter is 44mm. With a 44mm case diameter the Duro definitely qualifies as a Bozo / Stallone / Schwarzenegger watch (think Panerai).Much to my surprise, the Duro \"wears smaller\" on the wrist than its 44/48mm measurements would predict. The lugs are arched downward toward the wrist instead of outwards, so that the band is more likely to wrap downward than to stick out sideways and elevate the watch on your wrist. The rubber strap is well-shaped, flexible and wears quite well. The result is that the watch wears comfortably and much smaller on my 7+ inch wrist than I would have expected. Being someone who believes that an optimal man's watch size is in the range of 38-40mm, I never would have predicted that the 44mm Duro would wear so well. I had reservations about the Bozo size and I had been putting off purchasing it for years because of it. When my other watch finally suffered it's coup de grace, I decided to order the Duro. Those reservations that I had turned out to be unfounded.I recommend this watch. It's good looking, it seems pretty durable, it's got quartz accuracy, the curved lugs don't overhang the wrist, it wears well and the fit and finish are of surprisingly outstanding quality. The mineral crystal is adequately durable, and the one-direction rotating bezel has 30-second clicks. The lume is OK but doesn't have great persistence. At this price point nothing more should be expected. All things considered, it's hard to find a better dive-look watch with such good fit and finish. At this price point my plan is to sacrifice it as a daily beater, throw it away and replace it with another one when it comes time to change the battery. By that time I expect that I will have beaten it to death and I'll need to replace it based on looks alone. When that time comes I'll probably buy another Duro.Highly Recommended, much to my own surprise.",
                        "timestamp": "Reviewed in the United States December 23, 2021",
                        "profile_id": "AH44IC3XRCZ2TR3T3O72VKZZ236A",
                        "is_verified": true,
                        "helpful_count": 29,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2LVF7Q39BE8N1",
                        "title": "5.0 out of 5 stars Too large for my wrist",
                        "author": "Coach Dudley",
                        "rating": 5,
                        "content": "I agree, all of the other reviews speak for themselves. This watch is awesome compared to others brands that are 2 to 4 times the price. Unfortunately, I didnt realize the 44 mm case size is too large for my wrist width.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AEUZCD5MN2GPL3LZCTTVDQUCWGQQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1KUH53V2Y28QW",
                        "title": "5.0 out of 5 stars A truly excellent beater",
                        "author": "nathan stevens",
                        "rating": 5,
                        "content": "This is the best watch you can get for $50, and it's not even close. Buy it, wear it, enjoy it.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AGD5Z4E2ZYKUX76VGWKG6CDPCBIA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3AN4AFTQIUPMP",
                        "title": "5.0 out of 5 stars A truly amazing value",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Easily one of the best values available for an analog quartz watch. Totally earns its reputation as excellent in the watch world.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AGF2CDWHKMQCDL5MNFSJN6AL6KEQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1B9E6BLULNPVG",
                        "title": "4.0 out of 5 stars Best buy on the market possibly!",
                        "author": "K.C.",
                        "rating": 4,
                        "content": "First off let me explain I live on a lake (not small either) so when I need a diver it's for being in the water not at the desk. This watch does everything I need it to do IE:wr 200m -checkstainless case for durability -checklarge enough to read easily with my contacts in -check120 click coin edge bezel that stays put -checkKeeps excellent time -checkdecent battery life -checkOK By now you get the idea,I really like it,this is my second one and my first is still going strong I just thought so much of it I had to have another for back up.When you open the cheap package you find a surprisingly good looking watch that's aprox. 44mm w/o crown so yes it is bigger than advertised it is also 12mm thick which is advertised. This 44mm size seems to be a concern for some but I am NOT a HAIRY MIDGET like most of the pics on forums and here indicate most men who wear watches are by the pictures IE: 6\" wrist and hairy as a spider monkey? This is the biggest watch I own and it fits well on my 8\" wrist and I'm not obese, remember you want to be able to see it easily when in water etc. so the size is a plus in this situation.By the way I am not a fan of super size flavor flav watches it's just ugly.Next the finish is very good No it's not a rolex but it's not junk either,The dial has a very nice sheen to it with a marlin on it which I find pleasing for some reason? The bezel is gloss black unfortunately metal but still appealing to the eye.The coin edge is deep enough to be functional but not sharp edged like some sub homage brands. The case is rounded or beveled on the edges as you would expect and is brushed on top and polished on the sides which makes a good look.The crown is unassuming and neatly polished screw down with a knurl that is deep enough to grab even with gear on (maybe if you want to sync up with your buddy)and still won't dig into you wrist.The screw down case back is stainless also and has the marlin on it as well and is comfortable on the skin.Function, well what can you say casio makes a good reliable watch period. Both mine the second hand lines up with the indices relatively well-maybe luck? The calender is a bit too small for my liking and when the calender switches to double digits it's very hard to read it could benefit from a magnifier but it would also detract from the clean look of the dial.Now let's gripe...The strap is junk in my book because I don't like rubber/resin/silicone type straps, they make my wrist sweat in the sun (which is where I am when I'm in/on the water)even when I wear them loosely.I do wear them (like when I know I'm going to be IN the water all day) just not my favorite.This strap is flat with no curve to it at all so you have to install a curve if you will but still not very comfortable in my opinion. Yes I have tried nato,zulu,canvas and leather but none of those will hold up in the water or they get a rancid smell after a very short time so bracelets work best for me and frankly I don't understand WHY anyone would put a diver on a leather strap IT\"S SILLY SO STOP IT. Put this watch on a nice oyster,mesh,engineer or jubilee style bracelet and it looks sharp too. Yes you are going to spend as much on a bracelet as you did your watch but it will be worth every penny for looks and funtion.The lume is almost nonexistent not to say it isn't there it just doesn't stay bright very long to the point of almost uselessness.I will admit that if you are just doing shallower dives frequently in and out that it does work although the lume isn't very large on the dial,The pearl is also very small and protrudes from the bezel slightly and I have seen others with it gone after a little scrape. I've been lucky not to hit mine directly.SO overall what you have here is a very good watch for water sports that looks good and functions to the price point of $40 double that for a bracelet and now you are looking at a real diver (200m) that looks good for under $100.I don't think you can touch anything else for that at least not and stay with an ADULT METAL watch not some plastic thing you wore as a child.The only reasons I knocked it down to 4 stars is the lume,calender and strap.So if you like rubber/resin straps you have a decent $40 watch that you can dive in and not worry about because after all it's only 40 bucks.Update; Well I was wearing this watch again today on the lake and pulled into one of the nicer restaurant/marina's and noticed more than one person looking at my watch then an older looking gentleman with a very nice omega seamaster on looked at me and actually said \"nice watch\" ,I was floored I thanked him and we started talking watches of course and he agreed that for a \"beater\" he had never seen such a \"striking watch\", I have it on a shark mesh bracelet, of course I could tell this guy probably never owned a cheap watch in his life but he genuinely liked the watch you could tell by the way he looked very closely at it and he asked what it was and MODEL NUMBER!I cannot explain in words how good this watch really does look. I bought the first one as a beater but when I am working on old trucks/cars/motorcyles where I really beat up watches I can't bring myself to wear the 106 it almost has it's own ranking somewhere between beater and nice watch ,hard to explain once again. So if you are buying this for a beater watch beware you'll probably find yourself being a little too cautious with it to be a real beater it really is that appealing to my eye.",
                        "timestamp": "Reviewed in the United States April 15, 2015",
                        "profile_id": "AHKFZVPNNOYR2FPVS5ED5DML23FQ",
                        "is_verified": true,
                        "helpful_count": 29,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B009KYJAJY",
                "product_name": "Casio Men's MDV106-1AV 200M Black Dive Watch (MDV106-1A)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:42:36",
            "updated_at": "2024-10-17 11:42:46",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252645169701330945",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=3",
                "asin": "B009KYJAJY",
                "page": 3,
                "pages": 855,
                "reviews": [
                    {
                        "id": "R1552B62MIZLJW",
                        "title": "5.0 out of 5 stars Would highly recommend",
                        "author": "Gabriel Davis",
                        "rating": 5,
                        "content": "It’s an absolutely god tier watch and would recommend as an every day watch. It’s incredible reliable and has a 3 year battery life which is very good. 5-stars ⭐️⭐️⭐️⭐️⭐️",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AEDDRTVUCKTVGIG6CG7RAI25IQ3A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RP310RIGCC2QX",
                        "title": "5.0 out of 5 stars Much better than expected",
                        "author": "Mark Fahrenholz",
                        "rating": 5,
                        "content": "For a $50 dollar watch, this watch is excellent. A very solid stainless steel case. A tight rotating bezel. A mineral crystal, which is rare for an inexpensive watch, and a major plus. A screw down case back is also great. I have a watch repair kit, so no worries changing batteries when the time comes. I bought this to wear for work so I wouldn't worry about banging it around or the watch getting wet. I've gone through two Luminox watches in the last 20 years and they're just getting too expensive to beat up at work and on the farm. I have only had this watch a week. I set the watch to the U.S. Naval Observatory Master clock (time.gov) and the watch has kept perfect time. The only way this watch could be better is if it was solar powered. I did change the band. It comes with a nice strap band, but I don't like resin/rubber strap bands, and I don't like buckles. That's just me. I highly recommend. Just pay attention to which seller you're buying from.",
                        "timestamp": "Reviewed in the United States July 26, 2024",
                        "profile_id": "AFPLEVOVXNHAQJDCJBXHUHHBUJAQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1TW4IZX1TSH0A",
                        "title": "4.0 out of 5 stars Crown and Bezel function activation",
                        "author": "Idfw2003",
                        "rating": 4,
                        "content": "This is for newbies like me who think this watch is broken and almost returned it. (1) You must loosen the water resistant feature by rotating the crown counterclockwise before you can pull it out to adjust time and date. (2) You must peel off the protective plastic layer from the face of the watch before you can turn the bezel. The plastic is there to prevent the bezel from turning freely during shipping. It's a little bulky for me but overall a nice watch for the price! Going to give it to my sister for Christmas.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AEMH5XO6WQRJHUGBRRO54DXOLZWA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RMGGX82AHIDFB",
                        "title": "5.0 out of 5 stars Amazing Watch with Horrible Strap",
                        "author": "Devon",
                        "rating": 5,
                        "content": "Adore this watch. Amazing “throw on and forget” watch.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFTRAJMVFSR3P3XOJJ6FPAD6437A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3HOSSEFI47WKY",
                        "title": "5.0 out of 5 stars Cassio MDV",
                        "author": "Ray D",
                        "rating": 5,
                        "content": "Very smart looking watch . I can see why Bill Gates wears one.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHR2CVMWF22536MFIFLQL4GXAERQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2PAKR8V5U74T6",
                        "title": "5.0 out of 5 stars Superb product",
                        "author": "Ashish Barot",
                        "rating": 5,
                        "content": "Best product one can get at this price which is after importing from other country.Classy looking, value for money product and worth every penny. I enjoy wearing this timepiece.",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AHC6AVIJBL5OSAAMRTL44TDLAZ6A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3D6RM69SLBOA",
                        "title": "5.0 out of 5 stars Accurate Time & Workmanship",
                        "author": "Felix Ramos",
                        "rating": 5,
                        "content": "I am very happy with the quality and reliability of this beautiful watch. I only set the time once, and I have not set it again for over a year and still exactly like the time on my cellphone. I am amazed with the workmanship of this watch as well as the precision. Definitely recommend.👌",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AGG2SLLWIETHLEWT7U5HOV6ZVYOA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2V73W6X7J2X7Q",
                        "title": "5.0 out of 5 stars Very Nice Watch - High Quality",
                        "author": "S1",
                        "rating": 5,
                        "content": "Hard to believe this is under $50 - Casio has made a very refined, solid, and accurate watch that looks very sharp and much more expensive than it is. Really nice watch and looks great, also larger size makes it very easy to read the time at a glance.",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AGFRNP67N25NV4DRDJ3GEMOS5BKA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1NTWA3HN4T0LI",
                        "title": "5.0 out of 5 stars Order from india",
                        "author": "Ashish kadam",
                        "rating": 5,
                        "content": "I have ordered this watch and I took 20 days to reach due to some kyc problem. I got disappointed but today when I received this order and looking at packaging without any bubble wrap watch reached as factory condition.",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AGO7U77ZHURERTO37Q4V4MXWXYMQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1JG4351LFIM26",
                        "title": "5.0 out of 5 stars Huge bang for the bucks",
                        "author": "SS 502",
                        "rating": 5,
                        "content": "This watch is a very nice piece. I like a great solid feel and I like the larger face. I have many automatics including a Sub and I wanted a quartz movement because sometimes I dislike winding. I also appreciate the flat crystal with no date magnifier to snag on sleeves. It’s the best bang for the buck on the internet. I recommend them highly.",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AHXPV5BHNZN45Y3JFXN7CZODAOQA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B009KYJAJY",
                "product_name": "Casio Men's MDV106-1AV 200M Black Dive Watch (MDV106-1A)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:42:36",
            "updated_at": "2024-10-17 11:42:47",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252645169701330945",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=4",
                "asin": "B009KYJAJY",
                "page": 4,
                "pages": 855,
                "reviews": [
                    {
                        "id": "R19EDRVOCQVGXN",
                        "title": "5.0 out of 5 stars Nice watch.",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Just what I wanted.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AFG4LYFOD3JSUQYZGDZFACHEEOJA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1CSBVVYYV83GI",
                        "title": "5.0 out of 5 stars Heavy watch",
                        "author": "$ spender",
                        "rating": 5,
                        "content": "Looks great weighs a ton",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AFF6DIYQW7HF37DCMTKPEOTGLIYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R12B494JCB9Z7U",
                        "title": "5.0 out of 5 stars Best Dive watch value on Amazon",
                        "author": "boever",
                        "rating": 5,
                        "content": "Nothing to complain about at sub $50. Super quality. Excellent attention to detail. Good size. Strap is very well made and fits my 9\" wrist. Good color selection but I chose the black. Casio is really producing incredible value and excellent selection on Amazon. Fast shipping.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AHA6WC3FBYLOPWRGZFLD2HG7KPRQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2YDGD21CNDYU3",
                        "title": "5.0 out of 5 stars Amazing",
                        "author": "Bryan",
                        "rating": 5,
                        "content": "Best watch on the market 100 percent worth it",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AHHZEUBJV2WQWDDIMRSA3IMYY2YA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2L937Z5N977G8",
                        "title": "5.0 out of 5 stars Color blind men - read this, take note...",
                        "author": "Bill Coulter",
                        "rating": 5,
                        "content": "Over 8% of men, like me, have red/green color blindness. For those of us with this condition known as protanopia, it ranges from difficult to impossible to see a red second hand on a dark or black background.So it's important to note the following; the black version of this watch has a second hand that is coated with red over most of its length, obscuring the stainless steel underneath and making it nearly impossible to see. The blue version of this watch has a second hand of polished stainless steel, which catches and reflects the light beautifully.I have both a black and blue version of this watch. If you place the two of them side by side, the difference is amazing. The big sweeping second hand on the blue version catches the light and catches your eye, while the black version's second hand nearly disappears. The difference in the second hands is visible in the product description photographs, if you look closely. But the photos don't really alert you to the difference which is visible in real life. Thus my review.Setting all that aside, these watches are an amazing value for the money. They look and feel like they should cost several times the current $50 price. I love watches, I own dive style watches from Rolex, Omega, Seiko and others. The fact that you could buy 200 of these for the price of a Submariner boggles the mind. At least the Submariner doesn't have red paint on its second hand.I have to mention the accuracy. Although this model doesn't have solar power and doesn't sync time with WWVB or bluetooth, the accuracy is incredible. My blue and black versions that are sitting side by side are also ticking in sync with each other and in sync with the original time source after two weeks. Knock on wood. It's amazing.Highly recommended. Every watch enthusiast should have at least one of these. If you're color blind like me, start with the blue one.",
                        "timestamp": "Reviewed in the United States March 20, 2024",
                        "profile_id": "AH5EHQ5KHAM637RZNBETZOFBRQ7Q",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3D7T78RC1VAWH",
                        "title": "5.0 out of 5 stars Great Value",
                        "author": "ilter",
                        "rating": 5,
                        "content": "This is a great value watch. For the price it has a great quality. The bezel rotates counter clockwise, lume is very bright and long lasting and it has 200m water resistance.",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AEFG2AJPTWL2CQRBYTUBLET4NG6Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R16J0TK0SZ6778",
                        "title": "5.0 out of 5 stars 10/10",
                        "author": "Moisses",
                        "rating": 5,
                        "content": "10/10",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AENQSX3MCD7VKNCWP6CATPJXR3AA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RWIO8D0YVGHOA",
                        "title": "5.0 out of 5 stars Awesome watch",
                        "author": "SW1492",
                        "rating": 5,
                        "content": "I've had it for a week now and so far so good. I like the build quality and very easy to adjust the time and date. Highly recommend for anyone looking for a first time watch or adding to a collection. Will most diffidently be buying another Casio watch in a different color.",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AH45YZU5ITOS7VT57RNY72VNSNCA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R18655V9HK9FI1",
                        "title": "5.0 out of 5 stars A great watch, and an outstanding watch at this price.",
                        "author": "J. Bready",
                        "rating": 5,
                        "content": "I bought the Casio MDV-106AV (the box is labeled MDV-106-1AVCF) dive watch so that I'd have a watch to wear when I was doing something I didn't want to subject my \"nice\" dive watch to. Never mind the fractured logic of spending a small fortune to buy a rough, tough, but very elegant do-it-all watch, and then buying another one to wear when I don’t want to put a scratch on my fancy rough tough watch. Sigh. It's like those SUV drivers that crawl through puddles so they don’t splash and get their cars dirty.My interest in dive watches isn't because I dive, it's because I've gotten older. I've worn digital watches for roughly the last 35 years, but my eyes aren't up to them anymore. Even as digital watches got huge (G-Shock anyone?) the area of the watch face devoted to telling the time remained tiny. It's been over 10 years since I could read mine without my reading glasses. Dive watches are, with few exceptions, the most easily readable watches out there. Yes, there are \"Easy Reader\" watches, but if you don't want to look like you stole a nurse's watch, get a dive watch instead. I wanted something easy to read with or without my glasses, and waterproof. Analog dive watches fit the bill, and the Casio MDV-106 is one of the very best for readability and overall appearance. It is easily THE best if you factor in value for dollar.The bezel measures 43.5mm across the knurled edge, which is about average for men’s dive watches these days. To my eye it looks just right on my wrist, and being a little large doesn’t hurt the readability one bit. It passes the “can I read it without my reading glasses?” test with flying colors! The thickness is 12.3mm (just under half an inch), which is thinner than most other dive watches, even the Swiss watches, and almost 5mm thinner than the rubber-armored Casio G-Shock digital I’ve been wearing for the last 10 years. It is refreshing to have long-sleeve shirt cuffs glide right over it. The crystal is absolutely flat and sits very slightly (0.5mm perhaps?) proud of the bezel, which slopes downward slightly from the crystal to the knurled edge. The whole bezel/glass interface is exceptionally handsome, and with the flat glass and low bezel, you don't get that 'looking down into a well' feeling that some other dive watches give. The face of the watch is a marvel of clarity, with only \"Casio\", their marlin dive watch logo, and \"WR200m\" written on it, unlike some brands that print the watch's entire resume on the face. Clean, clear and uncluttered, enhancing readability. There are nice touches all over this watch: all the dots of lume on the face have polished stainless surrounds (note: “lume” is used interchangeably to mean the glow-in-the-dark material or the glow itself, i.e., “Seiko uses a proprietary strontium-aluminate lume”, or, “Man, you could read by that lume!”), the one-way bezel ratchets very positively, if a bit stiffly, with 120 clicks per rev, the crown guards are nearly as tall as the crown, the pointer end of the second hand is very thin and painted red so it will never be confused with the hour and minute hands, and the face is mostly just black, clean, and uncluttered. The sides of the case are highly polished, but the tops of the lugs (i.e., the part you see when reading the time) have a less reflective brushed finish, making it easier to read in bright sunlight. Rolex should look this good. The band is 22mm wide, exactly the right width for a watch this size.Is there anything I would change? Sure, to my eye the hands look just a tiny bit skinny; I'd make them 20% wider. I'd also make the date window twice as big; it's hard to read even with my glasses. And finally the lume; this watch really needs better lume, good luck finding it in the dark let alone reading it. Note to Casio: buy the stuff Seiko uses!Overall I think this watch is an absolute steal at $40. It has none of the bling factor or cachet of Rolex or Omega, or even Seiko's high-end divers, but it does the same job ('cept for the lume) at a tiny fraction of their price, and looks amazing doing it. If it's function you care about, not flash, this is the watch for you. Admit it, we've all had meals that cost more than this, and were far less satisfying. My fancy, expensive watch may spend a lot of time in the drawer.The three pictures show the bezel/glass interface, a simulated view without my reading glasses (I can actually see a little better than the picture), and how it looks on my wrist.",
                        "timestamp": "Reviewed in the United States July 3, 2015",
                        "profile_id": "AENKFX2VX26HYBNZXCIQCYI6YGQQ",
                        "is_verified": true,
                        "helpful_count": 42,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R17EJZ6TQB1LEL",
                        "title": "5.0 out of 5 stars Nothing flashy, just classic workhorse watch.",
                        "author": "D. Coffing",
                        "rating": 5,
                        "content": "Throw in a nice NATO strap (that rubber strap is hideous) and you have one of the best watch values period. Yes, I know, an Omega Speedmaster is really sweet….and it better be for the cash you lay out.Nope, this Casio Douro just runs no runs and runs and runs………..",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AEG2YK4NN4RU5YANOTIFW6N4UI4A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B009KYJAJY",
                "product_name": "Casio Men's MDV106-1AV 200M Black Dive Watch (MDV106-1A)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:42:36",
            "updated_at": "2024-10-17 11:42:48",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252645169701330945",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=5",
                "asin": "B009KYJAJY",
                "page": 5,
                "pages": 855,
                "reviews": [
                    {
                        "id": "RXVE8H2TB5NR9",
                        "title": "4.0 out of 5 stars Exceptional quality for a sub $50 price.",
                        "author": "C Mikles",
                        "rating": 4,
                        "content": "My beloved Seiko 007 has been on my wrist for over 5 years now and my current job has left a couple of scratches on it. Being that it is now a discontinued watch, I wanted something cheap and durable to be the new tank I wear to work.I was looking for a few main things. Metal case, unidirectional rotating bezel, 100-200m water resistance, and luminous hands and dial. I wanted to have all this at sub $100. Since the days of cheap Seiko 5’s and $90 Orient Rays are gone (and I will not buy an Invicta out of principle), I went in search of a quartz diver. Pretty soon the metal case classic looking Casio Duro caught my eye.The Case:It has the pleasant heft you’d expect a steel cased diver. It’s polished on the sides and brushed on the top and back. The facets are not razor sharp but more defined than on my Seiko. There are no tool marks that I was excited to see at the price point.The case back and crown:The case back has a nice stamped Marlin along with the usual information. The crown surprised me. It has sharply machined grooves around its circumference. They had not been buffed to amorphous blobs and lent themselves to turning the crown easily between the prominent crown guards.The bezel:The bezel is a pleasure. The knurling has been buffed to remove the sharp edges but still provides decent grip. The ratcheting detents are positive. You can easily feel and hear each click. There is minimal backlash and the detents line up with the 12 o’ clock mark. The bezel insert seems to be aluminum and has the classic 15 minute hash mark timer design. Casio has also put a lume pip at 12 o’ clock. A touch that I think sets dive styled watches with actual dive watches. It isn’t recessed like on most divers, but I was surprised to see it on a $44 watch.The dial:The dial is gorgeous. It’s a black sunburst design that beautifully catches the light. The dial is left intentionally plain. Only having Casio, the WR rating, and the classic Marlin. The markers are not printed on but appear to be applied, as they stand quite proud of the dial surface. The lume markers are surrounded by mirror polished metal edging. The date window is small, but I am okay with that on a dive watch. I want visible markers above all.The hands:The hands are the same lume filled mirror polished fare. The hand shape is simple: a short arrow tipped hour hand and a slender sword minute hand. The second hand is half red painted with a lume triangle on the leading end. The lume is hard to pick up at night on the second hand but the minute and hour are bright.The movement:This is where I deducted a star. The watch keeps excellent time and is easy to set. However the second hand does not hit the hash marks on the chapter ring. I wouldn’t expect it to at a lower price point, but once you get to $40+ you want your hands to hit their marks. Hopefully it is just a fluke as other reviews have touted the second hand lining up correctly.Overall I am very pleased with this watch. Time will tell if it hold up to abuse, but I feel like it has the fit and finish to withstand years of use. Would highly recommend for anyone looking for an inexpensive diver.",
                        "timestamp": "Reviewed in the United States January 22, 2023",
                        "profile_id": "AG5IRUGWVRAVPUT3Y2VEYHY6VZDQ",
                        "is_verified": true,
                        "helpful_count": 27,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3LP1MGJ7XZC94",
                        "title": "5.0 out of 5 stars A Lot of Watch For The Money",
                        "author": "Bluespower58",
                        "rating": 5,
                        "content": "I'm a fan of automatic divers but I wanted a daily driver that I could throw on and not worry about it. I'd heard about this watch so I splurged and got one. It delivers way beyond its price point. Nice looking, and I love the 42 mm size. The strap is good so far. The second hand is not in perfect alignment, but that is a very small thing at the end of the day. All in all. this is a lot of watch for the money!",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AEKYA5EIGUUKWCHL6QPWBEWDZONQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R58X90ILEJLN9",
                        "title": "5.0 out of 5 stars Just too cool",
                        "author": "Bjoerk",
                        "rating": 5,
                        "content": "I wanted a weekend beater for surfing and off-road motorcycling. It had to be big-faced and easy to read at a glance. No digital crap, please. I needed another watch like a hole in the head. I have some really nice watches and I'm not a collector. But since I am single and nobody around to tell me no, I got it. Great value for the price, just an impeccable knockout of the Rolex Submariner of old that I always envied. As soon as I got it as set the time and took it surfing. I banged it around, held it under water, sprayed with a fire hose, took a shower with it, and just hammered it with abuse as much as I could so I could return it promptly. No success; I could not destroy it. It still holds time to the millisecond with no fogging and no problems. Just a big hunk of phat shiny blissful steel with black highlights, a discrete second-hand, a tight rotating bezel and a light rubber wristband. For $37 this is a steal. I might just hang up my Tag Heuer and Victorinox watches until this thing lets me down, which may be a while. Very easy to read at a glance which is why I got it. Not too heavy, really shiny, Big and fat. Classic good looks.UPDATE: \\December 5, 2014.\\ 'still looks brand new, has not lost even 1-second of time. How can this be more accurate than my $1,500 dollar Tag Heuer???? I've worn it every day since I got it.. :) The rotating bezel is still tight, firm and crisp and you can update the calendar without stopping the second hand. This should cost a lot more.UPDATE: \\October 17, 2015.\\ Replaced the battery finally, Still holds the time to the millisecond and not a scratch on the bezel or the steel. Every short month I calibrate it to the atomic clock NHIST in Colorado and it has never failed to be dead nuts on. The rubber wristband and the chrome look like brand new. I have really abused this thing and it just laughs at me.UPDATE \\April 6, 2016 \\ The band finally gave out, I replaced it at a watch store for $10 with the exact same type. I went to set it to the atomic clock, and did not need to adjust the time at all. Right on the money; still keeping perfect time. Still looks like day 1.UPDATE \\Sept 27, 2016\\ I hate this watch, I'm looking for a reason not to wear it anymore, It just keeps going on and on and looking brand new. Now all my other watches have had battery death from neglect, Why did I ever buy anything else? I wear a Casio over a Rolex and can't find any reason to switch back. My VW gets the job done and my Rolls Royce sits in the garage. fooey.Update 8/16/2023 OMG, will this thing finally just die???!! No, just keeps time to the second, looking fresh as the day I bought it. I'm getting tired of seeing the same glorious glistening crystal smerking at my doubt and disbelief 🫢. I way underpaid, it way over performs. Crap, I'm such a fickle and unappreciative 1st world funk- monkey.",
                        "timestamp": "Reviewed in the United States July 14, 2014",
                        "profile_id": "AH733XAVUEOS3BTEOQMHEAFIVJLQ",
                        "is_verified": true,
                        "helpful_count": 1231,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3D5VHN3F0CVOQ",
                        "title": "5.0 out of 5 stars This has to be the nicest $50 watch ever made.",
                        "author": "Diana Holcomb",
                        "rating": 5,
                        "content": "I bought this watch as a spare while my Luminox was sent in for repairs. This watch has really surprised me by the quality, fit and finish. The strap is plastic instead of silicone but thats the only down grade in quality i can find. Its the best value i know of.",
                        "timestamp": "Reviewed in the United States August 20, 2024",
                        "profile_id": "AHCFYZMDCHBLKH5VWXUAZQ4V4JJA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1YE6BOMOXUCX7",
                        "title": "5.0 out of 5 stars Cool 😎",
                        "author": "Very good biscuit. Not too sweet and not salty. Very nutritious.",
                        "rating": 5,
                        "content": "I love it",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AEHQCYPQPSKYQ7CWX4KKG3FROFVQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1SEM8Q3TOVFNT",
                        "title": "5.0 out of 5 stars excelente articulo",
                        "author": "CESAR AUGUSTO ARCE DUSSAN",
                        "rating": 5,
                        "content": "este es un articulo de combate de resistencia no se arrepentirá de su compra un producto para el día a día, cumple muy bien con la finalidad que se diseño y creo",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AF7QDUWSKS7RNYESTYWC7FBV4DIQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3U8JAAMDCSCE8",
                        "title": "5.0 out of 5 stars Very good product",
                        "author": "Avi",
                        "rating": 5,
                        "content": "Very good product",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AGFA6TGJN42A2ZSL3Q5TH4HTDVXQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R39Q88FDPFCUQE",
                        "title": "5.0 out of 5 stars Nice watch",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Good👍🏻",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AFGSQZ7R7EGWHNHY3SEVQW5BSOZA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2DVD3JPMF1DM4",
                        "title": "5.0 out of 5 stars Love it, my new favorite watch",
                        "author": "Valeria R.",
                        "rating": 5,
                        "content": "I have quite a few divers, most are classic vintage dive watches, I bought to see what all the hype was about and just loved it, changed band to a NATO band and is now my everyday beater. Now I'm gonna order the one with the gold bezel.",
                        "timestamp": "Reviewed in the United States August 14, 2024",
                        "profile_id": "AFWRG22BFRRY6HEQZR4NJKYZR4PA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2PMGANZYFST76",
                        "title": "4.0 out of 5 stars Great watch!",
                        "author": "Pete",
                        "rating": 4,
                        "content": "This is a $50 watch that beats most $100 watches in all metrics: style, comfort, durability, and time keeping. Only two complaints you can have with this piece is that the mineral glass scratches easily and the strap is cheap.",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AEUZJLJZGINQFYDXOGW2XLFFKMRQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B009KYJAJY",
                "product_name": "Casio Men's MDV106-1AV 200M Black Dive Watch (MDV106-1A)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:42:36",
            "updated_at": "2024-10-17 11:42:49",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B009KYJAJY?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252645169701330945",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:42:36",
        "domain": "com",
        "geo_location": null,
        "id": "7252645169701330945",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B009KYJAJY",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:42:49",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252645169701330945",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252645169701330945/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252645169701330945/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252645169701330945/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252645169701330945/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}