{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=1",
                "asin": "B00PXVU3GM",
                "page": 1,
                "pages": 158,
                "reviews": [
                    {
                        "id": "R1LBZHYSOWE9DK",
                        "title": "5.0 out of 5 stars Classic, Tough, Affordable, Great Looking Diver",
                        "author": "Patrick Gleason",
                        "rating": 5,
                        "content": "It has been a tradition for the last few cruises that I buy a watch onboard. This time I would have, and this was the watch I planned to buy, but they didn't have it in blue, so I abstained on the ship, and ordered this one the day I got home.So why this one? A couple of reasons.1.) It just has that classic diver look to it.2.) A friend of mine has this watch, and EVERY time I see it when we hang out, it catches my eye. He abuses his, and years later it still looks great, which is a testament to its durability.3.) Feature packed.Ok - so let's talk about the features.1.) Eco Drive - this is a time-tested technology, and I have several Citizen Eco Drive watches, to include a 1st Gen Eco Drive purchased in 1996 that STILL takes a charge and runs when I get it out.2.) Mineral glass window - not the scratch resistance of sapphire, but TOUGH.3.) Accurate movement. Prior to DST, I set the watch about 3 weeks prior and it had gained a grand total of 2 seconds. That's about +3 seconds a month. You can't find an automatic that will do that.4.) Water resistance to 200 meters with a screw-down crown.5.) Hacking movement - when you pull the stem to the 2nd click, the second hand stops, and that allows you to sync it to the exact second to another time source.-- Side note on movement. I considered getting the version of this watch with the automatic/self-winding movement, but the movement in that watch is the Miyota 8204, which is a 21.6k movement (rather than 28.8k) that only has an accuracy guarantee of +/- 20 seconds/day. I have other automatics that are considerably more accurate than thatBottom line - this watch looks great, and it's built to last. I know I'll get a lot of years of use out of this timepiece.I've included two pics of this watch. One with the stock blue rubber diver's strap, and another with an aftermarket bracelet that is specifically fitted for this watch case. I'd name it here but I think that would invalidate the review. In any case, it's pretty easy to find if you prefer that aesthetic, and it isn't terribly expensive - the stainless bracelet is well worth the investment and it gives the option of either aesthetic.",
                        "timestamp": "Reviewed in the United States November 6, 2023",
                        "profile_id": "AGY6CJKGYMVZFHE5ONDCUSRAYEEQ",
                        "is_verified": true,
                        "helpful_count": 32,
                        "product_attributes": ""
                    },
                    {
                        "id": "R757G0J79GVMV",
                        "title": "5.0 out of 5 stars 5-Year Work Watch update",
                        "author": "Eric",
                        "rating": 5,
                        "content": "Overall, one of the best pieces of work gear I have ever invested in, for my line of work.I am a swimming pool technician, a pool guy, and have been for the last 10 years of my life. I work for one of the largest pool maintenance companies in SoCal and am now a Route Manager, overseeing over 800 individual pools.My everyday has and still consists of many different jobs.Cleaning swimming pools, where I am CONSTANTLY submerging my hands in chlorinated and salinated (salt) water, which does have a corrosive and/or oxidative effect on certain metals.Interacting hands-on with different corrosive and oxidizing chemicals, all of which gets on my hands and wrists at some point everyday.Maintaining, cleaning, and repairing various pumps, filters, plumbing, heaters, automation/electrical pool systems, and valves. This frequently places my hands in uncomfortable, tight spaces where I will bang, scrape, and smash my watches against concrete, metal, and other hard materials in the equipment areas I am working in.I have worn this watch every weekday for the last 5 years for this job. I replaced the original rubberized strap for a nylon/cotton blend NATO strap so it would dry quickly and breathe better. The watch face paint has stood up very well considering how rough my job is on it, with what would be considered as understandable wear and tear. And in my opinion, it gives a worked-in quality of character to the watch.The crystal itself has a few MINOR scratches, which I’m surprised hasn’t cracked or been marred even further, given that I have truly had it banged around hard in my line of work. None of these scratches affect the readability of the watch face at all. You actually have to look in an angled reflection to notice them.The lume of the glowing hands and digits are still VERY strong and last a pretty dang long time. I’m in the sun all day long and so the glow lume gets charged like crazy all day, then lasts for hours into the night.I can also say with certainty that I have NEVER had a battery issue, being that it’s an Eco-Drive and it gets a full belly of sun every working day, I’m not surprised at all. I don’t know when it will ever need a power cell replacement, but it's probably going to be a WHILE being that my line of work puts it in a recharging state at all times.Lastly, the steel body of the watch itself is as solid as when it arrived. It does have some scratch marks, but no gouges. And just in the last 6 months or so, a very light showing of rust-colored oxidization has been showing on the inside of the bezels. I’m surprised its taken THIS long to finally show some signs of oxidizing with how often its been scratched and banged, then plunged into salt and chlorine water and exposed to various chemicals.Overall, I am very pleased with the performance and durability of this watch. In a job where I quickly go through footwear, shorts/pants, sunglasses, hats, multitools/knives/handtools, and other pieces of gear, this watch has stood out as the most rugged and long lasting piece of gear I have bought for my job. I have no doubt it will last a further 5 years easily in the exact same conditions, especially if I give a light polishing for any oxidized areas (which I still haven’t yet).Highly recommend this watch for someone looking for a durable timepiece that can take a beating and still look classy and handsome. I also highly recommend switching to a NATO strap for an even more secure retention (watch won't fall off your wrist if one of the strap bars breaks or pops out).",
                        "timestamp": "Reviewed in the United States July 9, 2024",
                        "profile_id": "AHX2V2WDLKZ7UL2JLJEHONQHHNFA",
                        "is_verified": true,
                        "helpful_count": 17,
                        "product_attributes": ""
                    },
                    {
                        "id": "R18HC5ERH1L524",
                        "title": "5.0 out of 5 stars Excellent value",
                        "author": "T. F.M.",
                        "rating": 5,
                        "content": "I previously had purchased the black version of this watch because I felt the black would go better overall with my normal casual wear. But I liked that one so much that I decided to get this blue version also. To my surprise, it actually goes better with my clothes than the black one does. It can be worn for casual or dress.I love the location of the crown because it does not dig into my wrist. The size is perfect and the colors are dark blue and not overwhelming. I have to check twice sometimes to distinguish between the black and the blue. The face is easy to read, but I agree with some others who in their reviews were mildly critical of the date window. It is recessed and small and is sometimes a struggle to read. I have found that turning towards a light source usually solves the problem. The illumination is fine as far as my needs are concerned. The band is sporty and comfortable. The bezel only turns in one direction, but is tight and precise. These two watches are my 4th and 5th Eco Drives. They keep perfect time and you just have to wear them outside or put them on a window sill once in awhile. Overall a fun watch with excellent quality and value.Like I said earlier, I liked the first one (black) enough to buy the second (blue) and I am happy with both. They are fun to wear and add diversion to my modest watch collection.",
                        "timestamp": "Reviewed in the United States November 21, 2016",
                        "profile_id": "AF5C727WQ72JGJGPUUT6X25PLQCQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2LMMSCT5FI4NV",
                        "title": "5.0 out of 5 stars Actually fell in love with this time piece in a gift shop on ...",
                        "author": "D L",
                        "rating": 5,
                        "content": "Actually fell in love with this time piece in a gift shop on a cruise ship. I didn't have much opportunity to \"research\" the watch and by the time we disembarked, I was wearing her proudly. What's not to love about BN0151-09L?!? This was my first Eco-Drive and so far I'm ecstatic. No battery changing! Woo Hoo!Have had this watch a year now. Build quality is solid. It's not the lightest watch I own and viewed from the side, it's \"thicker\" than your normal watch. Then again, it's supposed to be a Diver's watch up to 200m. I love the \"matte\" finish so it's not too bright and not too reflective. The blue rubber strap takes some getting used to, but if you do a lot of diving, it's great. It's got plenty of length to wrap around a wetsuit and certainly will fit a large wrist. As mentioned it has a cool little decompression dive table printed on the band. I switched it out for a more traditional metal band. My only complaint is that the curved end of the my metal band doesn't reach snugly up to the watch (see pic), but that's not the fault of the watch.I love the large non-numerical dots. The orange lined minute hand is unique and stands out making it easy to quickly read the time against the beautiful blue face. The second hand hits every second hash mark spot on! It keeps excellent time and is not fast nor slow. My rotating bezel is *tight* and not the easiest to rotate if you don't hold onto the ridged areas, but that's ok because it tells me that the bezel is well designed and will last. Love the luminescence! Something that I've read and confirmed... the hands and non-numbers glow \"blue\" but the dot on the bezel is a light green (see pic). A nice touch by Citizen to make that a different color.As others have mentioned the date window could be a little bigger but I thought it was a very cool to line up the crown and the date window and have them both at the 4 o'clock position instead of the typical 3 o'clock. The crown also has to \"unscrew\" before using... a sign of a real diver's watch :) You will be hard pressed to find similar build quality and luxury at this price point. I look forward to enjoying this timepiece for many many years. What else is there to say?!? Get it! You will love it!",
                        "timestamp": "Reviewed in the United States April 18, 2016",
                        "profile_id": "AH3NWIFHYMGIZVGO5FYP4J6M2IHQ",
                        "is_verified": true,
                        "helpful_count": 218,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1GTYRPBXX9O6L",
                        "title": "5.0 out of 5 stars An excellent utilitarian dive watch",
                        "author": "Christopher Nieman",
                        "rating": 5,
                        "content": "This is my third proper dive watch. Previous to this, I have a Casio from the early 90s (now very rare) and a Seiko from the late 90s. Both of those are 'Pepsi' watches with blue faces and red warning regions on the bezels. I prefer the 'Pepsi' style for the color contrasts, and that's why I chose this Promaster with a blue face over the black.I like bold yet uncluttered watches, with which I can see the time at a quick glance. Some dive watches have very busy-looking faces, even among the Citizen line. This one is especially handsome because Citizen keeps the face very clean and readable. There are chevrons at 12, 3, 6, and 9, and dots at the remaining 5-minute marks. The hour hand is broader than the minute hand, and the minute hand is highlighted in orange with a broad arrow at the tip. The second hand is centered over the markers and the clicks are nice and crisp. The date window and the screw-down crown are both at 4 o'clock, both good choices.The case width is listed as 48 mm, which seems ridiculously large, but it actually looks quite normal on my smaller than average wrist. The bezel has 60 firm and centered clicks, and is unidirectional (counter-clockwise). The bezel does not have a warning region. I have not carefully checked the watch's accuracy but I would estimate it gains about two seconds per month, which is very acceptable for a budget dive watch. Citizen's Eco-Drive technology means I'll never have to change a battery, which is a great feature.One oddity about the blue version of this watch is that Citizen chose to pair it with a blue polyurethane band. With the navy blue face and the navy blue bezel, the blue band makes the whole watch look too monochromatic and, well, boring. But, I knew going in that I was going to replace the stock band with a NATO-style band anyway, which is my preferred band style for sport watches. So the blue band did not impact my purchase. The replacement gray NATO-style band I currently have is a good contrast with the navy blues on the watch itself. I think Citizen should consider pairing the blue Promaster with a black band instead of blue.This is now the best dive watch I own--even over my venerable Seiko--and the price is very reasonable for the quality.My first Citizen, and it won't be the last.",
                        "timestamp": "Reviewed in the United States October 21, 2018",
                        "profile_id": "AENFQD5EQBOPKB6TB7AOAD5QQCOA",
                        "is_verified": true,
                        "helpful_count": 10,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1DZ653E3NB134",
                        "title": "5.0 out of 5 stars Absolutely Amazing!",
                        "author": "MickeyFan",
                        "rating": 5,
                        "content": "Update:I have owned this watch for almost a year now, and I have to say it is my every day watch! I own many other watches, but this one is my \"go-to\" watch. It has been extremely accurate, exceptionally water proof and still looks like new! I ended up purchasing another one when they went on sale a few months ago. I highly recommend this watch for anyone looking for a solid, reliable, well built, hassle free dive watch!Original Review:I currently own several other quartz divers (Seiko, Wenger, Bulova Tauchmeister, Casio, etc), but I have been eyeing this Citizen for some time now.Finally got it and this is what I think about it so far.Size: while it is only 42mm, it looks a bit bigger because of its flat design. The strap size is 20mm, not 19 like the product description reads.Lume: Nice blueish glow on the circular markers. The lume does not last nearly as long as the lume on my Seiko divers. Doesn't glow as bright as the lume on my Seikos either. However, not bad compared to the lume on my other non-Seiko divers.Strap: Cute for people with small wrists, but doesn't do justice to the watch. I immediately replaced it with a stainless steel super engineer Miltat strap. I have both the engineer and super engineer stainless steel straps, but the super engineer matches this watch perfectly!Quality Control: Second hand doesn't match up perfectly with the second markers on the dial, but I fiddled with it while hacking and got them to line up a bit better (still not perfect). Also, I noticed a tiny, hairline scratch (barely noticeable) on the bezel at the 30 mark. No biggie. Bezel does have a tiny bit of play, but no more than my Seikos or Orients.Presentation: Definitely the best presentation box of any watch I have ever purchased! It came in a mini scuba tank. Absolutely perfect for a gift!Other: Not a fan of the painted bezel; I will most likely scratch it within a week or two. Screw down crown screws in a bit too easily. Hopefully it will be as water resistant as I expect it to be. Didn't come with clear tape over the crystal or the case back. I really hope this was not a returned item as Amazon has done to me before.I would give it a 4.5, but that's not possible with this rating system. So, it gets a 4 for now. I'll revisit this review after I own it for a few months.",
                        "timestamp": "Reviewed in the United States February 10, 2019",
                        "profile_id": "AE4IYZZ6FELBMAQ72ZPSN4JBL24A",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": ""
                    },
                    {
                        "id": "R15S8TGHMH1MEW",
                        "title": "4.0 out of 5 stars Great watch for the money.",
                        "author": "B",
                        "rating": 4,
                        "content": "As I've said before, I am a watch guy. I usually like automatic divers and chronographs, but as anyone who buys them knows, they're sometimes expensive and a chore to own. If you've seen dr. Strange, and you saw all those wobbling things in his watch drawer, those are winders for automatic watches, and many think a must for unworn automatic watches. I'm on the fence yah or nay, but I use them. And hence the cost and chore. So, when my girlfriend started taking an interest in watches after being with me a while, I told her I'd get her a nice one. One she could wear often without worry and was quality, but I could also afford. She liked divers, and she loves the color blue, so, after shopping around, I stumbled on this one.Citizen is a fine quality, lower, to mid-tier watch. Watch snobs often give them a bad rap, they're not a Rolex etc. What a bunch of nonsense. Of course they aren't, they weren't meant to be. I checked it out a bit before giving it to her, and check on it with her. It keeps fine time, the water resistance is great, it's not overwhelming huge, which we both like in watches, but big enough to easily read, very legible, the hand styling and accent coloring is really pretty, and the blue face and strap look great. The bezel is really nice, and feel substantial when turning. The only reason I dinged it one star is, like many other affordable divers, the 12 o clock stop on the bezel is just a bit off, and that always bugs me, but it's a common, small problem, and hardly matters. I'd do half a star off if possible. The blue band is comfortable and she agrees and likes it. It's really cool that it has ND or no decompression needed depths ( correct me if I'm wrong on the meaning) printed in the band. I was going to put a nice blue NATO on there for her, but she said she liked the strap. It's also solar powered, which is nice. So far, she hasn't had any issue with it. Just leaving it near the window when not wearing it. It also comes in a cute little faux diving tank box. We both really liked that. I told her, keep it, it's a neat little piece. I'm a fan of creative watch boxes. I've seen tanks before, but still like them. Definitely a tough,practical, pretty watch that is good for scuba and snorkeling, or other outdoors activities or just daily wear. Affordable and cool. Citizen, seiko, orient, all keep making great, affordable watches. Definitely recommend.",
                        "timestamp": "Reviewed in the United States May 19, 2019",
                        "profile_id": "AGQMIMSZYFBMDNBUZQ72EZ7ANK2A",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1O9BMLU9HRBK3",
                        "title": "5.0 out of 5 stars An Affordable Dive Watch for a Terrestrial Being",
                        "author": "Lou Boutin",
                        "rating": 5,
                        "content": "I wanted to have a sporty water-resistant watch so I purchased this blue Citizen Promaster Dive Eco-Drive Watch. Now that I have it and owned it for a few months, I feel good about giving it an honest review. To put it succinctly, this is an EXCELLENT watch for the money. Advertised at a 43mm case diameter, the watch fits nicely on my slender-ish 165mm wrist and is a comfortable fit. The watch face is quite legible. It has a bordered date window at the 4 o'clock position and is unobtrusive. The crown is also at the 4 o'clock position and does not hinder any wrist movements. As for the lume, it is outstanding! This sucker can glow for hours after being in the sun and as it is an Eco-Drive, power is not an issue. The only nick I can give it is that in some lighting situations, the blue face sometimes appears black. The blue rubber watch band is comfortable but is long due to it being a working divers watch so I replaced it with an aftermarket band and it is now in my watch rotation! Citizen has made a great watch and I am happy to own it. HIGHLY RECOMMENDED.",
                        "timestamp": "Reviewed in the United States June 30, 2023",
                        "profile_id": "AEMIKYK5LNSRYFMJPF3JTUXLOOYA",
                        "is_verified": true,
                        "helpful_count": 13,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3LXRUR910PJCD",
                        "title": "5.0 out of 5 stars I don't regret a thing",
                        "author": "Mesrop Abrahamian",
                        "rating": 5,
                        "content": "I'm left handed, Yes I wear it on my right. My wrist is also about 6 and 5/8\" (17mm). In person it doesn't feel or look \"big.\" Any blemish on the glass is just the light and fingerprints... otherwise its crystal clear.After lots of looking I was honestly thinking of pulling the trigger on a Rolex. My need for a watch was something that looked good, was simple (dials and date), and accurate. I came to the thought that at the end of the day a watch needs to be accurate. Rolex looks amazing but the inaccuracy of the mechanical movement (drift and constant attention wasn't going to work for me). I l also tend to do labor intensive work on occasion and I didn't want to have that thought of damaging a very expensive watch. I'm not free diving on my weekends either so I don't need a 300 meter divers, enough where I can go swimming in a pool or ocean and not be worried about its performance. Even a 50 meter would have been fine.My options were down to Citizen and Seiko, in the end the reason I went with Citizen was because I felt that the look for the solar was just a little finer than the Seiko, but that's a personal choice and I may buy a Seiko one day.Down to the review. I received the watch and the box/container was shaped like a divers tank which was nice although a little bit difficult to figure out how to open. Once open and out I went about setting the time and date which was simple to set (I set it to the exact second). Immediately wearing the watch I came to detest the straps. I am not a big fan of rubber straps and these like any other were not to my liking. They were what they were, they flexed a little but didn't really hug your hand instead they pushed on your wrist and didn't really feel seated on my wrist. Remembering I had bought a Mesh Milanese strap that never got used that happened to be the same size I went about changing the straps which wasn't too difficult, just had to widen the strap pin holder by running a knife along the opening to allow the watch pins to slide in. STRAP LINK BELOW. The Watch sits perfectly with the mesh strap, it may feel a little heavy picking it up off the table but a couple of seconds with it on and it feels perfectly in place, doesn't move too much and doesn't feel like its hanging off your wrist in the least bit. After a month of use it came time to reset the calendar date. In that month of daily use the time was perfectly accurate to the second with no adjustments from me (so zero drift). I set the new date and went about my daily routine. At one point I was cutting a tree using a reciprocating saw and tools. Both my hands and the watch were being vibrated for a while and as of a couple of weeks the watch has zero drift and is precisely accurate.All and all I would say it was the prefect purchase. The price is with out a doubt a no brainer, the movement is exact, and the look is perfect for either some hard work, or most of the time spent on my office jockey wrist in front of a computer. It's definitely not something you will lose sleep over if it gets damaged, lost or stolen, but it's going to work perfectly when you do have the need for it.Link to Mesh strap.https://smile.amazon.com/gp/product/B00MTAKG8A/ref=oh_aui_search_asin_title?ie=UTF8&psc=1",
                        "timestamp": "Reviewed in the United States March 25, 2019",
                        "profile_id": "AFI4GSHN5X7L4OWHXTJPMK7YBZPA",
                        "is_verified": true,
                        "helpful_count": 49,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1PXA0Y64I9RZ6",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "My second eco-drive watch from Citizen. Keeps great time. I love it!",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AGYZMLRPWEDOJYXCCOW5EP2YN4VA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00PXVU3GM",
                "product_name": "Citizen Promaster Dive Eco-Drive Watch, 3-Hand Date, ISO Certified, Luminous Hands and Markers, Rotating Bezel, Blue/Stainless (Model: BN0151-09L)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:44",
            "updated_at": "2024-10-17 11:51:49",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252647470516154369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=2",
                "asin": "B00PXVU3GM",
                "page": 2,
                "pages": 158,
                "reviews": [
                    {
                        "id": "R2XE034TPD6F1H",
                        "title": "5.0 out of 5 stars Fantastic Lume",
                        "author": "GMoritz",
                        "rating": 5,
                        "content": "This is a great watch that is extremely easy to read day and night. This watch has the best glow in the dark lume I've seen. Will glow hours in the dark. Keeps very precise time. Doesn't drift like some other watches I own. The only change I would make is the date window. I know it would throw off the aesthetics but the windows really should be larger so it can be read easier.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AFQ43TPLLELFQOQZBZQZW4WBGKYA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3BGPS6UJ95VDT",
                        "title": "4.0 out of 5 stars Good Purchase",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "The watch itself is good, the band is to stiff and could be a little wider and longer. It’s defiantly not a watch with those with larger wrist.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AFAV47H4TWUQSG5NNQGBIIV4LC3Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3GYW2SBK60JSU",
                        "title": "5.0 out of 5 stars Gift",
                        "author": "MJ",
                        "rating": 5,
                        "content": "Bought this for my husband, he loves it. he uses it for snorkeling, diving, and on the Boat. He loves the Blue color to it",
                        "timestamp": "Reviewed in the United States September 13, 2024",
                        "profile_id": "AEB4XFJF3Z4KBUOC2NVF2PAPNV6A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R30Z5XNYXPZ30Z",
                        "title": "3.0 out of 5 stars Love Citizen. Love-Hate relationship with this version of Eco-Drive",
                        "author": "D in DC",
                        "rating": 3,
                        "content": "I have over six Eco-Drive watches from Citizen. Some have larger faces. Some have smaller faces. This is a large case stainless design but since it has a numbered metal bezel, and the watch face is actually small; it does not look too large on my small wrist. I am thin. 6'1\" and 170 lbs. Band is rubber and looks/feels great. You could always purchase a stainless or leather band but the rubber blue band matches the face and seems durable and flexible. Waterproof for swimming and snorkeling. Screw down crown. Date window is small and hard to read (I am in my late 50s - so it's my old eyes). I have not used it for deep sea dives yet. Time keeping is spot on, as expected for a quartz movement. My watches are stored in a watch case with a glass window. I keep them on my dresser and near a window so there is ambient light throughout each day. My oldest Eco-Drive Nighthawk is over 18 years old and has never stopped. This watch's small face can't seem to get enough light to keep it running. It stops and conserves energy so don't expect it to run for months without a charge. I have to periodically wear it in full sun to keep it charged. Once it is back in the glass watch case, the second hand switches to 2-second incremental sweeps (usually within five days). After two weeks, the second hand stops completely. If you wear it daily, you should be fine. It is a beautiful design and if it is anything like my older Citizen watches, it should be reliable. I just hate the small battery reserve in this watch.",
                        "timestamp": "Reviewed in the United States August 21, 2024",
                        "profile_id": "AHHXA5WSSXREC5YVCRMFOYYWZWEA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RAJLL2SMPRGE6",
                        "title": "5.0 out of 5 stars Very nice timepiece .",
                        "author": "eagle one",
                        "rating": 5,
                        "content": "The Citizen watch was delivered quickly, good packaging. Absolutely as described by Citizen on Amazon. Very easy to set up and very easy to get the watch registered for warranty.If you need a dive watch or just a good watch, this is a keeper. One thing I would change if I were Citizen would be to put a stainless steel band on the watch, or at least make that an option.The vinyl band is pretty stiff and while I am sure it is functional, I absolutely prefer the stainless band for looks and function.Is it perfect no, if you want perfection buy an Omega, a Rolex, or similar, but for an everyday wear, good value, it is absolutely hard to beat. Well done Citizen.",
                        "timestamp": "Reviewed in the United States July 15, 2024",
                        "profile_id": "AF347QUEEUE7ZBSRKO6IT3BVLVKQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2KZW7LWCN0FFP",
                        "title": "5.0 out of 5 stars Citizen Eco Drive are my favorite watches",
                        "author": "F.O.X.",
                        "rating": 5,
                        "content": "I own a few Citizen Eco Drive watches, and they all keep very accurate time. Some may require more than just turning the hour and minute hands manually but they have great customer service to help you when setting the time. The AT (Atomic Timekeeping) watches adjust the time automatically when it's Standard Time to Daylight Savings Time and vice versa. My brother got me into Citizen Eco Drive watches. I own other Citizen watches as well. Citizen makes fine watches even if they are not Eco Drive. Citizen watches are well made; I have two or three that are over 30 years old, and they keep time accurately.",
                        "timestamp": "Reviewed in the United States July 7, 2024",
                        "profile_id": "AF5PXQKLPGIFQ4GGW7H2QHBY3YNA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "RF2THLA81MO6R",
                        "title": "5.0 out of 5 stars Fantastic Watch",
                        "author": "Marc A. Abbott",
                        "rating": 5,
                        "content": "Good watch when its 1pm... that's what it says.",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AGG6UEVC7GCKNUSXIOVA4CHO3F7Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3FYNGZJR4SIE2",
                        "title": "5.0 out of 5 stars My Favorite watch",
                        "author": "SomeDude",
                        "rating": 5,
                        "content": "Great quality. looks really nice. Cheap enough I can wear every day. Nice glow from dial. Citizen is by far the best deal in watches. I need more in different colors.",
                        "timestamp": "Reviewed in the United States July 27, 2024",
                        "profile_id": "AGZ7C56G5FNGVID5HGK7H5ABLWUQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "RPDB69G4PSD9U",
                        "title": "5.0 out of 5 stars good",
                        "author": "zurab",
                        "rating": 5,
                        "content": "good",
                        "timestamp": "Reviewed in the United States August 10, 2024",
                        "profile_id": "AHEWI6ILRLHUHMI7EJUUJYDBDR7Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3CNP9DM5BJDKE",
                        "title": "5.0 out of 5 stars Good price for a well made watch.",
                        "author": "Marcus Day",
                        "rating": 5,
                        "content": "The media could not be loaded. Great watch, lasts a long time, built like a brick. Nothing fancy just well made.",
                        "timestamp": "Reviewed in the United States August 21, 2024",
                        "profile_id": "AG2ZTDXX656S7MZQECHEZS7T6ILQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00PXVU3GM",
                "product_name": "Citizen Promaster Dive Eco-Drive Watch, 3-Hand Date, ISO Certified, Luminous Hands and Markers, Rotating Bezel, Blue/Stainless (Model: BN0151-09L)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:44",
            "updated_at": "2024-10-17 11:51:50",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252647470516154369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=3",
                "asin": "B00PXVU3GM",
                "page": 3,
                "pages": 158,
                "reviews": [
                    {
                        "id": "RQIDZVK8ZG8UT",
                        "title": "5.0 out of 5 stars actually bought to dive with",
                        "author": "Zodoz",
                        "rating": 5,
                        "content": "This review is updated after 2 years of use.Promaster was bought as a backup watch to dive up to 100m. So far only to 40m. I currently use an Ecodrive BJ2000-09E as a daily diver, it lasted 13 yrs before the battery needed replacement, with over 1500 dives on it, and its now 21 years old, going strong with the new type or rechargeable battery and 500 more dives.Most important on this watch is the face is big, simple and easier to see underwater, particularly the lume, even in very bad viz. As an ISO dive watch, its better priced and better built, superior to the Seiko SKX007, which should be retired.Although the movement is Japanese, no where on the box or papers does it say were the watch is actually made. I hear the body is milled and watch assembled in China. The body is machined just a tad rough compared to my Japanese BJ2000-09E EcoDrive I use for diving, this promaster is its backup.My two Ecodrive keep better time than other quartz watches, so adjust time only during daylight saving, it will be accurate to < +3 min in 8 months, if first set accurately to NIST time each time. Alas, adjusting date is needed from 30 or 31 as the months fall. This is after 2 years of use.The bezel is tighter than the BJ2000-09E, which I like better underwater, at times I can bump the bezel of the BJ2000-09E enough to rotate it, but so far not on this watch, but it is harder to turn with cold gloves on.The base straps on citizen divers are quality and last >15 years diving, not the resin on Casios which deteriorate < 3 years. The Promaster strap shows no aging at all. If replacing straps buy spring bars too, just in case. Springs in spring bars could rust or foul, they may not spring back after compression, you can remove it, but not replace it. After replacement the spring bar should last at least as long as the next time you remove them.Only con is the excessive juvenile packaging the watch comes with. A toy plastic scuba tank, in a cardboard box, all will go to landfill. I'd rather have the price reduced even more and this ship without a box than all the bling it came with that does absolutely nothing to enhance this watches function.",
                        "timestamp": "Reviewed in the United States March 17, 2020",
                        "profile_id": "AGK27I4TT4PMGDEAU2QRLNYCC66Q",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "RA8O1WEM3URYN",
                        "title": "5.0 out of 5 stars Everything you need in a Dive watch and nothing more.",
                        "author": "William Thomas",
                        "rating": 5,
                        "content": "There is something oddly refreshing about the perfect tool watch. A watch engineered specifically for a purpose, and that delivers on that purpose in a basic, no-frills, kind of way. One that you can beat around and wear it's scars as a symbol of pride. A watch you don't have to handle with kid gloves. A watch that is built to last, but also easy to replace.This may be Citizen's least expensive dive watch, but in my opinion it is also their best. Simply because it delivers what it promises, nothing more, and at a price point that is hard to beat.One can marvel at the engineering prowess demonstrated in their 1000m professional diver model, but almost none of us are diving in saturation diving conditions that require a helium release valve, or a locking bezel. We buy it because we think it's cool. And that's ok. If you have the spend.But truth be told, most of us won't ever seriously stress out the base model BN0151-09L reviewed here, and that is why I like it so much. At 100ft, this watch performs the exactly the same as the one costing 10x as much.An ISO 6425 certified dive watch, that is certified for 4x maximum recreational dive depths, for under $250. What's not to love?This watch doesn't boast a fancy \"sunburst\" dial, or jewels. Everything about this watch is done to make it easy to dive with and nothing more. Plain and simple. From the orange highlight on the minute hand, to the easy to read lume, to the polyurethane band which allows for expansion of the wetsuit when wet. There is almost nothing on this watch simply for show, except perhaps the engraving on the crown.This is the very definition of a tool watch. And while some might prefer a sapphire crystal, sapphire is more susceptible to shattering and costs more. More importantly, those of us who dive know that scratches have a tendency to simply disappear underwater, which is where this watch calls home. Again, another example of simply providing what is needed, and nothing more.The Eco-Drive provides quartz accuracy without the need to replace batteries. Thus ensuring that your dive watch will maintains it's water resistance until you need to replace it's seals.If you want to take your dive watch out to dinner, or show off it's \"helium release valve\" to your buddies, then feel free to purchase one of Citizen's more expensive Promasters. But if you are looking for a simple, easy to use, no frills, affordable dive watch, then look no further than the one here.",
                        "timestamp": "Reviewed in the United States November 15, 2018",
                        "profile_id": "AGX5NMPIKFNBEL5ZENMSQEQNKRMQ",
                        "is_verified": true,
                        "helpful_count": 15,
                        "product_attributes": ""
                    },
                    {
                        "id": "R20ZJ0R91WR7MR",
                        "title": "5.0 out of 5 stars My favorite",
                        "author": "ATK",
                        "rating": 5,
                        "content": "I have many watches but this is my favorite everyday watch",
                        "timestamp": "Reviewed in the United States July 17, 2024",
                        "profile_id": "AEM5554LIQ4GI2BFCO2X5LZPLAJQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2PYJTZW5A1BTH",
                        "title": "5.0 out of 5 stars Nice watch, happy with purchase.",
                        "author": "DaveF",
                        "rating": 5,
                        "content": "Picked this up during Prime days for $90. Great deal. May have been a return - the time was already set (but a day behind) and there was no instruction manual, but the watch was in 100% new condition. I wore it for a few days, put it in the drawer for 4 days, and put it on again and the time is still correct.The main reason for purchasing was I wanted a knock-around watch for weekends at the beach. I have a 9 year old TAG Aquaracer and recently changed the battery myself and didn't want to wear it swimming since it wasn't properly sealed (although I've had it on in the ocean several dozen times for surface swimming, not diving).I used the Citizen for a couple of 30 minute surface swims in the ocean last weekend and as expected, no problems.The ND limits on the band are virtually worthless. The main reason is that a diver always plans their depth and time in advance - if you're 42 meters under water and after 15 minutes decide to look at your watch band to see how long you can stay down, you've got a problem way beyond which watch to buy.The ND \"chart\" is in meters and in the USA we use feet. All the divers I know use a computer which is far more accurate and adjusts for multi-level dives. Finally, the type is so tiny I can't read it. I just can't think of any application where the ND chart would be useful.The band reaches about 2.5\" beyond the buckle, but it fits fine, no need to cut as some reviewers have said. I don't plan to replace it until it breaks, hopefully many years from now..From 5 feet away, most people couldn't tell if I was wearing my TAG or this Citizen. I\"m totally satisfied with this purchase.Update February 2020. Still banking this watch up every day at work and no problems.Update July 2020. Crown and stem broke off. Tried to contact Citizen, but their website says they are no longer accepting repairs. Emailed them but they don’t respond.I’ll take the blame for the crown breaking off, but if Citizen won’t even respond to a request for service, there are plenty of other watch companies I can buy a replacement from.",
                        "timestamp": "Reviewed in the United States July 27, 2019",
                        "profile_id": "AFZUFOV7RSHTNSOVNIYZNH455HBQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2SI3BQYLXKL0Q",
                        "title": "5.0 out of 5 stars One of the best made better with Amazon Prime sale",
                        "author": "Jeff S",
                        "rating": 5,
                        "content": "This watch is consistently rated one of the best you can buy for under $1000. I have had my eye on one for my collection for a long time but never saw a good enough reason to shell out the money until Amazon Prime days dropped the price into unheard of territory of $150 so I jumped on it. Super comfortable rubber strap, Eco drive technology that charges the watch from any light source (read: no battery, no need to wind the watch, runs forever), legit dive specs if you need it (which most of us don't), great looks with the blue dial and orange hour hand. Very well made and finished and from one of the best watchmaking companies in the world? I got a ridiculous deal on it. Very happy. ADDENDUM: Honestly I didn't care for the polyurethane watch band that came with the watch. It didn't feel as comfortable as some watch bands I own like silicone or rubber, and I guess my wrist is a \"'tweener\" for the holes (one hole little loose, next hole little too tight). Recently I saw a review of the Omega Seamaster James Bond 60th anniversary watch that has a blue dial and a Milanese mesh bracelet. Honestly this Citizen will fill the bill stylewise with that Seamaster any time, and I thought that mesh bracelet would make my blue dial Promaster look like a million bucks. Well I was right. I think it's great and feels so comfortable. Highly recommend swapping out the standard strap.",
                        "timestamp": "Reviewed in the United States November 2, 2022",
                        "profile_id": "AEJBF77KFIDQHX6ELC6XMSCNQGCA",
                        "is_verified": true,
                        "helpful_count": 8,
                        "product_attributes": ""
                    },
                    {
                        "id": "R360JSPDWBDPEN",
                        "title": "5.0 out of 5 stars Great for diving",
                        "author": "Ryan",
                        "rating": 5,
                        "content": "Out of the box, the watch arrived in low-power mode. It took about a day of sitting in the sun to charge enough for use. The bezel is smooth and works well, although it is hard to operate with wetsuit gloves due to the rotating bezel being flush with the body. Overall I would recommend this watch as an affordable entry-level dive watch.",
                        "timestamp": "Reviewed in the United States April 29, 2024",
                        "profile_id": "AEOZYGCY5OAB4YR4W5LVM42BRO6Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1EB8AT1Y34GL3",
                        "title": "5.0 out of 5 stars Excelente",
                        "author": "Juan cruz",
                        "rating": 5,
                        "content": "Excelente",
                        "timestamp": "Reviewed in the United States July 20, 2024",
                        "profile_id": "AF4T3FTTABAVWAV3B7HJ5JLWFG7Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3R6R6LDIU1TLP",
                        "title": "5.0 out of 5 stars Nice!",
                        "author": "Doods",
                        "rating": 5,
                        "content": "Color is amazing and it came with the famous scuba tank!",
                        "timestamp": "Reviewed in the United States July 4, 2024",
                        "profile_id": "AGD3NA24QDXL3OEDGUIHB7O5NNEA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3MTWEWGT8FG71",
                        "title": "4.0 out of 5 stars A strightforward in your face watch...",
                        "author": "Lord Vertigo",
                        "rating": 4,
                        "content": "So finally I got my first ever pornmaster citizen divers watch...It was awesome to see the way it was packaged becuase it was encased in a beautiful scuba tank. I have been using a moderately sized g-shock ga 800 and gba 800 and so when I first saw this Diver I thought it was small. But I was delighted because it was beautifully crafted like it was forged by the elves of Rivendell. There was a magical glint in it but not too shiny. The navy blue dial is subtle enough for my taste( this color is not like a bubble gum blue for kids but its a blue that is decent for adults) and the round indexes is telling me there is no excuse for me to be late at work. The case is solid steel (?), light as a feather but tough as a nail. The bezel feels a little bit hard for me to turn but thats fine since maybe it is still new. The numbers around the bezel looks like it was just painted so I assume it may fade (does anyone here have this piece with faded numbers in bezel?). The crown can be screwed easily but it was a little awkward for me as I was trying hard to be careful with it. The lume can really be bright and it really last long enough through the night. Once your eyes get used to the dark of course the lume is more than visible enough. The strap feels rigid and strong (being a divers watch) but its not comfortable for me. Its either tight or loose on my wrist. I have a 6.5 inches skinny wrist. BUT overall I am happy with my purchase and I would recommend it to anyone. I was actually choosing between this watch and an affordable casio gravity master GA 1100 / GA 1000 but I realized that the gravity master is more like a digital watch with analogue feature. To be honest I was considering those casio models cus it looks cool. I know those watches can be tough but thats about it. I want something that is analogue, drama free, straightforward, tough and water resistant. So i considered a divers watch instead. I hope this piece will last long enough for me. I rated it 4/5 because of the strap. I know others had been replacing the strap with NATOs but that is an added expense again...",
                        "timestamp": "Reviewed in the United States October 6, 2018",
                        "profile_id": "AEZPVYU3AEY2L3DDWFV4UFSAIPBQ",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3QCC0VZVRYF7T",
                        "title": "4.0 out of 5 stars A real dive watch for desk divers",
                        "author": "M. Keefer",
                        "rating": 4,
                        "content": "Pros:- Great styling (I have the blue model)- Legibility- Wears well on wrist- ISO Certified Diver's 200mCons:- Polyurethane strap is a bit stiff (but not uncomfortable)- Mineral Crystal and aluminum bezel insert means watch can get scratched up easily if you are not careful- You have to grip the bezel directly on the ridges, which are spaced out around the bezel, in order to turn itFor full disclosure I am a \"desk diver,\" meaning I sit at a desk all day vocationally and will probably never take this watch scuba diving, so I cannot review its use as a dive watch. However, as an everyday watch I am very pleased, it looks good, is comfortable to wear and has decent lume, plus being a Citizen Eco-Drive you won't have any batteries to replace. If the 44 mm case diameter scares you consider this, the watch is only 12 mm thick, has a short lug to lug size and the way that the bezel is designed to slope inward makes the watch look and wear a lot smaller on wrist. I have smaller watches that have a much bigger wrist presence. So bottom line, if you are in the market for a budget friendly solar powered dive watch of decent quality you cannot go wrong with the Citizen Promaster.",
                        "timestamp": "Reviewed in the United States October 28, 2022",
                        "profile_id": "AGEYORHU4SZLV45VV5QNOVI3CH7A",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00PXVU3GM",
                "product_name": "Citizen Promaster Dive Eco-Drive Watch, 3-Hand Date, ISO Certified, Luminous Hands and Markers, Rotating Bezel, Blue/Stainless (Model: BN0151-09L)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:44",
            "updated_at": "2024-10-17 11:51:52",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252647470516154369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=4",
                "asin": "B00PXVU3GM",
                "page": 4,
                "pages": 158,
                "reviews": [
                    {
                        "id": "RXCUC1V2E63Q1",
                        "title": "5.0 out of 5 stars Great gift",
                        "author": "Bill Barrett",
                        "rating": 5,
                        "content": "My son loves this dive watch",
                        "timestamp": "Reviewed in the United States July 8, 2024",
                        "profile_id": "AHBYAGKPUEHQPX6QWOY3KDNWZI7A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3BA1V6A8RS75A",
                        "title": "5.0 out of 5 stars Excellent after years of use",
                        "author": "Chip",
                        "rating": 5,
                        "content": "I don't take mine of, ever. It's got scratches on it but I don't even want to replace it. The band is new-ish. I bought a similar one but wish I'd bought the original. Next time I will, and you should too. My watch is excellent. Even in winter it holds a charge without fail. I could have a rolex but I won't go there. It's a watch, and better yet, a high quality, certified dive watch.",
                        "timestamp": "Reviewed in the United States March 31, 2024",
                        "profile_id": "AHHAUUF6FDET4YGOPPL225YDRFNA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R90VRZH3MHPE1",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Fantastic product",
                        "timestamp": "Reviewed in the United States July 9, 2024",
                        "profile_id": "AHNMPLJYQACSBUAMUMGFLVEWW3AQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R22E18E0RB7GO0",
                        "title": "5.0 out of 5 stars One of my favorites",
                        "author": "SCG",
                        "rating": 5,
                        "content": "Pulled into the garage looked down to check the time and saw this. There are purchases and there are sure glad I bought this purchases. This watch falls into the latter category. Love this watch. The fit, finish, quality. All excellent. Worth every penny. Citizen is one of my new favorite brands.",
                        "timestamp": "Reviewed in the United States April 17, 2024",
                        "profile_id": "AGJOOXAWSHGJ7UJRAOJZ2P5AEJDQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2DLLNUQ24C02Q",
                        "title": "5.0 out of 5 stars El reloj",
                        "author": "Walter",
                        "rating": 5,
                        "content": "Es el 2 que tengo es clásico, elegante y con el plus solar",
                        "timestamp": "Reviewed in the United States June 16, 2024",
                        "profile_id": "AEIAACYNJVCV7M47S434FHOPQOQA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3TNWNG74UZX7C",
                        "title": "5.0 out of 5 stars I gotta give this one 5 stars for price, look and dependability! It is a beauty",
                        "author": "Texas KnowHow",
                        "rating": 5,
                        "content": "I got this beauty for a Valentine's gift from my babe. She knew I was interested in it and surprised me with it. I love the blue strap, matte side finish, clear crystal, and Rolex type face.The Eco-Drive is no joke. This is my second Eco-Drive watch. I have had my first Eco-Drive for 18 years and it is still a boss (I did send it in one time after 3 years to get the solar face replaced for free since it was under warranty, and it has been flawless since). That is why I am so confident in the Citizen Eco-Drive watch line.When I first got it, I set it to the official NIST time and the first few months I have had it, it has lost maybe 2 seconds. That is solid. The glow indicator are nice and bright in the movie house and in my truck at night. Also, the bezel gives a solid, clean click. It would be hard to have an accidental movement on the unidirectional bezel.As far as the water resistance, I have swam in my pool with it several times. Also, a week ago I got a flood day at work. The wind was right and the sets were clean so I went out to go longboarding in the Galveston gulf. No water penetration what so ever and it stayed put on my wrist. Just make sure that the crown is pushed in and screwed down after setting time and date.One con is that, for my old eyes, the date is hard to read. It is small and sits at the 4 hour mark.Overall, I am Loving this watch. This makes my 10th watch and it has become my go to daily. For the price, it can't be beat for this type of watch.FYI- an aftermarket replacement blue knockoff band can be purchased on Amazon for $15 if needed in the future.",
                        "timestamp": "Reviewed in the United States May 18, 2019",
                        "profile_id": "AFVULAE3WDPTR54GZLWBNAG22RMA",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": ""
                    },
                    {
                        "id": "RAFS3KWR15L85",
                        "title": "5.0 out of 5 stars Excellent watch for the money. Highly recommended.",
                        "author": "NBO",
                        "rating": 5,
                        "content": "I have over a dozen Swiss automatics that are much more expensive than this watch and yet this is one of my favorites. I purchased this watch as the every-day-watch and couldn't be happier. I needed a highly reliable watch with a dial that's easy to read at a glance, and a watch that I didn't have to worry about damaging. I agree the decompression chart on the band is a bit gimmicky but it's easy to get replacement straps of almost any type you want. The band is just OK. The watch itself is a great . As a quartz it keeps very good time and the ecodrive feature is fabulous. It will be ready and running with any use. I did store it in a drawer while on vacation and it had stopped when I returned, but a few minutes in sunlight or even lamp-light and it was back in service. I have 5 citizen Ecodrives and consider the Citizens some of the best watches for the money you can buy. They all keep great time, and just utterly reliable with no battery to replace. The bezel works well for a watch of this price. I like the offset crown. Not a sapphire crystal but the mineral crystal is good and so far no scratches. If I needed another watch like this, I wouldn't hesitate to purchase it. Lume is good but not great. I recommend Citizens to everyone in the sub $300 market, and this one in particular if the size of the watch fits your wrist. Compared to other 42s and 45mm watches I have, I'd say this watch wears a bit smaller than its 43mm spec would predict. The only negative I have for this watch, and it applies to most watches these days, is the tiny date window. Without a cyclops these tiny date windows are extremely hard to read. Either make it bigger or just eliminate it. Yes, those are comments attached to 50-something old eyes, but it's the one glaring but minor weakness for design I \"can\" (can't) see.",
                        "timestamp": "Reviewed in the United States July 23, 2016",
                        "profile_id": "AHF7V7Y47PTIE6S2HXTGCF7Z26BA",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "RA2Y2C1GXAOVI",
                        "title": "5.0 out of 5 stars Very good quality watch.",
                        "author": "Edward Silverio",
                        "rating": 5,
                        "content": "I've had this watch for almost a month now and I'm happy with it. It looks really good. I'm no diver and will likely never swim with it, but it appears tough enough to weather any condition.The only minuses, and they 're really not negatives, are that the date indicator is too small to read. My eyesight has declined a bit over the years, but its still a very small date indicator. The other thing that I found a bit off is the packaging. The box was dented on one corner, no big deal. However, I thought the box would be sealed like other higher end accessories or consumer electronics. Opening the box didn't give the impression that the watch is really new as there was no seal or protective film covering the watch (I do assume that the watch is new). The divers air tank container is a cute novelty, and does protect the watch during transport.",
                        "timestamp": "Reviewed in the United States August 5, 2023",
                        "profile_id": "AGI7DXFXWMCUNIUJZUN7KRAOY4ZA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2T3VI2UF9BS09",
                        "title": "5.0 out of 5 stars Great daily wearing watch",
                        "author": "Jeremy Folkes",
                        "rating": 5,
                        "content": "Great looking and accurate and a hard to beat every day wear watch",
                        "timestamp": "Reviewed in the United States June 7, 2024",
                        "profile_id": "AFZNV7XAQ4WYWR7YSHWUM4Q4AGSQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3OQY2NR3VW2TH",
                        "title": "5.0 out of 5 stars Thanks to Myself",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I ordered this watch and received the next day using Amazon Prime, as promised. The watch appears brand new with the faux/plastic scuba tank box and a tag dangling from the watch band. I rated 5 stars for the accuracy, but truthfully, I'm typing this review after less than 1/2 hour after setting the time & date.Note, the most difficult thing about this dive watch, one of many I've owned, was how to open the scuba-tank-looking case, which merely opens by pulling the top upward and the bottom downward. I first tried to unscrew the two halves, which didn't work and thank goodness, I didn't break anything trying.I was first worried the watch was going to be too small in diameter, but it's just right. It might be 0.5mm-1mm smaller than my Seiko, Casio, Marathon, and Isobrite dive watches (all quartz type); maybe the same.This watch is highly recommended, by me.As of 1/25/2024, I'm still wearing this watch as I type and it's great. It's definitely one of my favorites.",
                        "timestamp": "Reviewed in the United States March 31, 2023",
                        "profile_id": "AGQVGLVYUKJK2H4UJSYHYBMNRSPQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00PXVU3GM",
                "product_name": "Citizen Promaster Dive Eco-Drive Watch, 3-Hand Date, ISO Certified, Luminous Hands and Markers, Rotating Bezel, Blue/Stainless (Model: BN0151-09L)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:44",
            "updated_at": "2024-10-17 11:51:53",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252647470516154369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=5",
                "asin": "B00PXVU3GM",
                "page": 5,
                "pages": 158,
                "reviews": [
                    {
                        "id": "R2BO7FAIRJ888G",
                        "title": "5.0 out of 5 stars If Superman could own just one watch ...",
                        "author": "DAWEVA",
                        "rating": 5,
                        "content": "I began my watch collection with a bias towards automatics–as is common. But what could be more \"auto\" than simply setting your watch once, and then living your life without thinking about winding, hacking, or jumping in water without care, for the next decade or so? In truth, I beat the hell out of this watch daily. I hammer, paint, hang drywall and shower with it on to give it a good cleaning from its labors that day. I use hot water and soap and could care less, 'cause this thing loves it. What was purchased with the notion of just being a daily beater, has earned such respect and admiration from me that it's now near the top of my rotation even on my days off. I miss getting messy with it, but I love to let it shine too. It forces one to get out and get in the sun due to its solar recharging–even though I know it'll hold a full charge for six months in total darkness. It's a certified diver like the SKX, but you can hack and set it once, and maybe lose a second or two every few weeks. I use it often to set my sloppy automatics with and when I need to know what time it really, is, it's the one I know I can trust. It looks great on every type of strap, has a solid, satisfying bezel action, and is incredibly resilient to abuse. The brushed finish looks amazing after a full year and now that I'm retired, I will continue to find new ways to challenge myself, and this watch, with new adventures.",
                        "timestamp": "Reviewed in the United States May 13, 2021",
                        "profile_id": "AF3HVWB6RJWJOFRVBYYBPQKYK2TA",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "RIUWZD1193TL7",
                        "title": "4.0 out of 5 stars Basic functions with solar",
                        "author": "Dougboffl",
                        "rating": 4,
                        "content": "I wanted a good brand, solar, dive rated, with a second hand and rotating bezel without paying a week's salary or more for it. Easy right? Wrong. This (~$175), some Casios and some Seikos (even mo money) are about it. This is a great color IMHO, strap looks good with watch face. I considered a SS band but thinking now I'll keep this blue rubbery one on it. I had one \"what?\" moment where I had adjusted the date (middle of the day) and next day I noticed it had advanced two days, hmmm. Gonna keep an eye on that but seems fine now. And I do understand mechanical (analog) date displays and sensitivity to the time of day, when not to adjust them. Sometimes this happens if the stem is rotated a bit extra when date setting but I was focused on not doing that. Photo includes: a Casio AMW320 (~$60) a favorite cause it has the digital stuff but needs a battery every ~two years, a Casio Tough Solar (~$35) not a fav because it has no second hand and no rotating bez, and a US Quarter (~$0.25) as a size comparison. The three year old Tough Solar gets daily use & abuse thus the \"Tough Solar\" ink is gone. The face & body of the Tough Solar is pretty much the same size as the other two watches but my crappy camera pic and the pre-curved band on that watch make it hard to keep everything in the same focal plane. I thought long about the Casio ProTreks (PRW-6000) but don't need to spend the extra coin on sensors I won't likely use. My perfect unicorn watch would be a solar power AMW320 for under $100. Ya listening Casio? PS - the Tough Solar proves it is not costly to make a water resistant solar watch.",
                        "timestamp": "Reviewed in the United States April 9, 2017",
                        "profile_id": "AHKCACH3IKNIA747IAQ6K5DE3K2A",
                        "is_verified": true,
                        "helpful_count": 8,
                        "product_attributes": ""
                    },
                    {
                        "id": "R7ZEJ51MABP80",
                        "title": "5.0 out of 5 stars Beautiful timepiece",
                        "author": "Bad Tomato",
                        "rating": 5,
                        "content": "I have a couple self winding watches and needed a new everyday dive watch. I found this one accidentally, and the more I learned about it, the more it seemed a good choice for me.The self powering by sunlight is fantastic, I don’t even know if you can manually wind it. I just wear it and it works. Unlike automatic self winding watches this one doesn’t gain/lose time arbitrarily. It’s very accurate.The band is comfortable, and it all looks good. I’m very happy with this one.The only thing I dislike is the dumb scuba tank holder it was boxed in. I was hoping it wouldn’t come in that but it did. Oh well. The watch is great.",
                        "timestamp": "Reviewed in the United States October 28, 2023",
                        "profile_id": "AH3S7BM3TCN5GHAKUU2TN23CNEIA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2H7CCY6I9QCY",
                        "title": "5.0 out of 5 stars Extremely well-made beautiful watch for both diving and dressing up.",
                        "author": "SEinson",
                        "rating": 5,
                        "content": "I have had many Eco-Drive watches for the past 20 years and each one continues to work flawlessly without ever having to had them serviced for problems. I do recommend having diving watches serviced every 5-6 years to insure the seals are good and the watch maintains it specifications.",
                        "timestamp": "Reviewed in the United States March 22, 2024",
                        "profile_id": "AESTCZQ3VAYRTIHCYT5ARNPOP2YA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3GX9UD94YU258",
                        "title": "5.0 out of 5 stars Fantastic watch!",
                        "author": "Connoisseur",
                        "rating": 5,
                        "content": "This is my second Eco-Drive and third dive watch and this has to be one of my all-time favorite watches to own. I admit I would really like the $4000 Breitling Superocean but for 20% of the cost this suits me just fine, I love a blue watch with a blue band for paddling and for other outdoor recreation. The dial is easy to read, the case has good heft, and it was a snap to register the watch online plus it comes in the signature dive tank case. I probably spent a month looking at blue face and blue band watches to replace one I’d worn for years and I’m convinced this is the best at this price point. And it’s a Citizen. If you are new to Eco-Drive and have noticed that watch batteries are increasingly difficult to find you will love the solar-powered feature. Highly recommend.",
                        "timestamp": "Reviewed in the United States July 14, 2023",
                        "profile_id": "AF3FQEPA7PQKJCNQY7RQIUJ3R6VA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "R5VRCZEFVBANP",
                        "title": "5.0 out of 5 stars Good Looking Watch",
                        "author": "shakin_jake",
                        "rating": 5,
                        "content": "I’m pretty impressed with this diver. For one, I’ve had it on my wrist (24/7) for a week now and it has kept perfect time. I use time.is for verification. I’ve been into wristwatches for close to 5 years now. Started with a moon watch (357050). Sold it to finance a 6 digit Sub (2015) which spent most of its time in a drawer. Too blingy for my tastes plus, I started wearing and collecting Seiko divers. FWIW I have 9 Seiko divers. Started w/a 7002-700A. Nicest to date and most worn is an SBDB009, the spring drive Tuna yet I like and wear several Turtles, Monster, the venerable SKX007, on and onWhat I like about this Citizen diver and I’m amazed that I do, is the solar function. I had (&sold) a lowercase Seiko solar diver. Anyways, I like the fact that this watch will run for 6 months fully charged if it never sees the light of day again. Something next to impossible since I live and work outdoors in north central Fla.All my other divers are mechanical, and I really doubted I would warm up to a quartz watch yet I have in a very big wayI ditched the OEM band and currently have only worn with the NATO in the picsAlso, this is my first blue dial diver. Since I went against the grain buying a quartz watch, I figured I would break another rule and go with a splash of colorAnother aspect of this watch I’m enjoying is the lightness, since it doesn’t run on springs and other metal bits, though I don’t mind wearing heavy wristwatchesWhat else?!?...I bought it on sale. Deal of the day. Approximately $105 & changeHow long will the love affair last? Time will tell=:-)",
                        "timestamp": "Reviewed in the United States February 16, 2019",
                        "profile_id": "AHGWAQJ5LW6V6KVQYJ6LSBGHSOLQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3AN3QTTZGAZDD",
                        "title": "5.0 out of 5 stars Solid, good looking watch, durable enough for everyday",
                        "author": "weh729",
                        "rating": 5,
                        "content": "I have been looking for an everyday watch that looks good, and this fits the bill. I am a facility manager so I need something durable enough for the blue-collar work and nice enough for meetings with executives and engineers.I had been looking at automatics, Ray II and SKX, but I wasn't thrilled over worrying about maintenance on them and it seems the accuracy is also a problem. I want a watch I can put on and not have to worry about it. I have always heard good things about the EcoDrive line and I decided to give it a shot.i have an 6 1/2\" wrists so i was a little worried about the 44mm case size. Don't worry about it at all, it doesn't wear as big as its size suggests that it would. Given my sub 7\" wrist, the band on it it too big for me, too much excess strap soI did decide to purchase a stainless steel braclet. Looks good. In fact it's dressy enough to wear with a sport jacket on a date with my wife.The lume lasts a good long time. i can put it on my nightstand before bed and it is still readable 5-6 hours later.My only complaint is the size of the calendar window, i wish it were either bigger or it had a cyclops. The date is difficult to read.I have a watch liking co-worker that commented about it. He really liked the scuba tank packaging.I've only had the watch a few weeks butI am very happy with my purchase. Durable, good looking, accurate, and maintenance free; what more could I ask for. Now I'm looking at EcoDrive chronographs...",
                        "timestamp": "Reviewed in the United States February 27, 2020",
                        "profile_id": "AGJDC32BJ56KGZSCW7QJAXLYOZCQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R5HBQT6HFOYKS",
                        "title": "4.0 out of 5 stars Worked well for a few years",
                        "author": "Joaquin R. Trigueros",
                        "rating": 4,
                        "content": "The minute hand became eventually loose and the watch was useless. It might have been worth repairing but they're not usually re-sealed to the same 200m standard.",
                        "timestamp": "Reviewed in the United States January 5, 2024",
                        "profile_id": "AE5VBLPB3Z33HG5UWKTF2F3L3MDA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2P0UMHFF1BORZ",
                        "title": "5.0 out of 5 stars Remarkable Technology In a Sports Diver Watch",
                        "author": "Grunt",
                        "rating": 5,
                        "content": "A Citizen ECO-Drive movement on a dive watch eliminates the frequent need for replacing batteries and the potential for a bad seal. Unlike the majority (or all ?) of Automatic movements the quartz is more accurate without need of constant movement or winders to keep it functioning. As long as there is light my experience with Eco-Drive's is that we are talking in the range of a decade before the back seal is broken for a battery or capacitor replacement. For the price of admission you will not find a comparable dive watch then this version of Citizen's light driven Promaster Pro Diver. The only picky flaw that I find worthy of comment is the cheap blue polyurethane band with a tacky and non-essential Non-Decompression table on the side of the band. Most sport divers will find this feature useless. Fortunately, the band is easily replaceable with a NATO style nylon band or steel bracelet worthy of this watch to make it even better looking with a bit of personalization. The date only window in the 4 O'clock position is a bit small and sometimes requires a bit of squinting and wrist twisting to decipher. The lume is acceptable for this price point. In my experience, the overall build, looks and function of this watch eclipses many of the high-cost, big name diver's watches who cannot seem to make the hands line up with the indexes correctly or keep time as well. This one is spot on.Highly recommended for surface dwellers and casual sport divers wanting a high quality watch with great looks at a low cost. It is an unbeatable bargain for those seeking a first-rate traditional diver's watch with a bit of modern technology.",
                        "timestamp": "Reviewed in the United States March 15, 2020",
                        "profile_id": "AGLSRNDVR6NHLVDMGW5Q3JJF5FCQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2TJBXND0MSW4S",
                        "title": "5.0 out of 5 stars Dress to Impress",
                        "author": "ASDstar",
                        "rating": 5,
                        "content": "Love this watch. What's not to love? This is a great looking watch, that will get noticed. Hang out at some bar in the Pacific or the Caribbean and someone's bound to notice and ask, \"Do you dive?\" \"Well, yes I do.\" You're gonna get mileage out of this timepiece; if you know what I mean. Watch looks good in a T, shorts and sandals or in the boardroom. (and bedroom).OK, so this is my second Citizen Eco-drive. They're great because they are always on time.I admit the design is a rip off off of the original Seiko dive watch; of which I own two. Here's why the Citizen is better. This particular style is better looking. The contrast of the blue dial and the white and orange hands is better looking. The case is large, but not too large. It looks substantial but doesn't look like you have manhole cover on your wrist. I can't get away with a watch that big. In spite of the size it is still light weight (when compared to the Seiko). You won't even notice you have it on...until you get a compliment.The strap is a bit stiff and not very thick (again compared to the Seiko) But I don't care and it's not even noticeable when worn.For those complaining of its function as a dive watch..C'mon. No one uses a watch like this to dive with. What? Are you diving with Jaques Cousteau? Everyone uses a dive computer. If you need this to dive with, maybe you should stick to the snorkel excursion offered by the cruise ship. This watch is for bragging rights and story telling after one tepid beer after another at some beachside establishment with Red Stripe metal bar chairs.",
                        "timestamp": "Reviewed in the United States October 8, 2019",
                        "profile_id": "AFNC6FKEKKFQDTPS3HDQNVAGSY6Q",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00PXVU3GM",
                "product_name": "Citizen Promaster Dive Eco-Drive Watch, 3-Hand Date, ISO Certified, Luminous Hands and Markers, Rotating Bezel, Blue/Stainless (Model: BN0151-09L)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:44",
            "updated_at": "2024-10-17 11:51:55",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B00PXVU3GM?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252647470516154369",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:51:44",
        "domain": "com",
        "geo_location": null,
        "id": "7252647470516154369",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B00PXVU3GM",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:51:55",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252647470516154369",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252647470516154369/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252647470516154369/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252647470516154369/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647470516154369/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}