{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=1",
                "asin": "B00Y2S944E",
                "page": 1,
                "pages": 615,
                "reviews": [
                    {
                        "id": "R2P7W6HWGKFK9T",
                        "title": "5.0 out of 5 stars Perfect watch for small wrists too!!!",
                        "author": "Jimmer- J",
                        "rating": 5,
                        "content": "I really like the large display that’s very easy to read outside. The band stays locked extremely well. The band has a sleek design. The light button is on the right side but otherwise I love it. I’m super impressed with the fit and quality. I tried the discounted returned item and it was perfect. The box was a little banged up and the instructions were missing but for $6 less than regular price I think it was worth it. I’m so glad I found another water resistant watch. Buy it, you’ll love it.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AFWX56K5LOABNXZY2EYCQOGSCW5A",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3CE0P48RUV2K6",
                        "title": "5.0 out of 5 stars Gadget on a Budget",
                        "author": "Ale Alvarez",
                        "rating": 5,
                        "content": "I loooooooove this little gadget so much. The day after I bought the watch, they put it on SALE!!! I almost bought another one because, for $13 (sale price), you get a sturdy, stylish watch that is easy to use and reprogram.The watch is also water-resistant. I wash a lot of dishes lol so it's really nice not to have to fiddle with my watch every time I have to put my hands under water! It's been about 3 weeks since I bought the watch, and it's really helped me at work with managing my time, and I love how many modes this little watch has. It has a spot for a second time zone, an alarm that beeps at you a few times when it goes off, and a stop watch, and if you press the ST/STP (start/stop) button, you'll be able to see the month, day, and year. Super great purchase!",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AEH2CF3UX5ZGY6VSKNDNBKWMD2EA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R3PAXEVFCJ5Q5I",
                        "title": "4.0 out of 5 stars Good cheap watch that will take a beating. 4 months so far",
                        "author": "E. Jo",
                        "rating": 4,
                        "content": "I purchased this watch in the middle of a summer camp season in 2022 after my 15-year-old Timex sports watch (Yes, 15 years old—so old that the model is no longer made) finally gave up the ghost. With its predecessor having survived everything from water to mud to bicycle crashes, I had high expectations for this one.So far everything is going well. The watch does have a 24 hour mode, which is essential for me, as well as an alarm, water resistance, and an attractive gold-coloured face plate. It has survived everything I have thrown at it so far, from waterskiing to 100-degree heat, to washing dishes in a commercial kitchen. Armitron got all the most important stuff right even in a shrinking market; the reason I did not give this a 5 star review was that this watch does have a few odd quirks that I have detailed belowPros:Excellent priceReasonably stylishSmall, compact and light weightWater resistant (this does not mean fully waterproof; do NOT press the buttons underwater)24 hour time and a serviceable backlightShows no signs of wear even after 4 months heavy use.Cons:Display lacks some contrast compared to my old TimexWhile it allows you to set the year in its date readout, it does not do daylight savings time automatically—somewhat puzzling because I thought that was the point of setting the year.Cannot figure out how to swap the T2 auxiliary time zone into my primary time zoneNo count-down timerWhile the faceplate is gold, the band clip is silver. This is unimportant if you buy a silver one.The lettering on the front that reads “Armitron WR 330M” faded away within 4 days.Not quite as accurate as my old Timex—I lose about 1 minute per month, which is just okUpdate, April 2, 2023: About 8 months later, and still going strong. The plastic watch face is proving to be more scratch resistant than my previous Timex, and I still feel that the watch is presentable outside of work.",
                        "timestamp": "Reviewed in the United States November 15, 2022",
                        "profile_id": "AHIELRQI7RRXBIGRQZ7CM6QGWEEQ",
                        "is_verified": true,
                        "helpful_count": 59,
                        "product_attributes": "Color: Black/Gold"
                    },
                    {
                        "id": "R1FO3TOWS8TZ79",
                        "title": "5.0 out of 5 stars good watch",
                        "author": "Leah Thowson",
                        "rating": 5,
                        "content": "Needed a waterproof watch for lake days. This is perfect. Ive been wearing it for a few years now and its still working great! I can be in the lake all day just floating and it never skips a beat.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AHWB4TFKHMXT2Y6SWXYMZCRQWACA",
                        "is_verified": true,
                        "product_attributes": "Color: Powder Blue/Rose Gold"
                    },
                    {
                        "id": "R3315199WIA3WK",
                        "title": "5.0 out of 5 stars LOVE THIS SPORTS WATCH!",
                        "author": "Jill Currey Shermer",
                        "rating": 5,
                        "content": "I bought a few sports watches and just happened to have ordered this one in a mix. Once I worked my way to wearing it, I loved it from the moment I put it on!!I've really active and have worn a sports watch 24/7 for nearly 25 years. When I dress up for a nice dinner, party or formal occassion, I struggle with finding the right watch that hides the noticeable tan line on my wrist, but still looks classy.For an inexpensive sports watch, this one looks fabulous for a night out in a dress! I've already had two friends notice it, and when I show them what I'm wearing they are shocked at how nice it looks.It's the perfect size and has all of the functions I need in a sports watch. I ordered two more so I have plenty of backups for a long time :)",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AFSIOOXKA3RNOBNISRKNZPBMCGCA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R18CMNLKFS2XAR",
                        "title": "5.0 out of 5 stars Adorable and small",
                        "author": "Jessica t.",
                        "rating": 5,
                        "content": "Great watch for a preteen girl! Small and compact, easy to set. My daughter loved the color of it. I like that it's got a bright backlight and loud alarm. Great value! My daughter has a small wrist and it's easily adjustable, and long battery life.",
                        "timestamp": "Reviewed in the United States August 16, 2024",
                        "profile_id": "AHTO6LQ5RF6CJ5R2QWJ7HDTC2BTA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Teal"
                    },
                    {
                        "id": "RVYBX338GT91T",
                        "title": "5.0 out of 5 stars So far so good!",
                        "author": "Jilly",
                        "rating": 5,
                        "content": "I just received this watch and I have to disagree with the negative reviews. It does come with instructions and was very easy to set the time, the date was already showing today’s date. One of the reasons I bought this watch is because of a negative review regarding the watch band, they claimed it was more of a beige color than pink. It definitely is a very light beige or even off white which makes me happy because I don’t like pink. The gold is a rose gold although I suppose it could look different depending on the lighting. The watch band is comfortable and fits my small wrist. Of course I don’t know about the battery issue, time will tell… I’m quite happy with this watch so far, I’ll update if any issues occur. 21 days later and the battery is still working perfectly.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AEMPNB36FXXT5ECZ4JYQAKDTCRQQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: Blush Pink/Rose Gold"
                    },
                    {
                        "id": "R9YTO792X5BQG",
                        "title": "3.0 out of 5 stars Gets stained so fast",
                        "author": "Sophia Ruth",
                        "rating": 3,
                        "content": "The media could not be loaded. I do love this watch so so much! It's perfect for what I need, it's so cute and small. However, it got stained this dark black tint and makes the watch look perpetually so dirty and gross :( It started after not even 2 weeks and has only continued to get so much worse since, and i've only had it for 2 months. I don't do anything dirty ever, it had never gotten soiled and i've tried everything method possible to get rid of it, but it will not budge. So so sad about this 😞",
                        "timestamp": "Reviewed in the United States August 19, 2024",
                        "profile_id": "AGN5GHQWNX7QHCTZMXJ4ZGVNFDOA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Blush Pink/Rose Gold"
                    },
                    {
                        "id": "R2F5I5HXGMZTW7",
                        "title": "3.0 out of 5 stars is it not as great as I thought?",
                        "author": "Heber Jairo Lopez Zalba",
                        "rating": 3,
                        "content": "I love the small size, the date, being able to set an alarm, and the light. It's not perfect, but it was the best I found, and I looked at A LOT of watches.CON: the strap could be better, the edge flaps around. I wish it was more wrist-shaped, and had an extra nobbin to hold it secured (like the timex marathon watch does).This $15 watch outlasted my $50 watch, and did well on river trips and wearing it everyday.It's demise came when I wore it into a jacuzzi for about 60 seconds. It still sorta works. But isn't really readable. The battery is still working fine after 3 years though.I bought a replacement, and it's not as good. I wore it in calm rivers too, and after 3 months it started getting moisture stuck behind the face. what the heck?",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AFIKZV4IP5FEJHEJTXKQ6UPHQK2Q",
                        "is_verified": true,
                        "product_attributes": "Color: Powder Blue/Rose Gold"
                    },
                    {
                        "id": "R20ASS7RZPPM0B",
                        "title": "4.0 out of 5 stars Good for kids. Doesn't show month on main mode.",
                        "author": "Shop Organize",
                        "rating": 4,
                        "content": "This is a really good watch for kids. It fits around the wrist of a very skinny twelve-year-old on the first notch. I like the color, and it looks really nice. The band is long when tightened to the first notch, but the wristband keeps it in place. It's a little misleading in the sense that when you first see the picture, it looks as if the month is also displayed on the screen. That's not the case. You actually have to press and hold one of the buttons in order to see what month you're in. I bought this watch to help a child with special needs understand how to tell time and learn calendar dates. The fact that you have to go through an extra step in order to view what month you're in kind of defeats part of the purpose. Overall, the silicone on the band seems durable. Comfort-wise, there was one complaint that it was difficult to write while wearing the watch from the child. I didn't see any scratches on it whatsoever. I do find that the modes are little difficult to use, set and remember as there are 4 buttons that do a huge amount of things. This might be confusing for some children.",
                        "timestamp": "Reviewed in the United States October 21, 2023",
                        "profile_id": "AF7X5DMXD52FAP4UMCC47XJBOO3Q",
                        "is_verified": true,
                        "helpful_count": 13,
                        "product_attributes": "Color: Purple/Silver"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00Y2S944E",
                "product_name": "Armitron Sport Women's 45/7012PRSV Purple and Silver-Tone Digital Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:39:30",
            "updated_at": "2024-10-17 11:39:36",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252644391821514753",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=2",
                "asin": "B00Y2S944E",
                "page": 2,
                "pages": 615,
                "reviews": [
                    {
                        "id": "R32AL0P6NJ0XFV",
                        "title": "4.0 out of 5 stars mostly great but you can't turn off the beeping",
                        "author": "H",
                        "rating": 4,
                        "content": "Overall, a great watch. I like the way it looks and it's very easy to use. The fact that you can put a second time-zone in is a bonus that could help many people. I travel a lot, so it will help me. I do have a Garmin, so I bought this specifically because I was going to take an exam for which a stopwatch was recommended but a smart watch was not allowed. In the end, I couldn't use this one because you can't turn off the beeping sound it makes when you hit buttons. That would cause a distraction to the others taking the exam around me.In most situations, I can see why you would want that beeping sound. If you are using it when running, for example, you don't need to look down at your wrist to see if the stopwatch started because the beep sound let you know. But for my needs, I had to be able to turn that sound effect off. So, I do wish that was something you could turn off or on.But the watch looks great. I actually chose the one I bought because it looked like my Garmin. It was really easy to use and I'm sure it will last a long time. I'll probably pack it on my other trips as a back-up watch in case my other one runs out of battery.",
                        "timestamp": "Reviewed in the United States July 24, 2024",
                        "profile_id": "AHCX63UWAAKRMIDPUBPF4JODMO6Q",
                        "is_verified": true,
                        "product_attributes": "Color: Grey/Pink"
                    },
                    {
                        "id": "R1UYSIPHVZI7M4",
                        "title": "4.0 out of 5 stars Great watch but it arrived with a dead battery",
                        "author": "Shelley L.",
                        "rating": 4,
                        "content": "I have owned at least 3 of these watches. I really like them for their size, simplicity, and price. For me, they usually last 2-3 years before either the band breaks or the battery dies. And I wear it constantly and wear it swimming. First problem I have had is with the most recent purchase of it. Ordered it in July of 2024. It arrived with a dead battery. Sure, i could have just replaced the battery, but dang it, i paid for something that should arrive in working order. So, I returned it. But they sent me what looks to me like a used or refurbished one. There is an extra strap holder on the band that is very faded, the band itself is not completely clean, and there was no film covering the face. Again, i paid for a NEW one. So, I tried to start another return and it says they can't replace right now. Great. I guess I should have just stuck with the dead battery one. At least it didn't look previously worn",
                        "timestamp": "Reviewed in the United States July 26, 2024",
                        "profile_id": "AHRXEZKBLU6XU5VN6JNMOZ3WN6SQ",
                        "is_verified": true,
                        "product_attributes": "Color: Navy Blue/Rose Gold"
                    },
                    {
                        "id": "R1XREXRIXIDF6T",
                        "title": "4.0 out of 5 stars Love it",
                        "author": "Amy",
                        "rating": 4,
                        "content": "As the title says, I love this watch. It’s just what I need and fits perfectly on my small wrist. This also isn’t my first time buying it. I’ve probably bought 2 or 3 in the past. The watch is very well made and lasts years. Or at least for me it has held up. Obviously I’d buy it again in the future.",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AEKWVWBPTOSIPISDY3I3UHRAKNSQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3NP6EEXXM4Z11",
                        "title": "4.0 out of 5 stars Perfect size for kids",
                        "author": "Josh Martin",
                        "rating": 4,
                        "content": "Very easy to take on and off. Color of the white fades fast- but other than that as expected- should have got a different color band",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AFW3ZD6M5UWTKVPNC3X7ZILDWL7Q",
                        "is_verified": true,
                        "product_attributes": "Color: White/Iridescent Rainbow"
                    },
                    {
                        "id": "R39QHTGZG1DBZW",
                        "title": "4.0 out of 5 stars Durable, affordable, waterproof watches!",
                        "author": "Wales",
                        "rating": 4,
                        "content": "I have had a few Armitron watches over the past 8 years and they all have been fantastic! They have all survived pools, oceans, etc. and last forever! Very nice product for the price. I bought this specific watch for the use of the stopwatch feature as my past ones were analog. Unfortunately, the watch has water damage after a casual afternoon floating in the pool. The watch still works, but there was clearly water under the screen and a small part of the day of the week is not working. I have had this watch for 5 months, so I was disappointed by how quickly this one was damaged. Purchased a new one (as they so affordable) and hopefully have no issues with that one!",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AEE6TSQIMP3UEI2WFWP27I4J4FUA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R2GX8GRJLDQERU",
                        "title": "4.0 out of 5 stars Beautiful",
                        "author": "TKT",
                        "rating": 4,
                        "content": "Looks beautiful! Nice array of features, as well, although trying to access certain features like the alarm are a bit tricky (even with the instructions).",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AHUYSW26TFQOFICI6FNZC2EZSJHQ",
                        "is_verified": true,
                        "product_attributes": "Color: Light Pink/Silver"
                    },
                    {
                        "id": "R2E9SZ4ZXJJ6F9",
                        "title": "4.0 out of 5 stars Hard to set up watch",
                        "author": "Great buy! Love them!",
                        "rating": 4,
                        "content": "Outside of the set up, it is a functional watch water resistant. For the price, good deal. I got the silver this time and it’s cheesy, looks like shimmery plastic. I would go with the lavender or another color.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AFFQJJH3PQBUZVGUTPKQS3IH2SMA",
                        "is_verified": true,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R34K9OS1SRKKCR",
                        "title": "4.0 out of 5 stars Pink watch",
                        "author": "Delesia Dismuke",
                        "rating": 4,
                        "content": "Cute pictures no watch",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AGWNIXD5USVKCSHY5CXQMW6OB3OA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink/Silver"
                    },
                    {
                        "id": "RQBL7D8LAVEOQ",
                        "title": "4.0 out of 5 stars Fine but Small",
                        "author": "Neal",
                        "rating": 4,
                        "content": "The watch seems fine but the face is smaller than expected - about the size of a nickel",
                        "timestamp": "Reviewed in the United States September 8, 2024",
                        "profile_id": "AEEN4B7I4O72USXYGB7XQ63ZBY2A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R12TBEDP5CMEXQ",
                        "title": "4.0 out of 5 stars Works good",
                        "author": "Vijaay",
                        "rating": 4,
                        "content": "Very neat and simple",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AG5BSBJYJPATMVEJLWB56LU2BMYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Gold"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00Y2S944E",
                "product_name": "Armitron Sport Women's 45/7012PRSV Purple and Silver-Tone Digital Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:39:30",
            "updated_at": "2024-10-17 11:39:37",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252644391821514753",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=3",
                "asin": "B00Y2S944E",
                "page": 3,
                "pages": 615,
                "reviews": [
                    {
                        "id": "R1HA3JF2MECTLT",
                        "title": "5.0 out of 5 stars Best watch!",
                        "author": "allan",
                        "rating": 5,
                        "content": "This is my second watch like this. These watches take years to die and are truly waterproof. I use mine every the summer when I go to the pool or water park. It’s easy to use, light weight, durable, and easy time settings and bright enough. Years ago, I’d spend a lot more on a shark freestyle watch, but since I found these, it’s a no-brainer. These are great. They do the same job as the shark watch, but these are only $20.",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AGUHBDFNUYIN7L4O6YKWWGMQK53Q",
                        "is_verified": true,
                        "product_attributes": "Color: Grey/Pink"
                    },
                    {
                        "id": "R1YKKNNHUW54C2",
                        "title": "4.0 out of 5 stars Armitron watch",
                        "author": "marcia gordo albrecht",
                        "rating": 4,
                        "content": "This is my 3rd armitron watch and I really like them. This time I got a ladies look rather than a bigger sport type one. The only draw back is the band breaks after 3 years I've tried to replace didn't work so I just ordered a new one this is my 3rd watch I will order again if the band breaks they are reasonable in price and I'm pleased with all my purchases.",
                        "timestamp": "Reviewed in the United States August 2, 2024",
                        "profile_id": "AEUQ3ZSWIBZXJICR7DRB3KB773MQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "RT26YQ0T9TAQL",
                        "title": "4.0 out of 5 stars Hard to read at times",
                        "author": "Abram Nicholson",
                        "rating": 4,
                        "content": "Dufficult to read for my wife and myself. But we are both nearing 80 years of age.",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AGXUIY7F3K4GFZFWUGXMHUDJKF7A",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R1R4VQOYWWIM3H",
                        "title": "5.0 out of 5 stars Love this watch!",
                        "author": "Casey",
                        "rating": 5,
                        "content": "love the color, love the ease, I re-buy it every couple of years when the battery dies",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AGU542U4NHLBMGZ74VEPJ2XVCDRA",
                        "is_verified": true,
                        "product_attributes": "Color: Blue"
                    },
                    {
                        "id": "R3IIKDUG5BQ2H0",
                        "title": "4.0 out of 5 stars Nice watch for the price",
                        "author": "TMB",
                        "rating": 4,
                        "content": "This seems like a solidly built watch and I like the color. I've received a few compliments on it in the short time I've worn it. Keeps good time. The only downside is I wish the band was a little longer. It fits my larger wrist but it's on the last hole most days and the end of the band doesn't always stay in the sliding loop that holds it down. Otherwise it's a nice watch.",
                        "timestamp": "Reviewed in the United States July 27, 2024",
                        "profile_id": "AFRLAMI63ZFSTEFDXDCFTAVCMRLQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "RD9X7VA7EC5K3",
                        "title": "5.0 out of 5 stars Perfect!",
                        "author": "sandra richards",
                        "rating": 5,
                        "content": "I wanted a cute watch with date and time that would hold up to water. I'm a professional dog groomer so my wrists are wet off and on all day every day. I like it on 24hr time. It's easy to set, easy to read. Love it",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AFAMDHGV6EMZOWUMEBQUTKLULLGA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black/Iridescent Rainbow"
                    },
                    {
                        "id": "R3B2B0GZKYPYOP",
                        "title": "5.0 out of 5 stars Reliable watch, easy to read!",
                        "author": "S. grant",
                        "rating": 5,
                        "content": "I like the easy to read dial and comfortable fit of the watch band.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AGFFEGOBA3GMNG4KJE4TXSNN3F4A",
                        "is_verified": true,
                        "product_attributes": "Color: Red"
                    },
                    {
                        "id": "R2EK4N0530XP8R",
                        "title": "5.0 out of 5 stars Durable!",
                        "author": "Lisa Barrick",
                        "rating": 5,
                        "content": "My brother-in-law bought me a silver watch just like this a few years ago and it lasted me a long time! I decided I wanted to purchase the same watch but a different color. I love it because when I take a shower it doesn't act up. It can go in the shower with you and you can get cleaned up. Wash your hands. It doesn't mess with the digital at all. I trust it. I love the fact that it gives me the date and the time and the day of the day. The watch is very comfortable and The watch band is rubber. It doesn't even seem like I have it on. The price of the watch isn't bad either.",
                        "timestamp": "Reviewed in the United States August 11, 2024",
                        "profile_id": "AGLYVCCPSWMAAJCNYH2SYBONLZYQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Purple"
                    },
                    {
                        "id": "RMM7GYWY1QZ6H",
                        "title": "5.0 out of 5 stars Love this watch!",
                        "author": "sherrit",
                        "rating": 5,
                        "content": "I always wear a watch and my previous sports watch is no longer. This watch is so great! It fits my small wrist perfectly and has all the features I love: waterproof, light-up dial And the value for the money can't be beat! Highly recommend!!",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AHNRR4D6CXBARDSAWLOZVTYWNVFA",
                        "is_verified": true,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R1RUSDSR2RU3PZ",
                        "title": "5.0 out of 5 stars Can be easily seen out in the sunshine!",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I bought this watch because I could not see my smartwatch face in the bright sunshine at the beach or the pool. The time on this watch is large enough to see without my readers. I wish the strap was a little longer so that the \"tail\" of the strap doesn't pop out of the band, but I have a 7 1/2 inch wrist which is a little larger than some. Other than than, it's a great watch. I got complements on the pretty purple color, too!",
                        "timestamp": "Reviewed in the United States August 21, 2024",
                        "profile_id": "AEXGVHSX3ZMDTPDZUCBQLDGZI2DQ",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00Y2S944E",
                "product_name": "Armitron Sport Women's 45/7012PRSV Purple and Silver-Tone Digital Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:39:30",
            "updated_at": "2024-10-17 11:39:38",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252644391821514753",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=4",
                "asin": "B00Y2S944E",
                "page": 4,
                "pages": 615,
                "reviews": [
                    {
                        "id": "R18ZLE7LER0COH",
                        "title": "4.0 out of 5 stars Thin and simple with some color",
                        "author": "DG",
                        "rating": 4,
                        "content": "Personally I like the thin strap and smaller bezel even though I expected a bigger one. I'm pleasantly surprised with it and it goes with most things. Only gripe is that the button selection text is hard to read but with time, I'm sure like most people, I'll get used to what buttons do what and rarely have to read them anymore. Good purchase for the money.",
                        "timestamp": "Reviewed in the United States July 24, 2024",
                        "profile_id": "AH6PEUJFTDRPVQTZGVUM76RVESYQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Black/Iridescent Rainbow"
                    },
                    {
                        "id": "R1Z9FL0TSDG6D3",
                        "title": "5.0 out of 5 stars Simply and easy to use.",
                        "author": "Liana Kh",
                        "rating": 5,
                        "content": "It's exactly what I was looking, easy to use .",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AE73VGNFGJ6KJEXEYOBVY52YN5SQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3QTF1JI6Q8ZJE",
                        "title": "5.0 out of 5 stars Buen producto",
                        "author": "Lesley Ann Mangual",
                        "rating": 5,
                        "content": "Perfecto para lo que necesito. Color negro y tornasol",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AFCX7R5LLBGTUV5BHVTSM5KKCJEA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Iridescent Rainbow"
                    },
                    {
                        "id": "R1FIF155Q0PPTH",
                        "title": "5.0 out of 5 stars 15 year old Daughter Bought for Camp",
                        "author": "Erin Hammett",
                        "rating": 5,
                        "content": "My Daughter had to get a watch that did not have “smart watch” capabilities. So she bought this to wear all summer. The watch has help up for the 3 months she has had it and the white color has not stained even after constant wear.",
                        "timestamp": "Reviewed in the United States September 8, 2024",
                        "profile_id": "AF3SON3DIVQM5ZTLUFXUYFMZRHVQ",
                        "is_verified": true,
                        "product_attributes": "Color: White"
                    },
                    {
                        "id": "R30N2TFLS5GT5J",
                        "title": "5.0 out of 5 stars 5+ years and still a great watch",
                        "author": "Blossom",
                        "rating": 5,
                        "content": "The watch is lightweight, clear display, and works great for many years now.",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AFQENXKLK4JDDJFPAX64Y3QRYFOA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink/Silver"
                    },
                    {
                        "id": "RJ6XDWI02KF8J",
                        "title": "4.0 out of 5 stars It's a watch...",
                        "author": "Donna",
                        "rating": 4,
                        "content": "It's a ladies watch. The color is true to the image. It works. Nothing fancy. Silicone band",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AFSPSHJR7UGPQG67I5WGZB3QZDUA",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R2ZHFZ18GJVXB9",
                        "title": "5.0 out of 5 stars Shocked by its water resistance",
                        "author": "Garrett Waltz",
                        "rating": 5,
                        "content": "Suprised by the quality",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEJR5KJPS4K5V2REDVU575JSYP5A",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R3IC4E9YISSE9I",
                        "title": "5.0 out of 5 stars Nice!!",
                        "author": "Mona Mitchell",
                        "rating": 5,
                        "content": "The Watch is Beautiful. Very Happy with it.",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AHXKRCIMYE7SQK274QEMXKZS7QBA",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R226V2QNADCJU1",
                        "title": "4.0 out of 5 stars cute watch for small wrist",
                        "author": "Lauren, Calu",
                        "rating": 4,
                        "content": "Out of the box, I loved this watch. It was just what I was looking for. It is stylish and looks great on a small wrist. The problem was that I had to strain to see the time and date; it was NOT bold enough for me. If you have good vision or always wear your glasses, which I prefer not to do, it's a very nice watch. If it were not for that fact, I would have kept it.",
                        "timestamp": "Reviewed in the United States June 18, 2024",
                        "profile_id": "AHLQFF2P2UOONFPPK32RHR6G3UGA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: White/Rose Gold"
                    },
                    {
                        "id": "RVB9UAGS3JF6A",
                        "title": "5.0 out of 5 stars attractive",
                        "author": "Mary A. Lutz",
                        "rating": 5,
                        "content": "smaller and more attractive than some.",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AECD7OC2CBGZ73Y4MKTLCC2PVSMA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00Y2S944E",
                "product_name": "Armitron Sport Women's 45/7012PRSV Purple and Silver-Tone Digital Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:39:30",
            "updated_at": "2024-10-17 11:39:40",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252644391821514753",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=5",
                "asin": "B00Y2S944E",
                "page": 5,
                "pages": 615,
                "reviews": [
                    {
                        "id": "RWSL1ITSECCAV",
                        "title": "4.0 out of 5 stars an ok watch for errands",
                        "author": "Ox Lady",
                        "rating": 4,
                        "content": "it’s a good watch for the pool and for a quick out and about to the grocery store and picking up kids on time fo school",
                        "timestamp": "Reviewed in the United States July 28, 2024",
                        "profile_id": "AFNZOKQQ4RNEXA344DDLE65IG7DA",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R3FCV1G7IMR73J",
                        "title": "5.0 out of 5 stars I LOVE it. Checks all the boxes of what I was looking for",
                        "author": "B Mac",
                        "rating": 5,
                        "content": "I had a pretty long list of “requirements” and this was the ONLY one who met them all: - Stays on all the time (no need to lift your wrist or tap- Digital- small to medium size (suited for a woman’s wrist)- very large numbers- nothing else in the face - no heart rate, steps, etc. It’s fine if it has them, but I couldn’t find anything that showed only time in very large numbers- not ugly- bonus if there’s a light-up buttonAND THIS MADE ALL OF THEM.AND SO INEXPENSIVE!!! I was prepared to spend a lot of money to get what I wanted, too.The only thing is metal or more attentive bands are not an option. Trying to figure out if there are straps I can buy that will fit",
                        "timestamp": "Reviewed in the United States July 21, 2024",
                        "profile_id": "AEFCEJWMJZ4LLZANWRBF4HZCF5FQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "RK40LQRN7CWHL",
                        "title": "4.0 out of 5 stars Love the watch, but the band discolors",
                        "author": "Jared R Mullett",
                        "rating": 4,
                        "content": "I bought the tan/ rose gold color and while I love the size and such, take note that the band does discolor very quickly, it started 2 days in already.Also, while the face is rose gold, the clasp is silver, it doesn't bother me but it might some people.All that aside, great value for the money for a simple every day watch.",
                        "timestamp": "Reviewed in the United States June 11, 2024",
                        "profile_id": "AH6Y5I4G66OMFDWYLETG5OBOY7OQ",
                        "is_verified": true,
                        "product_attributes": "Color: Blush Pink/Rose Gold"
                    },
                    {
                        "id": "R2T747QRJQ036G",
                        "title": "5.0 out of 5 stars Water resistant!",
                        "author": "Megan jenkins",
                        "rating": 5,
                        "content": "One of my favorite watches actually. I bought a cheap one that I could wear while at the pool and water park with the kids. I was curious since I didn’t pay a lot for it if it really was “water resistant,” but pleasantly it works awesome. I have had it for a few weeks and it has been in the pool and shower with no problems at all. The instructions say do not operate IN the water so I don’t but the time stays up so there’s really no need anyway. Great purchase",
                        "timestamp": "Reviewed in the United States August 4, 2024",
                        "profile_id": "AECB2YKLP5XAKE33X4LYKNBUISBQ",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R2J405HHSYBKB7",
                        "title": "5.0 out of 5 stars Fantastic",
                        "author": "Christina Michelle Duechle",
                        "rating": 5,
                        "content": "Survived 1 month of heavy, underwater, sweaty, bug spray-ness with not even a scratch. 10/10. Plus the light pink is so cutesy",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AE7PPJNG5WFIZCZHQRYZVQBX265A",
                        "is_verified": true,
                        "product_attributes": "Color: Pink/Silver"
                    },
                    {
                        "id": "R28GF5L643UFB0",
                        "title": "4.0 out of 5 stars Band short life span",
                        "author": "Patty",
                        "rating": 4,
                        "content": "Love the watch, but the band will not last as long. No way to replace band.",
                        "timestamp": "Reviewed in the United States July 27, 2024",
                        "profile_id": "AFPXKMODO2J7WP3HWAUAHNVLMPOA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1EQUA7V1ZZQ0N",
                        "title": "3.0 out of 5 stars went rafting and it got too wet",
                        "author": "M. Tam",
                        "rating": 3,
                        "content": "i wash my hands for work a lot, and was hoping this little guy would last but after a white water rafting trip, it died. I give it 3 stars because i think it would have been fine if i didn't wear during rafting. What i do like about, it's is flatter on the wrist and isn't massive or obnoxious.",
                        "timestamp": "Reviewed in the United States October 3, 2024",
                        "profile_id": "AGC64METAD46AQHSABDE3SVMM6PQ",
                        "is_verified": true,
                        "product_attributes": "Color: Navy Blue"
                    },
                    {
                        "id": "R3ETR62YXUAGB1",
                        "title": "5.0 out of 5 stars Nice",
                        "author": "Dezz",
                        "rating": 5,
                        "content": "dainty not overly large. Very cute little watch! The strap will fit most wrists!",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AGES2KIKZQJQS3ODG3WYYIX7FTYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Purple/Silver"
                    },
                    {
                        "id": "R32KJVOACRQ1T8",
                        "title": "4.0 out of 5 stars Band scratches easily",
                        "author": "Mic O.",
                        "rating": 4,
                        "content": "Very slim. Love the watch, but band scratches easily.",
                        "timestamp": "Reviewed in the United States August 2, 2024",
                        "profile_id": "AFX2CIEURMW4GXNX5M5KRFIRFSAQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Silver"
                    },
                    {
                        "id": "R2P9245PY91MVR",
                        "title": "5.0 out of 5 stars Hard to fault",
                        "author": "ahw",
                        "rating": 5,
                        "content": "Very easy to read. This is second we have purchased. The first still worked but needed a new strap. after wearing out.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AEGCKDJK2YKEYCGMSYI4EBTNDCVQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B00Y2S944E",
                "product_name": "Armitron Sport Women's 45/7012PRSV Purple and Silver-Tone Digital Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:39:30",
            "updated_at": "2024-10-17 11:39:41",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B00Y2S944E?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252644391821514753",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:39:30",
        "domain": "com",
        "geo_location": null,
        "id": "7252644391821514753",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B00Y2S944E",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:39:41",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252644391821514753",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252644391821514753/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252644391821514753/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252644391821514753/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644391821514753/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}