{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0842QF6JD",
                "page": 1,
                "pages": 491,
                "reviews": [
                    {
                        "id": "R3IBB79KRZYZ6E",
                        "title": "5.0 out of 5 stars Great watch, great value",
                        "author": "Mike",
                        "rating": 5,
                        "content": "Nice watch. Feels well built. Good size and easy to use",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AEL7F2DZO7RNBITY5XQ65Z44GGPA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R3LTD8NE0JL6ZO",
                        "title": "5.0 out of 5 stars Perfect digital watch",
                        "author": "Scott",
                        "rating": 5,
                        "content": "Looks good and is nearly indestructibleUnfortunately they do get abused and look rough and paint comes off. This is probably the 5th one i have owned. If i didn't mind a beat up looking watch, I would probably still be wearing the first or second one i bought. Mind you, battery changes are still required.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AFIPCU2FZTVWOR7ZGZG4SX5F5EKQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    },
                    {
                        "id": "R1A4VU49TWE9JP",
                        "title": "5.0 out of 5 stars Great watch with well thought out features",
                        "author": "Dean",
                        "rating": 5,
                        "content": "I was looking for a sports watch that can also work great as a daily driver. Wouldn't even consider a G-Shocks, as I'm ex-military, and G-Shocks just remind me of the service. So... Ended up buying this little watch, and it really is much better than a G-Shock. Pros:1. The watch is 38 mm and fits perfectly on my 6.1\" wrist.2. Strap is comfortable.3. Legibility is great, large readable digits.4. Has 3 alarm clocks, each with a different tone.5. Lights keep working as long as you're pressing buttons. That means you can finish setting whatever you need, without needing to press for lights again. Lights turn off several seconds after last press.6. Buttons are large and comfortable.7. Helps me use my smartphone less, as I'm not reaching for it anymore to tell the time and set timers.8. Unused features can be completely turned off, so they don't clutter the interface.Cons-1. Alarm clock is pretty loud. But I'm a deep sleeper, and I don't completely trust it to wake me up. Maybe if I set all 3 alarms consecutively, it might wake me up.2. Rarely, the strap pinches my arm hair.3. The occasion mode is pretty useless now that we have smartphones (But can be completely turned off).Overall really impressed with this watch, all the features feel really well thought out. I would highly recommend buying.",
                        "timestamp": "Reviewed in the United States March 27, 2024",
                        "profile_id": "AHA3XSWDHILG66HOV7BWMSKJBBZA",
                        "is_verified": true,
                        "helpful_count": 26,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "RFUE0ITN1C9Y8",
                        "title": "4.0 out of 5 stars It takes a licking and keeps on ticking",
                        "author": "G. Berg",
                        "rating": 4,
                        "content": "I go through alot of watches in the last 30+ years. This one seems to be the best so far. The timer is a bit tricky so I stopped using it. The light to see in the dark needs improvement by illuminating the background rather than numbers, like the good ol days. Otherwise she's a good watch and reliable.",
                        "timestamp": "Reviewed in the United States June 26, 2024",
                        "profile_id": "AFLEFMOCMMIGRT7ADFEVQCBSOXVA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Black"
                    },
                    {
                        "id": "R9JAPCMT4PH7K",
                        "title": "5.0 out of 5 stars Best watch for the price.",
                        "author": "Joseph",
                        "rating": 5,
                        "content": "I absolutely love this watch. This is my second one over the last 15 years. It's looks decent on the wrist, not a big watch face and very lightweight. It's easy to read, using the buttons for run times is just a press of a button. Hit it again to get another lap or to stop it. The indigo light comes in handy at night to read the time. I'd also say it's very durable for the price. I literally beat watches up and this thing kept ticking for years and years. I only got a new once the watch band snapped.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AGX3TQ5MVAWAUEYHDEATRJSJNOQQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "R1BOI5WTZFMOYI",
                        "title": "5.0 out of 5 stars Uniquely impressive watch.",
                        "author": "Ian O. Smith",
                        "rating": 5,
                        "content": "Before I start my review of this Timex....A few words about Casio, because there are millions of Casio fans, many of whom won’t ever admit that any non-Casio product could ever be superior in any way to a Casio.Yes, Casio makes amazing watches (& other gadgets). I have owned several. Great company. Over the decades, the company has produced thousands of watches with remarkable features like address & appointment management, altimeter, barometer, games, moon & tide phases, GPS, compasses, atomic clock auto-setting, solar power, etc. Great products.But .... if you want one amazing sport watch, nothing beats this Timex model. It has features one simply does not find on any Casio or any other digital watch brand or model. It is the perfect balance of features and simplicity with durability and comfort.1) Major Comfort.This watch is amazingly comfortable for 5 reasons. It’s lightweight. The band is soft silicon, not hard plastic. The band has a contour, which matches your wrist curve. The band has a lot of holes, so you can get a perfect fit. The little “band keeper” loop actually locks into the excess band, so the keeper won’t slide around. Other sports watches have some combo of rigid plastic band, not enough holes, no locking band keeper.2) Customizable Features.What I mean by this is that you can “hide” features from the Mode scroll-through if you aren’t interested in one or more. Easy example: the watch has three alarms. I use just one. I don’t plan to use the other two. I don’t want to see the other two alarms as I go through the watch functions. So I set it so that I don’t even see alarms 2 & 3 when I scroll through. This is a unique feature. Almost no digital watches have it. It’s a great way to simplify your watch’s configurations, if you like.3) Ease of Setting.This watch is really intuitive to set (& to set up as I described immediately above). This is because it has 5 buttons and the screen itself shows you with labels how to “+” or “-“ the time when setting the time itself or an alarm. Amazingly straightforward. Absent on almost all other watches.4) The Features Themselves.Without discussing all aspects is this watch (stopwatch, countdown timer, water resistance, etc.), I’ll focus on two unique features. (A) The alarm is loud. Unless you are medicinally sedated or are sleeping really heavily after a 48-hour nonstop work session, it *will* wake you up.(B) The Indiglo light (a technology Timex introduced almost 30 years ago) is amazing for reading the display at night or in a dark room (Related: The size of the display is great too. Bold, crisp, large (even though the watch face itself is not enormous)).If you are undecided, I’d suggest reading this review and then watching a couple YouTube reviews. If you’re still on the fence, just buy the watch. You’ll love it. Can you get a durable & functional non-Timex for $20 or under? Yes. But go with this for the slightly higher price.",
                        "timestamp": "Reviewed in the United States January 31, 2021",
                        "profile_id": "AHJ7HBMRMDPRKCVNYWBV65MZ5JOQ",
                        "is_verified": true,
                        "helpful_count": 57,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R3JHJ0278NWL6X",
                        "title": "5.0 out of 5 stars Inexpensive watch with good capabilities.",
                        "author": "Bill",
                        "rating": 5,
                        "content": "Second one of these I owned, thoght I lost my original so ordered another just like it. Found my original so now I have two.I used this watch extensively years ago when I was an active runner. Found the watch easy to use for timing splits and total race times. Easy to read and operate. Watch band is durable.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AG7F3NESQSE2A5XQS7A7SFNIRCEA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R28AQAU4ZXQP1Q",
                        "title": "5.0 out of 5 stars Simply great",
                        "author": "Denny Knight",
                        "rating": 5,
                        "content": "Great design, easy to manipulate and durable, perfect for any active person.",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AEDBBPMPDLYHLQ4FO3XQX76KWELA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R1WYRQGQBBNSD0",
                        "title": "5.0 out of 5 stars Exactly like I remember it",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I had this exact watch as a teenager back in the early 2000’s, and I remember loving it. It was comfortable, easy to use, feature-packed, and able to take any of the (considerable) abuse a teenage boy could throw at it.Now I’m in my early thirties and looking for a watch after a long hiatus from regularly wearing one. I tried the Apple Watch for awhile, but I grew tired of having to charge it nightly, and the plethora of features packed into it tended to make it more difficult to use than necessary (your mileage may vary, of course). I wore the inexpensive, lightweight Casio F-91W for a while and mostly enjoyed it, but its quirks eventually made me decide to find something else. I decided to try the fancy (for me, anyway) Casio G-Shock GWM5610, and while I loved the features, I absolutely hated how difficult the buttons were to press. They’re recessed and very stiff, which would make my life difficult if I actually wanted to use the watch.Then I saw an old friend on Amazon: the Timex Ironman Classic 30. I had completely forgotten about it over the years, but I ordered it and it’s everything I remember. Comfier and easier to read than the Casios I’ve tried (I don’t know why Casio insists on small screens). Rugged. Feature-packed (3 alarms with differing ringtones, support for 3 time zones, nice Indiglo backlight, and a primitive occasion calendar I remember loving before I had a cell phone). These features are all intuitive to use, and they don’t get in the way. It fits like an old shoe, and I do believe my search for a watch is over.Don’t sleep on Timex, guys. Casio gets all the glory when it comes to digital watches, but Timex will treat you better.",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AEUH5OQCKGMTQAYQ7QPOEII4JF2Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R2CIW4L4BDWN7P",
                        "title": "4.0 out of 5 stars Can barely see time stamp.",
                        "author": "Kat",
                        "rating": 4,
                        "content": "I bought this thinking it had a bigger face and the “Indiglo blue” digital time would be easier to see (like the older versions of Ironman), but this was not the case. You can barely see the digital time stamp, and you have to actually push a button for the face to light up. Not practical for me as I am always working with patients and cannot reach over to push the “light up” button. My old Ironman had a movement sensor so when you rotated the watch to see the time, it would light up the indiglo automatically. So I decided to return this watch. There is nothing wrong with it, but it seems to be just a mediocre/lesser version of the once great Timex Ironman. The pictures show the watch in its lit up Iniglo blue state, but you must push a button and it barely stays lit before turning off again. And it does not light up as the pictures describe.No.Not for me.The face is good decent size. Im a girl but like the bigger sporty faces, but the only problem is that the strap is too big if you have smaller wrists. One can tighten it snug enough, but then you have considerable remaining length dangling beyond the band strap.I’m sure this watch is a good find for sone, but for me it was a return. And not to mention though- when you return this, they do not credit you right away, instead they take their time “receiving it and crediting your account- like to the tune of 3+ weeks.No thank you.",
                        "timestamp": "Reviewed in the United States August 16, 2024",
                        "profile_id": "AG5RUOF3VH6DMG4NSGP3QGXADZNA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0842QF6JD",
                "product_name": "Timex Men's Ironman Classic 30 38mm Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:40:26",
            "updated_at": "2024-10-17 11:40:36",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252644624370528257",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0842QF6JD",
                "page": 2,
                "pages": 491,
                "reviews": [
                    {
                        "id": "R23EUDVA7Z39SR",
                        "title": "5.0 out of 5 stars Old School Workhorse- Never Distracts- Never Interrupts- Just keeps Working",
                        "author": "Focus Fan",
                        "rating": 5,
                        "content": "Put it on and go to work, play, run a marathon, go to the opera, whatever you want. What ruins a smart watch is just a normal day for this watch. I have owned one for years because nothing better has been invented. If hard physical work or play is your thing, this is your time piece. Mine will get scratched, nicked, soaked and suffer from countless impacts but it just keeps working for years. It is water proof and the buttons are recessed enough to resist catching on things but are still easy to push. I wear out a lot of tools and equipment just by using tools for what they were designed to do. There is a reason this design became a classic and it all comes down to function. It just works.",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AGEZ7VPCKBUWTO6Y7SKWPZ2DAHHQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R3LHL2IHUBZCUV",
                        "title": "5.0 out of 5 stars 5 years life span more or less without battery change",
                        "author": "Traveler",
                        "rating": 5,
                        "content": "I have been buying this watch for years. It has 3 timers and a countdown clock. The watch has a glow light to see the time at night. The watch batter lasts at least 5 years and it is cheaper to buy a new watch.Caution : look at the date on the watch or box to see when that 5 years starts.",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AHPWTAPJEUW6CKSJSJRG4QWVTPFA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    },
                    {
                        "id": "R31KHVVE7G17KE",
                        "title": "5.0 out of 5 stars Works",
                        "author": "daltonknox",
                        "rating": 5,
                        "content": "I have the bad habit of smashing watches while skiing, so a $25 watch is essential. Having said that, Timex Marathons and Ironmen last better than some other plastic watches like Casios, and timekeeping of course is superb.",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AHJ6AJNZHFPT6MCDNYX3C633SSWA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R3BS7TSZZZITCE",
                        "title": "5.0 out of 5 stars TIMEX Tried & True!",
                        "author": "Shelley",
                        "rating": 5,
                        "content": "My husband has been wearing this style of Timex watches for years. Very inexpensive and last for years! He wears his watch working, fishing, hunting and all sorts of sports. It truly gets put to the test!",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AGCGMKCTQ57CZUKYG7CUOZY6BQMQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R28CVCFI9KALPP",
                        "title": "5.0 out of 5 stars Replaced on my husband lost",
                        "author": "C. Schmelebeck",
                        "rating": 5,
                        "content": "My husband likes what he likes and this watch is it. He does a lot of yard/tree work cutting and splitting logs. He rides a motorcycle and this watch takes a lickin’ and keeps on tickin’",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AFTKPF3WJALGIFZ5OL64GLCROBYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R43TEEQOFI84K",
                        "title": "5.0 out of 5 stars Huge plus - watch hasn’t changed",
                        "author": "David Van Wagoner",
                        "rating": 5,
                        "content": "I think the Iron Man Timex is the best watch they make. A lot of versatile, useful function and easy access to modify settings. Fortunately, the watch has not change design, I would say eight years or so, since I bought my last one. A huge plus",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AH2OL7U5SA5OQXBM6AFVG6E2BZ3A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R2CSC09JBOER8T",
                        "title": "5.0 out of 5 stars Takes a licking and keeps on ticking!",
                        "author": "Orville Glen Asman",
                        "rating": 5,
                        "content": "I’m used to a FitBit watch now. But for several years I used a watch like this. So when my FitBit crashed, I bought this one. I love the chronograph and the timer features and use them regularly. It’s water resistant and can be seen very well at night with Indiglo. Big numbers can be seen very well.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AFFMK4NQ4F73OF2RW7TEKVG6YD6A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Black"
                    },
                    {
                        "id": "R2YAV0KMYXGDG",
                        "title": "4.0 out of 5 stars Good Quality as usual",
                        "author": "Jack A.",
                        "rating": 4,
                        "content": "As a child I had a Timex watch very similar to this one, which died after I took it in water after replacing the battery. I recently decided to repurchase a watch and it works just as good as I remember. The only fault is the buttons are a bit more stiff and less responsive than I remember, I'm sure it just needs a little breaking in.",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AEHRMEZFIRM66I7ZPAV2EKBVBXMQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "R1HGMKWQZR9T3J",
                        "title": "5.0 out of 5 stars my first digital watch.",
                        "author": "isaac hernandez",
                        "rating": 5,
                        "content": "I'm pretty unfamiliar with watches. so I wanted a watch I could wear anywhere and not have to take off constantly. especially not wanting to take it off while swimming, or doing the dishes, showering etc. so I went with a more water resistant option. I love it.",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AG7AHJVMXLUMV6ZAP5HOZEOGN7BA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R1FSXAE7PX8828",
                        "title": "5.0 out of 5 stars Great value",
                        "author": "W.Michael Glynn",
                        "rating": 5,
                        "content": "It was more than I expected.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AG2NXRRLLOOGFFFLSGNSBZWKII4A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0842QF6JD",
                "product_name": "Timex Men's Ironman Classic 30 38mm Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:40:26",
            "updated_at": "2024-10-17 11:40:38",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252644624370528257",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0842QF6JD",
                "page": 3,
                "pages": 491,
                "reviews": [
                    {
                        "id": "R3VEEB3WUUQP2T",
                        "title": "5.0 out of 5 stars Solid, basic, affordable Timex product in the Ironman line",
                        "author": "Alfred Sternberg",
                        "rating": 5,
                        "content": "This watch replaces another of the same line of budget Timex I've had for four years, no battery change, still \"ticking,\" the only issue that the band finally wore out and it became an easy-to-lose \"pocket watch.\" No instructions came with it, but it works the same as the other one. Only new feature that I can tell is there is an additional lighting background feature.",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AFU2WNQD4L4NTA6I3BFNJ7ONH3XQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R1OV5I2A3J8354",
                        "title": "5.0 out of 5 stars Son loves it",
                        "author": "Gringita",
                        "rating": 5,
                        "content": "Bought this for my 12 year old son since he isn’t allowed his phone or a smart watch in class. He’s had it since school started and has no complaints.",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AH4EC66S5YSYSBEXK6IINCSVRPWQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R3BG6VXWPM84I2",
                        "title": "5.0 out of 5 stars Work",
                        "author": "A good watch)👍",
                        "rating": 5,
                        "content": "I use this watch for work, it is compact and convenient, I liked it. I recommend it",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AENVRTIT4PRP635MQJ7SNQAQRG6A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R1CKW5NVLJFGMO",
                        "title": "5.0 out of 5 stars Very accurate and reliable",
                        "author": "Gatorman",
                        "rating": 5,
                        "content": "I have owned a few Iron men watches and the are an excellent product for the price. I wear my Ironman when I hunt, fish and dress casual.",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AE4AFJNSTWCS74GAQ4F24M3IK2AQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    },
                    {
                        "id": "R30QCG9T2AI698",
                        "title": "4.0 out of 5 stars Nice",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Bought for son who is happy with this watch.",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AGACOYLK2GWN57QLPTMC2XVPSB6A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    },
                    {
                        "id": "REZQILN3XRFRY",
                        "title": "5.0 out of 5 stars Second delivery was perfect",
                        "author": "Kristine Nance",
                        "rating": 5,
                        "content": "The wrong watch arrived first. Amazon was very helpful with correcting my order. My husband loves his new watch. The return of the other watch was easy to complete.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AHXNZJFZIWSJ6OY4F3BODJT77IYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "RL11F0BLWS27R",
                        "title": "4.0 out of 5 stars What I like and don’t like…",
                        "author": "Old Hippie",
                        "rating": 4,
                        "content": "What I like… When something works for years, a person has a tendency to keep coming back even though the first one eventually wears out or breaks. Such is the case with this Timex Ironman watch. I honestly can’t remember – but I believe the first one lasted 10 + years. The only noticeable change I can see is a slightly different watch band. Also, toss in kudos to Amazon shipping who had it in a locker two days earlier than expected.What I don’t like… It seems that ever since the pandemic, everything has at least doubled in price – if not more. I can remember when places like CVS and Walgreens sold Timex watches for around $20.00. And you could get it the same day instead of waiting on shipping. Now, if you can find one locally, it’s priced much higher than Amazon. Insert sigh and rolling eyes here.",
                        "timestamp": "Reviewed in the United States June 8, 2024",
                        "profile_id": "AGDVQQRJC6P3KL3E3R2UK7FTUVPA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    },
                    {
                        "id": "R2XTWAEJVS8B32",
                        "title": "5.0 out of 5 stars Mejor de lo que esperaba",
                        "author": "Alejandro C.",
                        "rating": 5,
                        "content": "Tengo tres relojes que triplican el precio de este, al cabo de todo este tiempo se ha transformado en un reloj de uso diario, lo práctico de su legibilidad y la alarma que me hace ir al trabajo temprano. Muy cómodo.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AFV3LG4TL3XCR6244I77XANZCPRQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital/Green"
                    },
                    {
                        "id": "RX84RGFNY9OXH",
                        "title": "5.0 out of 5 stars Takes a licking, keeps on ticking",
                        "author": "Traveller",
                        "rating": 5,
                        "content": "Lightweight, face is not too big or bulky. Bought this for my son, but mine is years and years old. Biggest issue is the band will wear out long before the watch, and not easy to replace. Also, would be nice to have an hourly chime option.",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AG2E3R3KQWGKQMBAEQ7DMMR6VDAQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R3KQTQ38I4RG02",
                        "title": "5.0 out of 5 stars Works as advertised",
                        "author": "Dennis",
                        "rating": 5,
                        "content": "Takes a licking and keeps on ticking",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AFWS65XKO5ZRJQES7K3GL6CRGR5A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Blue"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0842QF6JD",
                "product_name": "Timex Men's Ironman Classic 30 38mm Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:40:26",
            "updated_at": "2024-10-17 11:40:39",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252644624370528257",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0842QF6JD",
                "page": 4,
                "pages": 491,
                "reviews": [
                    {
                        "id": "ROX0AD0TUSE8B",
                        "title": "5.0 out of 5 stars Improved Dayglo",
                        "author": "Toolooze",
                        "rating": 5,
                        "content": "First one didn't work, but received the replacement before I returned the broken one. I have worn these for several years. The band always breaks after 2-3 years, so I get a new one before the battery needs changing. The latest iteration has IMPROVED DAYGLO!!",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AHH75LX24NI3PLE46MDCNS7T2RHQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "RUKVV7TAHJICG",
                        "title": "5.0 out of 5 stars Excelente",
                        "author": "oscar corretjer",
                        "rating": 5,
                        "content": "Me gusta su durabilidad, resistencia y tamaño.Muy cómodo para portar.",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AEWF7YFK6FTSHUV64F2BF7W6XF2A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Blue"
                    },
                    {
                        "id": "R2SRYROQBWMZE3",
                        "title": "4.0 out of 5 stars Came W/O Instructions",
                        "author": "Naughty69",
                        "rating": 4,
                        "content": "I don't like how it came without instructions. I don't wanna have to go online to download the manual. The plasticky wrist strap is meh, not as comfortable as the chinese knock-off equivalents. And especially not as comfortable as the nylon/leather one's Timex used to have on ALL of their wrist watches. I much would prefer a nylon strap or a selection to pick from, esp. considering this $29 \"Lightning deal\" price.I do however like how the screen is recessed to protect it from scratches unlike the 50-cents cheaper Expedition model i had.",
                        "timestamp": "Reviewed in the United States July 12, 2024",
                        "profile_id": "AHY4IH4Z5SWLAD62HAXUVRHIG6ZA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "R1CFWM7JF51CQS",
                        "title": "5.0 out of 5 stars Just like the old days!",
                        "author": "Sergio B.",
                        "rating": 5,
                        "content": "I feel like back to the future here. This watch bring me amazing memories from a lot of training done in the 90’s and 00’ . I use for my track workouts and racing",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AH6NDN7T5ZI4435AZYVQNFNTGUBA",
                        "is_verified": true,
                        "product_attributes": "Color: Black, Gray"
                    },
                    {
                        "id": "R3L5QYT4LF90OV",
                        "title": "5.0 out of 5 stars Great watch for the money",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I ordered this watch at 0730 in the morning and it was delivered at 0915 the same morning. Can't beat that! I've had several of these Timex Ironman watches and they last a long time and have all of the features I need, at a great price. This model has a slightly narrower supple wrist strap which I like even better than their normal straps. The display is quite visible during the day and at night. Looking forward to years of use.",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AFXNO6MQZWRMQFKMCPDOY67CPMMQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R2HDKATRDFZ2OP",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "S. Chung",
                        "rating": 5,
                        "content": "My teenage kid loves this watch, has all the right features, is water resistant, and fits him just right.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AF4ZUNJ5QJTFIMVRTWRPE2SGE3TQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R1NHJQS0HRW83Y",
                        "title": "5.0 out of 5 stars Great Watch!",
                        "author": "Joe Rotzi",
                        "rating": 5,
                        "content": "Best watch ever, worth every dollar, bought it for my daughter, nice compliments at school, will buy one for myself.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AEB7AJYHQWSCRSTJXTK636NJSIBA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Black"
                    },
                    {
                        "id": "R1SN9PYYVS1K6Z",
                        "title": "5.0 out of 5 stars This watch is very good",
                        "author": "Ken Inukai",
                        "rating": 5,
                        "content": "This is my third Timex Ironman watch in 40 years. They are very sturdy. They are great",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AEYKMPPNTY33BMFGNC2AHBWCA6HQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R3MY5F79YU3T6P",
                        "title": "4.0 out of 5 stars Great watch!",
                        "author": "Amanda Winter",
                        "rating": 4,
                        "content": "Always happy with this brand of watch. I just wish it had come with the instructions",
                        "timestamp": "Reviewed in the United States August 20, 2024",
                        "profile_id": "AFFXEDIB564I6V7CQFC2QGL2I4DQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone"
                    },
                    {
                        "id": "R3MJP4BFJPXC4M",
                        "title": "4.0 out of 5 stars durability",
                        "author": "Earnest Construction",
                        "rating": 4,
                        "content": "I have only had this watch for about a month, so far it is holding up nice. light weight, somewhat smaller than standard watches, multiple functions, simple.",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AHBPCTACK7PXIVIPWHKMPHOYSJAQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0842QF6JD",
                "product_name": "Timex Men's Ironman Classic 30 38mm Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:40:26",
            "updated_at": "2024-10-17 11:40:40",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252644624370528257",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0842QF6JD",
                "page": 5,
                "pages": 491,
                "reviews": [
                    {
                        "id": "R3V74EF0LAMXIC",
                        "title": "5.0 out of 5 stars Almost 3 years, still runs fine",
                        "author": "Boogahboogah",
                        "rating": 5,
                        "content": "Have not water tested it, beyond the occasional arm soak or rain outside. Bought almost 3 years ago, runs fine. Timer operation is a little hard to deal with but that is about the only negative I have.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AHW4XJF6U2MS7PX66DYF54DX43FA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital/Green"
                    },
                    {
                        "id": "R2O252TYQUWSYB",
                        "title": "5.0 out of 5 stars Had to replace my other Timex Iron Man of 30 years",
                        "author": "Fred",
                        "rating": 5,
                        "content": "These watches do what they’re supposed to give you correct time. It also helps to be pretty much waterproof because I do swim with mine in the lake all the time. My last one lasted me 30 years and I almost cried when it finally just kind of rotted off my wrist, so I bought a new one and this one here looks as nice as the other one did. And I don’t think I’ve got 30 years left so this will probably be the last watch I’ll ever have to buy.",
                        "timestamp": "Reviewed in the United States August 1, 2024",
                        "profile_id": "AGII3P25U4DYN3HIPHPFLXFCKXAQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R174TY55TB1G4L",
                        "title": "4.0 out of 5 stars good reliable watch",
                        "author": "reader",
                        "rating": 4,
                        "content": "I have bought this watch numerous times over many many years. I keep coming back to it because it is durable and reliable and reasonable in price.",
                        "timestamp": "Reviewed in the United States August 3, 2024",
                        "profile_id": "AFT4MFWKJFSNW6OLWK5WBRJKJZSQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "RW4KKRMK5DUU2",
                        "title": "5.0 out of 5 stars Good time piece but",
                        "author": "Roi Rat",
                        "rating": 5,
                        "content": "Face is hard to read when driving. Cotter pin holding buckle of strap released once while taking off using minimal pressure. I put back in but it is too small and flimsey a pin for this application.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AERT6NRONRGIQRZTJW24VB5EUSBQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "RKDCWTWKHB51C",
                        "title": "4.0 out of 5 stars A Great Watch when done the right way.",
                        "author": "Demon",
                        "rating": 4,
                        "content": "I love the watch it is great. The only thing I didn't like is that the watch band came off the night of the day I got it. It was not easy to fix the watchband back on. The problem was not the watch itself it was where where the holes where the spring is supposed to go. One hole was not the right size compared to the other hole so I had take my small little flathead screwdriver and make the hole a little bigger so finally the other spring would finally fit in the right way. All it all I love the watch but I didn't like that I had to fix the watch just to finally get the watch band nice and secure finally. I don't blame the seller for this. The company that made the watch should have it inspected and made sure that the watch band doesn't come off at all when putting the spring in.",
                        "timestamp": "Reviewed in the United States April 22, 2024",
                        "profile_id": "AHMFAMIJPTXFJ7C27N6PWI56MGMA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "R95I91HWB5AX3",
                        "title": "4.0 out of 5 stars Does as intended",
                        "author": "Imblessed",
                        "rating": 4,
                        "content": "Got this for my 16yo son, who had his phone taken away this semester because of grades. He plays bball and goes to the court, so he needed a watch to know what time to be home. He chose the “black/gray/negative” colored one. He says it’s “Ok, does the job.” Lol. I’m sure he wishes he had his phone instead! Anyway, the backlight is kind of a joke; it’s not bright but gets the job done. It fit my skinny 105lb kid’s wrist just fine. Instructions are not included in the pamphlet which is annoying. You have to go to timex.com which I did but couldn’t find the set up instructions. I googled/watched you tube video on how to set up Timex model #xxxxx and all was well. It was pretty easy. It’s a watch what can I say? I just need it to tell time so my son doesn’t find himself in more trouble.",
                        "timestamp": "Reviewed in the United States April 24, 2024",
                        "profile_id": "AHR7ODUJESMBB2DPUKIDP6GDOS2Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Negative Digital/Gray"
                    },
                    {
                        "id": "R2NVSWJIUGLEG",
                        "title": "5.0 out of 5 stars That it's a timex watch.",
                        "author": "Lee",
                        "rating": 5,
                        "content": "To keep time.",
                        "timestamp": "Reviewed in the United States September 16, 2024",
                        "profile_id": "AHLHFI2IY4R6GLRJJYGG4E2OWBHQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Black"
                    },
                    {
                        "id": "R1YKJ62752GENS",
                        "title": "5.0 out of 5 stars Good watch",
                        "author": "Darby Wilson",
                        "rating": 5,
                        "content": "Durable and a good buy.",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AHPH25AYAXM4QKBRNFI7GF7PRULQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black, Gray"
                    },
                    {
                        "id": "R3T20QO7MRXA0Y",
                        "title": "3.0 out of 5 stars Too many inscrutable bells & whistles for my taste",
                        "author": "Jack C",
                        "rating": 3,
                        "content": "Primarily got the watch because it was one I could read the time from without resorting to donning my reading glasses. Nonintuitive (to me) setting procedures. Functions I will never use and seem to get in the way. While working on something that involves contact with my arm, the displayed function will change and I have a devil of a time getting it back to the basic time display. Probably a lot of good features here, but they are lost on me. If you are in need of a multi-function time piece, this may be your ticket. I just couldn't recommend it as a \"basic teller of time.\"",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AH3LKJEZHAB3RLLETVR2UNWBNUXQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Gray"
                    },
                    {
                        "id": "R34IJPDZFKX0X9",
                        "title": "5.0 out of 5 stars Great Watch",
                        "author": "GregSyl",
                        "rating": 5,
                        "content": "Ive bought this watch time after time. I tend to break (abuse) or loose my watch every 4-5 years and before the battery is drained.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AGV2ZWS5LVPPZQARHCBZIGT6XE3A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Digital Gray/Silver-Tone/Orange"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0842QF6JD",
                "product_name": "Timex Men's Ironman Classic 30 38mm Watch",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:40:26",
            "updated_at": "2024-10-17 11:40:43",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0842QF6JD?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252644624370528257",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:40:26",
        "domain": "com",
        "geo_location": null,
        "id": "7252644624370528257",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0842QF6JD",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:40:43",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252644624370528257",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252644624370528257/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252644624370528257/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252644624370528257/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252644624370528257/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}