{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=1",
                "asin": "B08VMTXZP1",
                "page": 1,
                "pages": 390,
                "reviews": [
                    {
                        "id": "R19TIEKYBBOIHU",
                        "title": "5.0 out of 5 stars Very nice, GIANT display! Best model I’ve seen in the price-range.",
                        "author": "Dru Ha",
                        "rating": 5,
                        "content": "I have used my cell phone instead of a watch since about 2001. Decided to start wearing cheap, quartz watches again because I often find myself without my cell phone within reach at rehearsals, recording sessions, lawn-mowing, or work from home situations. Picked up a few Timexes and Casios around the same time. So far, I like this model the best for general use. The size of the time display is so easy to read that I have already started preferring it to comparable analog models. I will mostly be looking to buy digital watches like this with big, simple displays from now on.I’m not James Bond, in spite of what you may have heard. I don’t want an expensive watch on my wrist that might make me a potential target for theft/robbery downtown or on a subway. If I get some paint on this one or it breaks while I’m trying to remove an oil filter, it would be no great loss.Use is fairly intuitive and it hasn’t lost or gained time in the few weeks I’ve owned it, unlike a Timex expedition analog model I got at the same time. After only a couple of weeks, the analog Timex expedition has lost about ten seconds already, which I admit I was surprised by.The only complaint I could possibly make about this watch is that the two LED’s are quite poor in comparison to Timex’s indiglo or the backlight used on much more expensive G-Shock models. But for how cheap and functional this model is, that is a completely unfair comparison. The lights work perfectly fine for me to see if I wake up in the middle of the night but can’t roll/reach over to check my phone due to a sleeping dog contorting my legs at the foot of the bed. Or if I fall asleep on the couch.I have mostly avoided getting it wet up until now, but I did accidentally leave it in the bathroom with the shower running a couple of times and no condensation formed on the inside of the face at all even though there was plenty of water vapor in the room. I also leave it on when washing my hands with no ill-effects.I’m very impressed by how simple and functional this watch is. These cheap, digitals are light years ahead of the Timex Ironman I owned as a kid. But it should be said- that $25-$35 Ironman I bought sometime around 1995 went body boarding, surfing, in the pool with me, and I showered with it on. That thing was basically water-PROOF and never had an issue in water less than 20ft. deep. I swam in Atlantic/East-Coast hurricanes with that thing and it even got tossed around in the salty surf with me. Also used it to time lap-swimming in Olympic-sized pools. I do not have the same confidence in this model, though I have no real rationale for that.The rubber strap was very uncomfortable on the old Ironman models and used to cause some really annoying, visible, skin irritation. I found G-shock straps of that era to be almost just as bad. That is not the case with these modern Casio polymer straps.I also despise those weird circles Casio, Armitron, etc. put on watch faces and take up a quarter of the face of the watch. This watch has NONE of that BS going on. The info on the watch face is SO bold and easy to read that I would definitely prefer it to all the G-shocks with those damned, senseless circles taking up so much of the display. PV cells excluded because they actually do serve a purpose. But here’s my view on all that: if the watch battery lasts even close to ten years, it will already outlast the battery/operation of the solar-powered, $150 G-Shock I once owned by a factor of YEARS. So I would still prefer this because legibility is far more important to me than photovoltaics.After a few weeks getting used to wearing a watch again for the first time in twenty years, I’ve really appreciated not having to dig my cell phone out of my pocket just to check the time/date. A weirdly subtle difference I would never have thought would matter. But it does. I’m starting to really like Casios!I also like the hourly chime because otherwise I get lost and completely lose track of time while recording/producing. That could only backfire if the chime goes off in the vocal booth and ruins a take. Hasn’t happened yet, though.I’m also glad they make it in the desert-sand/beige color because I’m fair skinned so it doesn’t look like a giant thing on my wrist.At some point or other I will wake up exhausted and forget to take it off before I get in the shower. At that point I will update this review if water penetrates the buttons/gaskets/seals.Again, I am in disbelief at how excellent this watch is for the price. I hope they never discontinue this model until an identical “20 Year Battery” model is available. But by then we’ll no doubt have flying cars, rocket-skates, jet packs, and digital, tattooed watches with veinous, indiglo epidermis. Or more than the current, standard-issue, two to three computer chips implanted into in our visual cortex at birth.Just pick the color you like and buy the damned thing!",
                        "timestamp": "Reviewed in the United States July 30, 2023",
                        "profile_id": "AFUR62MXQUALQJX5LDFW3KOQBQLA",
                        "is_verified": true,
                        "helpful_count": 111,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R2870W8UVH639J",
                        "title": "5.0 out of 5 stars Best Casio Digital Watch for Aging Eyes",
                        "author": "JRC",
                        "rating": 5,
                        "content": "This is a great digital watch with a very large and easy to read display.It’s a Casio, so you know that it’s rugged and reliable.In fact, it keeps better time than watches costing thousands of dollars.The watch isn’t big on features but I really only need it for telling time .It has an outstanding price too and since it’s a Casio I expect that it will provide many years of excellent service.I have several at her Casio watches including expensive G-Shock models.The G’s are cool and they look great but I really don’t need all of their features.Also, those big watches can be heavy and cumbersome on your wrist.Plus, this is the easiest to read Casio I have ever seen.If I could only have a single Casio watch, this is the one I’d pick.Highly, highly recommended .",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AEZA77SUMX7WVAI7HTK35PJLZB3Q",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Color: GreenSize: Extra Long"
                    },
                    {
                        "id": "R3QR89DFHA5E81",
                        "title": "5.0 out of 5 stars Stylish tactical watch at an unbeatable price!",
                        "author": "Lissy",
                        "rating": 5,
                        "content": "I like watches. I have an Apple Watch and another stainless steel “dress” watch.I wanted a watch I could wear when working out, or doing something physical that wasn’t going to buzz at me every 8 seconds and tell me what a good boy I was for taking 5 steps and remind me to breathe.Also, I think Apple Watches are great, but they’re a little bloated with useless features that, at the end of the day, I’ve never really used.I wanted something simple, easy to read, and able to take a beating. I wanted basic tactical features (like dual time zones, stop watch, alarms, timer, a clear second display, a light)This watch is easily comparable to the “G-Shock”.Not only does it do everything I want it to do, it looks incredible. It’s very stylish. Very clear, easy to read display at a glance and it fits great (I’m a guy, 5’7” with a small wrist circumference and got the “standard” size)I’ve tested the display light in the dark and it works great. Easily readable.Build quality seems excellent. Seems to be sturdy and durable. Doesn’t feel or look cheap by any means.Haven’t tested the water resistance yet but I don’t doubt it’s going to be fine.And finally, the price. The price is unbelievable for what you get. For the $20-25 price point you get way more features and value than you’d expect.Highly recommend!",
                        "timestamp": "Reviewed in the United States September 13, 2024",
                        "profile_id": "AGTT5LTTI3LIWA7JZ7IRJPH3BLRQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "RS02UCNGBOPTK",
                        "title": "4.0 out of 5 stars Great watch, great price, great color, one flaw",
                        "author": "Jeremy",
                        "rating": 4,
                        "content": "I love Casio watches. They are tough, a good value and easy to read. I have had a few over the years. The battery life is ridiculously long. I have never had one die. The band is usually the first to go. I like this model because the band is made of a much stronger composite. However, the buckle is made of…. plastic. Why? Every other Casio I have owned had a metal buckle. Once the holes wear out that the pin sits in, it will pop off when horizontal pressure is applied. This is a high contact point on a watch so making out of plastic was not a good idea.",
                        "timestamp": "Reviewed in the United States June 12, 2024",
                        "profile_id": "AETV5XCHA4VVNOFDSGAWFLM23LTQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R1NFS5J12ZXDJ8",
                        "title": "5.0 out of 5 stars the ultimate watch 👍👍",
                        "author": "Johnny Tezz",
                        "rating": 5,
                        "content": "The media could not be loaded. It is a watch suitable for all types of terrain because it has a great design, it is economical and its performance is all you need on your day. I think it's a great watch, its quality is more than obvious, it's well assembled, the parts are perfectly well adjusted in their place, you can feel a good feedback when pressing its 4 buttons because they are firm and fast-acting, the back cover is made of steel stainless steel is fixed by four screws, the overall construction of the watch (case/strap and buckle) is made of a soft and resistant resin, the fit on your wrist is perfect since the weight of the watch is absurd, you don't even notice its presence, the acrylic glass commonly used in digital watches but from my perspective it is a tug of war because although it is very easy to scratch (just cleaning it roughly 😂) it is also resistant to impacts because it has greater flexibility and that Helps reduce breakage with a heavy accidental bump, at the end of the day scratches on glass are inherent and speak of rough use than a bit of glass polishing paste (the one that e is your preference) and a cloth will remove most of the scratches The design of the dial is quite clean and extremely clear, because it shows you enough, a quick glance and that's it. The information is displayed in digital format, all with good balance, in the upper left part the day is written in abbreviated form, then the month and finally the date, in the central part is the time in large Arabic numerals marked and solid ( for an excellent reading) it has the option of 24-hour format for what military time usually uses and finally at the bottom the seconds which in turn have a kind of excellent animation on the right side of the clock I like the detail for to be honest . The watch is large, robust, too masculine and clearly resistant (IT'S A CASIO!!) It is made to be a tool in its entirety, its functions are the most basic, such as a stopwatch, 5 alarms and a double time zone, not to mention that brings with it a battery that feeds a simple low-consumption module that has a 10-year battery life, it is easier for you to buy another watch over time than to run out of battery 😅Personally, since I unpacked it and adjusted it on my wrist, I haven't removed it at all (except taking a shower of course 😂) Well, its useful life begins as a tool in my day-to-day life due to its strength and its great versatility. I don't have to worry about any accidental bumps or scratches (I dedicate myself to engineering, so you can imagine...😄😅) It has a noticeable and substantial resistance. It is a simple watch with enough testosterone to withstand your work. Its tactical and robust design gives you the message that it can withstand everything that you put it in the way, something to highlight is the hermetic resistance of 10 bars (I can have a dip in the lake and it will not drown, I am more than sure of that 😅😉) it is more than enough for the use that I can give it. Until now, in my personal opinion, I consider (you should understand this carefully....because I don't have much experience in the matter, I'm just a guy who wears a Longines watch with a mechanical movement most of the time, that until today I timed my life 😅) I have the perception that my Casio watch is very precise, the manufacturer mentions an accuracy of -+30 Seconds per month, I consider that from time to time I will have to visit an atomic clock on the internet and reset the seconds and minutes on my watch, so I will have the exact march again. I think that for a simple watch that Casio factory has a good design in terms of versatility because for its large size it looks good, sometimes I have to wear a sports jacket for the occasion and Casio continues to give Rock & Roll to my inexperienced eyes looks very masculine and sober I chose the negative version for a couple of reasons, one of them is that it gives it a more minimalist and conservative touch, the large and robust design of the watch already captures attention, I don't want to give it more unnecessary decorations, something that surprised me a lot It was the fact that in daylight the reading is so clear and forceful without a doubt CASIO did a good job on the screen. In short , it is a watch that every working man should wear in his day to day due to its design , strength , precision and its affordable price .",
                        "timestamp": "Reviewed in the United States February 13, 2023",
                        "profile_id": "AHDQFHM3OEDPQXGGWAK63IEP4PHA",
                        "is_verified": true,
                        "helpful_count": 113,
                        "product_attributes": "Color: GraySize: Standard"
                    },
                    {
                        "id": "R9UAX14V0JWWQ",
                        "title": "5.0 out of 5 stars Best for this money!",
                        "author": "Good",
                        "rating": 5,
                        "content": "Impressive watch! He have all what you need in daily using! 2 timezones clock, 2 timers, 5 alarms, highlight, data displays. Cool design, waterproof and 10 years battery! Its best for those, who need watch how watch!",
                        "timestamp": "Reviewed in the United States September 11, 2024",
                        "profile_id": "AE6DUPVZUXGRQ4GYZJUBAWFF2J2Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GreenSize: Extra Long"
                    },
                    {
                        "id": "R3G117BMPCN4QS",
                        "title": "5.0 out of 5 stars Affordable, Great Design & Quality",
                        "author": "John Mark",
                        "rating": 5,
                        "content": "Love this Watch ! Large numbers+ month, date & day all easy to see at a glance. Lighter than a G-Shock & solid build. Impressive. Very happy.",
                        "timestamp": "Reviewed in the United States August 24, 2024",
                        "profile_id": "AHYCCRAGL62S5OADVOCZNQBBUDAQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R1OI8FBM00ZMOR",
                        "title": "5.0 out of 5 stars Wanted something to take a break from my smart watch",
                        "author": "zachary smith",
                        "rating": 5,
                        "content": "I was getting exhausted constantly getting barraged by notifications all day. I love my apple watch but I wanted something I didn't have to worry about recharging, especially for camping and such. It's also nice to be able to leave my phone behind and escape the never ending onslaught of people trying to get ahold of me.That being said, this watch is awesome. It is light, and comfy to wear. I didn't even use the instructions to set it up. It is just nice and simple and intuitive. Coming from a smart watch that I would wear all the time, I genuinely forget that I have this one on sometimes. And it's affordable?! Don't mind if I do! I will probably come back and grab a few more colors in the not too distant future.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AEL3W6LS2WKK4RPVN3M5HMBLOSEA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R72L8XKXECOHG",
                        "title": "5.0 out of 5 stars A watch you can see across the room.",
                        "author": "M. Gil",
                        "rating": 5,
                        "content": "If you need to see the time quickly the 1500 is the perfect watch. If you leave your watch across the room you can see it across the room. I saw this guy on YouTube to see how fast he could see the time with this watch. I was very impressed. Casio recently came out with the GD010 but that’s a gshock with a $100 price. The 1500 cost about $22 has most of the functions including the big numbers. I don’t wear the same watch every day but this watch is high on my rotation list. I don’t trash my watches at all. Most look like new. But if something tragic happens to it I’ll buy another copy. It’s perfect to give as a gift. It’s very easy to set up, no recessed adjust button like the square g shock. One of my favorite functions is the countdown function. It’s perfect when watching flag football or a soccer match. Almost forgot to say that I have the positive display. I’ve seen the negative display it looks like the MIP display. I personal copy is the black version. But I recently bought the blue copy as a gift. Next time I got $20 to burn I’ll buy the sand color.",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AFTYUCVNAOINN3MYTWOYIGJIV6IA",
                        "is_verified": true,
                        "product_attributes": "Color: BlueSize: Standard"
                    },
                    {
                        "id": "R1DAD67ANI9148",
                        "title": "5.0 out of 5 stars You MUST get one of these...",
                        "author": "Timothy Douglas",
                        "rating": 5,
                        "content": "I'm a watch guy. 30+ in my collection.Of them ALL, this is BY FAR the clearest, crispest and best display on ANY of them and all for $22 or so.While a larger sized watch, it wears SOOO well.And the functions? Hmmmm, let's see.10-year battery5 alarms (including a snooze-able alarm as well as day/month/year specific alarm)CRYSTAL clear displayTHE BEST illumination on ANY watch I have ever seen6 choices of colors (including 2 with extra-long bands if needed)All for $22? You will NOT go wrong with this one. Like a Pringle's potato chip, you can't have just one.If you are looking for a G-Shock version, take a look at the GD-010 also available in multiple colors. This is one of the next ones on my list.I told my 30-year old son about it and HE bought one. He is just as impressed with it as I am.Thank you, Casio.",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AE73EHXEMKE3K2SMP5FVQB2EEAJA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B08VMTXZP1",
                "product_name": "Casio Casual Watch AE-1500WH-5AVCF",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:13:15",
            "updated_at": "2024-10-17 11:13:20",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252637784429570049",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=2",
                "asin": "B08VMTXZP1",
                "page": 2,
                "pages": 390,
                "reviews": [
                    {
                        "id": "R614G5IWYHKQX",
                        "title": "5.0 out of 5 stars I underestimated this watch, I couldn't have been more wrong.",
                        "author": "Germán Augusto Level Mora",
                        "rating": 5,
                        "content": "In many reviews they talk about how big the watch is, for me it is perfect, yes it has a big screen and it is easy to see and use. I chose the “Tan” color, it is like sand but a little darker and it looks amazing, much better than in the photos, the strap fits well and doesn’t bother, I can wear the watch all day without noticing, I could look for bad things about the watch but they would be details, for 20 dollars a Casio watch, 10 year battery and a great design I can’t ask for more. I will probably buy another one with a black screen. 100% recommended!",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AHILFFSJ4E7IMM6EK2547U3PIIOA",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R16XKRGCMAT12W",
                        "title": "5.0 out of 5 stars Does the Job Superbly, no nonsense",
                        "author": "Satisfied Customer",
                        "rating": 5,
                        "content": "This watch at its price point is unbelievable. It does the job, which is to rely you the time, really large digits and date. I had a Casio GShock that costs $150 more but it fails the test in doing its job, it tells the time yes but it is cumbersome with the display.This Casio has a 10 year battery life, excellent chime and easy to use light function at night.I would recommend this watch to anyone that just wants to see the time and nothing else but in a nice way.",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AFGWNSDDDGCM2KUVOC5S45UCNAWA",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R3JY5MIU2B7GKS",
                        "title": "5.0 out of 5 stars 10 year battery!",
                        "author": "Fred N",
                        "rating": 5,
                        "content": "Best bargain I have purchased for a watch. The display is crisp and very legible, and have no trouble clearly seeing the time even without wearing my eyeglasses. I like the light weight and find it very comfortable to wear. The 10 year battery for a $20 watch is phenomenal. I do find the alarm to be very low volume, and would not depend on it, especially to wake me up, but my old ears may not hear as well as they once had. However, the most important thing is I can easily read the screen, eyeglasses or not. This watch is worth every cent to me.The watch is very simple to set up and adjust the time and date.If anyone has a bit of trouble with this watch there are a few YouTube video tutorials that will have you up and running in minutes. Best bargain since my Casio Duro watches...",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AG5MSMYNSZ67I2UHSFTQ2UVM27RA",
                        "is_verified": true,
                        "product_attributes": "Color: GreenSize: Extra Long"
                    },
                    {
                        "id": "R3K8HC67K73D0C",
                        "title": "5.0 out of 5 stars Outstanding Cheap Watch for $20!",
                        "author": "Brandon Valus",
                        "rating": 5,
                        "content": "Needed an all black digital watch with a timer that could handle quite a lot of daily abuse. This watch has taken quite a bit of abuse (hard hits, under water for hours, ocean water, pool water, hot tub water, snagged on everything, harsh chemicals, hit and bumped on mechanical parts, scratched, flames licking it and extreme heat, etc) and still keeps on going. Unfortunately, after 24 months (2 years), the band finally broke. The watch is still working but it won’t stay on my wrist. I guess I could try to find a band for it, but the watch is $20 on Amazon so I’m just going to buy another one. Basically boils down to $10/year or less than a dollar per month…not a bad purchase at all.Cons:The watch slows down pretty fast. I usually have to re-sync the time every month, as it’s about 30-45 seconds behind. I’ve just been doing it twice a month now when I see it’s about 10-15 seconds behind actual time. Not a big deal for a cheap watch, but could be frustrating to some. It isn’t the ultimate timepiece by any means.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AG6EARCU5S4OE6DSXQT5C663NGDQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R33YPGYLM70VHJ",
                        "title": "5.0 out of 5 stars Great size watch worth the price",
                        "author": "Hector C",
                        "rating": 5,
                        "content": "Needed a cheaper watch for work since I was using my gshock. I dig through wires harnesses and paint so didn’t want to damage my more expensive watch. So I saw this one for $22 on prime day, and now I don’t want to damage it because I like it so much. lol. I recommend if you’re not trying buy an expensive gshock watch. Looks great same brand Casio. Cheaper price.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AHGAXHHE2KCO7REABUFKLDM7LMEQ",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "R1U2ZRSEISN04F",
                        "title": "5.0 out of 5 stars Holy cow this thing is HUGE!!",
                        "author": "Gore",
                        "rating": 5,
                        "content": "I didn't bother reading the product' description very well if at all because I figured it's a budget Casio watch, what could go wrong? Apparently nothing at all! This watch is HUGE and this is coming from someone that's owned several G-Shocks over the years.First impression other than gargantuan size? Well my first few minutes with the watch I was left scratching my head because for the life of me I couldn't figure out (and still can't) how this watch is selling for what it's selling for. For the past couple of years I've unfortunately grown accustomed to paying for things that have skyrocketed in price, whether it's a carton of eggs, toner for my printer, and everything else one needs to get along in this life. This watch looks and feels like my more expensive G-shocks which comes with price tags well into the hundreds. But back to my first impression... If you're at all familiar with Casio watches this one will function like all their other watches (as far as navigating menus, making adjustments etc) and it feels vey intuitive to use. It was literally no big deal to adjust the alarms, date and time without having to refer to the manual. Also, the size of the font for the time is also quite large and very easy to read and though the day and date isn't quite as big they're still very easy to read.My only gripes? I have 2 but they're very minor...I ordered the white model and the watch isn't exactly white, it's more of an extremely light beige. It's easily noticeable when put next to something that's actually white which you can see in the last of the included pics. In that picture both the keyboard and mouse are white but they're more of an eggshell white and they have a matte finish. The desktop is also white white with a glossy finish. Clearly you can yes the color discrepancy. The other gripe? The light that illuminated the face isn't all that bright. On the white that I chose the face is black and the letters and digits are negative, or not colored at all so maybe the black face affects the intensity of the lights? I don't know but either way neither of my gripes are deal breakers and overall I'm very happy with this buy. As far the pics go. the first of this way next to my G-shock G-101 (which is years old but has recently received a new bezel). The second is the measurement of the outer edge of the bezel for the G-101. The third is the measurement of the outer edge of the bezel for this watch... More than a 7mm difference (that's more than a 1/4\" for the folks that still don't use the meter system lol). The G-101 was (and is) a big watch comparatively speaking but this new one is on steroids!",
                        "timestamp": "Reviewed in the United States May 4, 2024",
                        "profile_id": "AGFO2OFW3EERYWARRMBENISDVE3Q",
                        "is_verified": true,
                        "helpful_count": 23,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "R3INJY7LOBNHCA",
                        "title": "5.0 out of 5 stars Solid work watch",
                        "author": "TheBronze",
                        "rating": 5,
                        "content": "I've been wearing this little gem for a year now. I used to wear G-Shocks but Casio refuses to make a display with larger numbers. As I get older I don't want to have to put on my glasses just to look at my watch! So I found this one and the number size is perfect. It's not a G-Shock but it's still very very rugged. The menu is super simple and it is mostly devoid of the silly little blinking things on the display. It does have a ten second indicator that counts down along its side. Completely useless but at least it stays out of the way. When will Casio get it? Anyway, this watch is rugged and large but wears easy on the wrist. I reset it every few months but it's never been more than ten seconds off. For the price you simply can't beat this thing.",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AGOYVHLGBIZAJCKF254NJTO2WHUQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R3DBBQLMIETJ1A",
                        "title": "5.0 out of 5 stars It is what it is...",
                        "author": "Raphael Sekine",
                        "rating": 5,
                        "content": "I'm an old fashion guy...I don't need a smartwatch...It's simple, good looking and it does what it was suppose to do...With the bennefit of having a lot of features that a care about (alarm, ST and timer)...The battery life spam is fenomenal...So light that I even feel it my wrist;Looks like it going to outlive me for the quality of construction...The LED light is orange and not so bright, but it gets the job done...It can take the pool, rain, shower...A lot of bang for your buck...For $20 or so bucks, you can't go wrong...",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AHAX5ARSHYDLAN2LR64R3274O2JQ",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "R8VWOBLV8MVGG",
                        "title": "5.0 out of 5 stars No need to worry",
                        "author": "TheAlf",
                        "rating": 5,
                        "content": "So, I have little minchkin wrists and I was a little skeptical that this thing would look decent on my arm. Turns out it looks great. It IS a big display but fits nicely. Not 100% sure the display I picked is going to the right one for me. I got the darker background. It’s a little hard to read but not bad. It’s light. Super light but feels like quality. Band feels nice. Can’t image why you would pony up for the more expensive G Shock. Overall, a super purchase.",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AFBPT7AMGDV2WSN5DJXTEXUO3I7A",
                        "is_verified": true,
                        "product_attributes": "Color: GraySize: Standard"
                    },
                    {
                        "id": "R33OH6LV70R3WL",
                        "title": "5.0 out of 5 stars recommended",
                        "author": "Bibers Violin",
                        "rating": 5,
                        "content": "I love this watch so much. exactly as described and as shown in photo. I am a female and love the big size and big easy read. I can read it fine and in dimmer areas, I push the light up button...it is a dim light up feature, yet, it makes it readable....just note it is not like your cellphone on its brightest. Recommended.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AEW64GWPCLDYCUUBG7IFXAOB4CEA",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B08VMTXZP1",
                "product_name": "Casio Casual Watch AE-1500WH-5AVCF",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:13:15",
            "updated_at": "2024-10-17 11:13:21",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252637784429570049",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=3",
                "asin": "B08VMTXZP1",
                "page": 3,
                "pages": 390,
                "reviews": [
                    {
                        "id": "R3M1966HK6E1GU",
                        "title": "5.0 out of 5 stars Great watch for the price!",
                        "author": "Lacey Harmon",
                        "rating": 5,
                        "content": "I joined the national guard and got this watch to wear at basic training since I won’t have my phone. It seems pretty durable but I’ll find out since basic will be rough on it. The alarm isn’t very loud and doesn’t last long so it’s definitely not a good sleeping alarm but that’s fine. I like the color, set up was easy.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AGK4PVVKUFRMHPD4NR74MVFFJ7KA",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R256JC3QBK09CF",
                        "title": "5.0 out of 5 stars All it does is tell time.",
                        "author": "no one",
                        "rating": 5,
                        "content": "Just like you, I stopped wearing a watch when I got a cellphone. Then I got a smart watch, and I tried various models, but at the beginning of 2024 I got sick of my smart watch yelling at me to charge it all day while I wasn't anywhere close to home.I'm a big guy, and the size is great. I wear it day and night, and in the shower. I use the alarms to get up for work. I work in a lab, wearing gloves, handling chemicals. I don't want to reach into my pocket to check the time.It's bomb proof, and it's affordable, and I'll lose it before I will have to change the battery.",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AEMNX5ESQMPENVKLBI74THVIGZJQ",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "R52CTXXEXJQ31",
                        "title": "5.0 out of 5 stars Review: Casio Illuminator AE1500WH Series",
                        "author": "Eric",
                        "rating": 5,
                        "content": "Reliable and DurableThe Casio Illuminator AE1500WH Series is an excellent choice for anyone needing a reliable and robust watch for outdoor activities. I use this watch every time I'm out sailing, and it has consistently proven its durability and dependability. The 10-year battery life is a standout feature, ensuring that I don’t have to worry about frequent battery changes, which is incredibly convenient for extended trips at sea.Timer FunctionalityThe timer function is the most important feature for me, and this watch does not disappoint. Not many watches offer a timer of this quality, and it's essential for timing various sailing activities and maneuvers. The timer is easy to set and read, even in challenging conditions, thanks to the LED backlight that ensures visibility in low light or nighttime situations.Quality MaterialThe watch is made from quality materials that hold up well under the rigors of sailing. The case and band are durable and resistant to the wear and tear of saltwater and rough conditions, making it a reliable companion on the water.ConclusionIn summary, the Casio Illuminator AE1500WH Series is a dependable and functional watch, particularly valued for its excellent timer feature. Its 10-year battery life, LED backlight, and additional features like multiple alarms and a precise stopwatch make it a standout choice for sailing and other outdoor activities. If you need a watch that combines durability with practical functionality, this model is definitely worth considering.",
                        "timestamp": "Reviewed in the United States July 20, 2024",
                        "profile_id": "AEW6QYBPDFS4GAENFSZDQK4SCJ6Q",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "RGV4BTAA9J5FR",
                        "title": "5.0 out of 5 stars My second Casio AE1500",
                        "author": "biker123",
                        "rating": 5,
                        "content": "This review is of the white watch with negative display. It's not \"white\", it's more of an attractive light limestone for lack of a better description. The negative display is a bit harder (but ez) to read indoors which I consider a plus and I can always hit the light. I prefer the neg display esthetics. Easy to read in sunlight. The light illumination is also more pleasing in the neg display. Note: I altered the watches by fine hand polishing off some case text, they are both AE1500's. They look every but a G-Shock, the difference is plastic crystal and 100M vs 200M+ water resistance, but of course Casio outperforms it's own specs and unless you are a saturation diver what's the point. Don't hesitate because it's \"white\" it's a masculine looking watch.",
                        "timestamp": "Reviewed in the United States August 19, 2024",
                        "profile_id": "AG7WEO5LJ4S7NW7ZNUVHUBLFGGXQ",
                        "is_verified": true,
                        "product_attributes": "Color: WhiteSize: Standard"
                    },
                    {
                        "id": "R3NAHTIHKPJW9",
                        "title": "5.0 out of 5 stars diamond in the rough",
                        "author": "Gary R. Godin",
                        "rating": 5,
                        "content": "The only men's wristwatch I've found that when you purchase, it offers you the option of getting a larger wrist strap! Fits my 9 1/2 inch wrist with plenty to spare. For those who want a no frills plain watch, this is it. It has a resin body, I know for the fashion conscious that is a turnoff, but actually it does look pretty nice. It has supposedly a ten-year battery, we'll see how that goes but for the price, if I can get 2 years out of it I'll be happy & it'll be worth the twenty bucks.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AFY4YX4IESCSTLJL36OGG5HSR75Q",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "R2M8ES99MT7718",
                        "title": "5.0 out of 5 stars Large display with all the basic functions",
                        "author": "R01",
                        "rating": 5,
                        "content": "This Casio watch (AE-1500WH-1AVDF) is great for those individuals who want some basic functions and who don't need all the health features on those Smartwatches that are often inaccurate and not waterproof. The hour and minute, alarm time, timer, and stopwatch are displayed in large numbers. There are the five alarms in addition to an hourly timer. The alarms are useful for daily reminders about taking medicine, studying, getting ready for sleep, etc. Also, the alarm(s) can be set for a month and day. The timer is a welcome feature; for example, cooking foods that specify a fixed time. The stopwatch is useful for timing things like walking or exercising. One welcome feature that I like is not worrying about water damaging the watch while showering. Supposedly the battery will last 10 years, but I think if it lasts at least half the promised time it would still be worth it. For me, a very interesting feature is the bar display on the right side that goes from 1 to 10 seconds.Prior to buying this watch I had used up three large-face, limited-feature CakCity watches. The bright display was very good at night, but those three watches lasted only about a year and a half with either the display malfunctioning, the display dimming, or the band breaking. Also, while showering I had to be careful about not exposing the watch to too much water. Constantly raising my watch arm was a necessary extra work. Good grief, Charlie Brown!",
                        "timestamp": "Reviewed in the United States July 9, 2024",
                        "profile_id": "AEBBTWTZUEZPMZMU4SBYFZTHS3HQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R2CC03NK5221PB",
                        "title": "5.0 out of 5 stars Works great, but hard to set up for the first time!",
                        "author": "Train Room Gary",
                        "rating": 5,
                        "content": "I have had this watch now for several weeks. Looks great and runs great. Read the directions and then have someone read them to you as you set it up for the first times. Two brains are better than one. Good Luck!",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AFOYCMXYRFMVMOUFAIWHFHFQPK5Q",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "RHNLHMF0HKHU8",
                        "title": "4.0 out of 5 stars Great tough , simple and inexpensive!",
                        "author": "SPM5150",
                        "rating": 4,
                        "content": "I bought this watch as my work watch in the garage , yard , etc. When you don't want to purchase anything expensive but purposeful, this is a great option. Had a slight problem setting up the time but after some trial and error with instructions, I got it. Set it and forget it. Good option.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AE6CRCAHFCQW27Q2IS6C5EMXLILQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R1L145BY1YXC1O",
                        "title": "5.0 out of 5 stars Cool beater watch to use while working in unsanitary conditions.",
                        "author": "Horatio",
                        "rating": 5,
                        "content": "I use this at work where I'm subjected to the elements. The case size is great, easy to read and use. It's water-resistant so it's easy to clean as well. For the price you can't go wrong with this!",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AHTBOWR6OKAMAVRXOCKYI2324HZA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "R3IAKCW7WJH0RH",
                        "title": "5.0 out of 5 stars awesome watch!",
                        "author": "Alex Acosta",
                        "rating": 5,
                        "content": "I really like my watch! It's easy to read (has large numbers). I've had it for over a year and it's still ticking!",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AG4OLK3IV6TSUI5YKSPXROLLT2VA",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B08VMTXZP1",
                "product_name": "Casio Casual Watch AE-1500WH-5AVCF",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:13:15",
            "updated_at": "2024-10-17 11:13:22",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252637784429570049",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=4",
                "asin": "B08VMTXZP1",
                "page": 4,
                "pages": 390,
                "reviews": [
                    {
                        "id": "R1VKRROFBN60LJ",
                        "title": "4.0 out of 5 stars The backlight.",
                        "author": "Walter Rogers",
                        "rating": 4,
                        "content": "The watch is nice but the backlight is on for only 3 really fast seconds. That's seems to be the only dislike about this watch.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AHWPZZN55VEWNZR2BPKV7AIBHQSQ",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "RBRFM86CU9CVT",
                        "title": "5.0 out of 5 stars Great So Far",
                        "author": "Wesley",
                        "rating": 5,
                        "content": "I use this while feeding animals and barn chores. It’s been caked in mud/feed/sweat/water and has had no issues thus far (about 2 months).",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AEUQAJOQAPBK7SOF7SDZIGPHSZBQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R2KFEGHQ1H4BWO",
                        "title": "5.0 out of 5 stars Doesn't look like a $20 watch",
                        "author": "Kindle Customer",
                        "rating": 5,
                        "content": "The media could not be loaded. I'm very impressed with this watch, especially for $20. I thought it'd be too big for my wrist, but it's not. It's comfortable, and the numbers are extremely easy to see. The only con is the backlight. It's a dim amber color, but it will do just fine. You can see in my pictures the size difference between this and the G-Shock DW-5600E-1, which is the perfect watch! I highly recommend checking that one out also if you're into square G-Shocks. It's the perfect size. You can get a more expensive version of it with solar power and a radio signal that updates the time for you, but I didn't think it was worth the extra price. I'm extremely pleased with what Casio offers for such a great price! This is my second Casio this week, and I'll continue to buy them. I think my next one will be the GBD-200 with the MIP display.",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AHT57YRHX7ICUHXJW5OVOGOZAIVA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R3EKZD1OC2J353",
                        "title": "5.0 out of 5 stars The Best $20 You Can Spend!",
                        "author": "The Candyland Fam",
                        "rating": 5,
                        "content": "You all know what these watches are, they are the rave on YouTube reviews even by well esteemed watch reviewers. I got 20 plus G-Shocks from the affordable up to the Master of G Mudmasters like the GWG-1000/2000 and even the recent GW-9500 Mudman. But this $20 Casio AE-1500 is just awesome. The look, the feel, and the features are just classic. The star of the show are the large numbers which are just so useful to have plus they have an excellent degree of contrast that is easy to read in low light conditions. I opted for the extra long band because I like the double clasps on the band, I don’t have a large wrist and the extra length does not bother me. I did not take it off for a week and it is going to be difficult to get my G Shocks back in rotation. I had originally wanted the tan/beige color but was sold out. After a week with this black extra long band, I saw the tan one at a local retailer for the same price so why not. First day I put the tan one on and my wife immediately noticed it and loved it. She said it was better looking than any of the expensive Master of G watches I have, so that says a lot about how great a $20 watch is. Just totally awesome, you got to get one if you’re a watch aficionado. Even if you have no justification to get another watch when you may have so many. If you’re like me, I have blown $20 bucks here or there on nothing worth remembering. This is the best way to spend $20 and get some joy for a long time to come. If you’re buying a Casio for the first time, don’t hesitate, you cannot do any better than this watch, do it!UPDATE: I bought here on Amazon a screen protector that fits this watch perfectly, it is the VRWOX [3-Pcs] TPU Screen Protector For AE-1500. This product definitely makes up for the plastic screen the watch comes with and now I have no worries about getting it scratched. Will definitely extend the serviceability of this Casio. I have had the screen protector on all three AE-1500s. Oh by the way I ended buying the dark gray strap with the negative display and so far the best negative display that Casio makes, better than any Master of G or other regular G-Shocks that I own. Still have not worn any of my G-Shocks since buying these AE-1500s.",
                        "timestamp": "Reviewed in the United States February 6, 2024",
                        "profile_id": "AEC2JQU65SD7PKCAHMLBQUYY7YWQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "RDV6Y8WDTLNX4",
                        "title": "5.0 out of 5 stars 15 year old gives 2 thumbs up",
                        "author": "TJ",
                        "rating": 5,
                        "content": "My son is becoming a bit more fashion conscious and has collected several watches over the last year. He realized he didn't have a \"sporty\" one in his collection to wear and after browsing the site, he chose this one. He's worn it every day for the last week and says he really likes it a lot. It seems to fit him well and he hasn't mentioned any irritation or anything he does not like about it. He likes that he could change the time to read 0000 - 2400 and that he can set alarms and have the screen backlit.",
                        "timestamp": "Reviewed in the United States August 19, 2024",
                        "profile_id": "AGPU63OFI4JTYVI37XJZZDA7A2LQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "RKLDOA3XEU7KI",
                        "title": "4.0 out of 5 stars Muy buen relog",
                        "author": "Saúl goodman",
                        "rating": 4,
                        "content": "Se llega a rayar muy fácil la pantalla pero está bien",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEA226RD5TFIWN3Q77PJERBPHKEQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R1PKZ5U5Z3VALF",
                        "title": "5.0 out of 5 stars Casino",
                        "author": "José la cruz",
                        "rating": 5,
                        "content": "Muy buena compra de reloj",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AGEZKUTUHK555HFQZTRFCCRZEEUQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R3HVOZTBGIIM9V",
                        "title": "5.0 out of 5 stars Long watchband very good",
                        "author": "Kent",
                        "rating": 5,
                        "content": "I am a big guy and have never had a watchband this long before. Usually I have one hole or no holes left over on a watchband. They said this is long and they minute the watch is really cool too.",
                        "timestamp": "Reviewed in the United States September 15, 2024",
                        "profile_id": "AGILPHYY74UXOJRPFE2A6OKHMJ4A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "RP621D9FQ2J3",
                        "title": "5.0 out of 5 stars Durable beater watch with good looks",
                        "author": "Todd",
                        "rating": 5,
                        "content": "Good looking color. It used to be called khaki but now they call it Tan, even though it’s still khaki color. Great price for my third watch in the illuminator series of Casio. I use it for lawn work and in the first couple days of receiving it I have put it thru the durability test. While wearing it, I have dug out a large dead shrub with a pick axe and shovel, planted new shrubs, mowed lawn with both riding lawn mower and self propelled, used my weed trimmer and backpack leaf blower on the property. It has withstood the vibrations, sweat, water hose, and the jarring of an axe and shovel. Rinsed off and good to go for next chore. This keeps my pricy watches out of the brutality of lawn work and shop work. Not totally intuitive to set everything, just playing with it, UNTIL you read the instruction manual and once you understand what the function of each button is, then everything about this watch becomes easy, going forward. Testing the light button in daylight is underwhelming until you test it at night, then you realize how well the entire face lights up. The alarm sound is slightly on the weak side, but sufficient. Its value and build quality out performs the persona of a throwaway watch, despite its throwaway price. Yet, it looks good enough for a night out or day at the office or shop. It uses the large but flat CR2032 battery, the same ones you find in many car remotes, thus the ten year battery claim. It’s as easy to change as any other watch battery, and remote batterie, I have changed for neighbors, friends, and myself. It has many functions but one that stands out as unique is a daily alarm “with a snooze function”, that one surprised me of the five alarm settings it has. It has the typical stop watch, timer, and dual time function. Lastly, I have . a 6.75 wrist and it fits well. Plenty of band holes for left for smaller or large wrists. I recommend.",
                        "timestamp": "Reviewed in the United States April 15, 2024",
                        "profile_id": "AHFOQCOUIWIDAUNANHTHRJGOBQLQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R3JGX0911BMA1D",
                        "title": "5.0 out of 5 stars Excelente calidad",
                        "author": "José Briceño",
                        "rating": 5,
                        "content": "Llegó antes de la fecha, me gustó mucho.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AG3Y3VRMTVTD7QHFBODNXILDSJOQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B08VMTXZP1",
                "product_name": "Casio Casual Watch AE-1500WH-5AVCF",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:13:15",
            "updated_at": "2024-10-17 11:13:23",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252637784429570049",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=5",
                "asin": "B08VMTXZP1",
                "page": 5,
                "pages": 390,
                "reviews": [
                    {
                        "id": "R1HJD65AJPUBZ5",
                        "title": "5.0 out of 5 stars Good watch.",
                        "author": "William Payton",
                        "rating": 5,
                        "content": "10 year battery warranty. Good watch.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AHCV7Z7ZTYRTKICHONWICKOT2ZAQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R1ZWUGNWMWUS8Y",
                        "title": "5.0 out of 5 stars Easy to read.",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Great value for the price. The digits are big and easy to read even without my eyeglasses. Very impressed with the precision of the timekeeping, it only variates one second per week against my other radio controlled casios. Perfect for work environment if you don't want to damage your more expensive model. Definitely a five star.",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AFR7LFUYRUHQAE7D476UT4JY22PQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R1G3NRL811IGOW",
                        "title": "4.0 out of 5 stars It works",
                        "author": "Dr",
                        "rating": 4,
                        "content": "It has 2 small lights that allow me to see the dial in the dark. It works and it stated it has a 10 year battery. we will see.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AGLMF432WU3JO7AI54SETI7V2TWQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R3T6AIL7LPSQ52",
                        "title": "5.0 out of 5 stars Legible, Simple, Rugged",
                        "author": "MusicMan",
                        "rating": 5,
                        "content": "No other watch from Casio/ Protrek/ G-Shock, Suunto, or Garmin offer a watch that’s nearly as readable (size if type and brightness), is simple to operate (time, day, date, alarms/timer), and is more than rugged for daily wear. I’m sure G-Shock is more rugged, but this seems to deliver more than enough protection for daily wear, sports, outdoor activities, and water (safe to 100 meters). And it’s under $25.",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AGP54EF7E36YTGN6XQ527P6HDO3Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "R1ZYM58SD4IR68",
                        "title": "5.0 out of 5 stars Great looking watch at a great price",
                        "author": "David L. Danek",
                        "rating": 5,
                        "content": "I love the look of this watch. It is a unique color and the large numerals are easy to see against the light screen. The simplicity of the display is another plus. The price was quite reasonable as well. We'll see if the 10-year battery holds true. I'm very happy with this purchase.",
                        "timestamp": "Reviewed in the United States August 31, 2024",
                        "profile_id": "AG7MCIUGXY7OBJAYGQDERPYVTYJA",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    },
                    {
                        "id": "R1SJBGLYZ4K685",
                        "title": "4.0 out of 5 stars I’m shocked it’s not a G",
                        "author": "DJ Joe Freitas",
                        "rating": 4,
                        "content": "This watch definitely has the DNA of a G-Shock with a tiny price tag. It’s lightweight and fits perfectly on my 7.5 inch wrist.Thankfully Casio is finally starting to make a legible negative display.. unfortunately it comes with an acrylic crystal.I also swapped out the strap keeper to black in order to give it some contrast.",
                        "timestamp": "Reviewed in the United States August 29, 2024",
                        "profile_id": "AGYKHZWPJKZRDO5TVVYRIHUHUBIA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraySize: Standard"
                    },
                    {
                        "id": "R3LO8E7HDGE1WI",
                        "title": "4.0 out of 5 stars Good Value",
                        "author": "James T. Stewart",
                        "rating": 4,
                        "content": "Great watch for the money. My only dislike is that the face is not entirely back lit. Two small white lights on the sides are fairly dim compared to some other LED lighted watches I've had before.",
                        "timestamp": "Reviewed in the United States September 5, 2024",
                        "profile_id": "AHCDXPUTQSYF5ODD7QQKZGADSQ2A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "R34U6II075B4HI",
                        "title": "5.0 out of 5 stars Useful",
                        "author": "Kindle Customer",
                        "rating": 5,
                        "content": "It was a gift for my dad and it works perfectly!",
                        "timestamp": "Reviewed in the United States October 3, 2024",
                        "profile_id": "AHYXMSZHSQKYO76O7J26LRLN3ZBQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Extra Long"
                    },
                    {
                        "id": "RGR55CDO6BQZ4",
                        "title": "5.0 out of 5 stars It's fits great and lite",
                        "author": "Lawrence Fernandez",
                        "rating": 5,
                        "content": "As, soon as I put the watch ⌚️ on me , feel very lite weight and feels great",
                        "timestamp": "Reviewed in the United States September 23, 2024",
                        "profile_id": "AGF3KZAWX4J3ZIWRRIUC33YJ5TMQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: Standard"
                    },
                    {
                        "id": "RSYQMQPF9N93C",
                        "title": "4.0 out of 5 stars Great for my son!!",
                        "author": "Hugo Aravena Díaz",
                        "rating": 4,
                        "content": "My son needed a watch to keep track of time when running (stop watch), this is perfect. It is a little big, but it looks cool and love it. The color is great too. Just wish the band was a little softer, but not a deal breaker.",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AFYSGRVHEBCIQAGKYNTEWWHFVFNQ",
                        "is_verified": true,
                        "product_attributes": "Color: TanSize: Standard"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B08VMTXZP1",
                "product_name": "Casio Casual Watch AE-1500WH-5AVCF",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:13:15",
            "updated_at": "2024-10-17 11:13:25",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B08VMTXZP1?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252637784429570049",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:13:15",
        "domain": "com",
        "geo_location": null,
        "id": "7252637784429570049",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B08VMTXZP1",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:13:25",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252637784429570049",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252637784429570049/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252637784429570049/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252637784429570049/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252637784429570049/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}