{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=1",
                "asin": "B09NMLVQ64",
                "page": 1,
                "pages": 5,
                "reviews": [
                    {
                        "id": "R1C5YXIE3OBU77",
                        "title": "5.0 out of 5 stars Bright & Beautiful display",
                        "author": "W. E. Baker",
                        "rating": 5,
                        "content": "I’ve been wearing Garmin smart watches for years and I think I’ve been waiting for this for years. The AMOLED display is bright and beautiful. The battery life for my GPS use pattern is good, several days. The “always on” but dimmed out Display mode works great. The GPS accuracy is better than the Garmin MARQ I was wearing before. The wrist based HRM is better than the MARQ too, none of the annoying, wildly inaccurate heart rate spikes. The golf app works great and only consumes 15% of a full charge for a 4 hour round. I really like the white band & case and titanium bezel, looks sophisticated and cool. The selection of watch faces is large and I use an Omega Seamaster look-alike. I’ve had pretty good luck with the Amazon Prime music app and the Bluetooth connection from the watch to by Bose ear buds is very good.It’s hard to find cons, I’m disappointed they continue to use the Fenix style connector, the spring loaded connector for the MARQ was MUCH BETTER.I haven’t been able to make Garmin’s external display feature to my Edge 520+ bike computer work, generally, my Edge just crashes. Probably a problem with the edge, not the watch.",
                        "timestamp": "Reviewed in the United States January 15, 2023",
                        "profile_id": "AFHJGRCNCZQXAS6WI2JNDFAILA3Q",
                        "is_verified": true,
                        "helpful_count": 13,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3HVAWF08M4C0L",
                        "title": "5.0 out of 5 stars Great Watch with AMOLED screen",
                        "author": "Jorge Carranza",
                        "rating": 5,
                        "content": "Got this watch on a GREAT deal for prime day and can't regret it. This was an upgrade from a Forerunner 255 and honestly have to say that it kind of measures the same things as the forerunner 255 its just like a luxury upgrade. It has some added features like traning readiness, endurance score and some other which might be helpfull for athletes working with data but they are not necesarily for a amateur athlete. It has a more outdoor activities so i would say its a luxury adventure/outdoor sport watch. Got the white titanium version and looks pretty decent. The only \"not so great\" thing may be the watch bisel which is kind of a grey material that will scratch if smashed against something in comparison to my previously forerunner wich has like a \"plastic\" kind of bisel that doesnt reveals too much of the scratches. But besides that, I believe its a great watch only if you really got the budget to buy it, otherwise i would recommend looking for other options depending on the sports you are doing.",
                        "timestamp": "Reviewed in the United States July 29, 2024",
                        "profile_id": "AHF7WBUDGO2NMO3RV2GEEXKNS4SQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3F7SFZ6WTYFJ7",
                        "title": "5.0 out of 5 stars After using the remix 3HR and ;6, this is amazing!",
                        "author": "Richard S",
                        "rating": 5,
                        "content": "The screen, it’s all about the bright screen. My other 2 Garmin watches (3HR and 6) were great for tracking activity, but were really only usable in sunlight (outdoors). They were just too dark indoors, even with the backlight. The Epix has all the same functions as the 6 and 7 but with the OLED screen, you can use it anywhere and always quickly and easily read the screen. It was an expensive upgrade since I had bought the 6 only the year before but the screen held me back from using it for indoor exercise. The battery in the Epix is almost as good, lasting around 5 or more days, not quite as good as the Felix 6 but the charging plug is the same and it’s much better than an Apple Watch.",
                        "timestamp": "Reviewed in the United States January 25, 2024",
                        "profile_id": "AEMIHKJYTXXMMO3K6UQOVXA7B6PQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2J32X7KQQROYA",
                        "title": "4.0 out of 5 stars nice smartwatch",
                        "author": "V. Artioli",
                        "rating": 4,
                        "content": "I am enjoying this watch very much. once you get used to the button the menu is easy to navigate. I have had no issues with pairing to my phone, nor to other garmin sensors. I have used it to broadcast my heart rate to my cyclo-computer when I forgot the strap, and it worked well. I started training using the suggested workout feature and so far I like it. The strap could be a bit longer for people with big wrists, unfortunately there is not real aftermarket option if you need a longer band so make sure it will fit you. Garmin offers diving bands which could be cut to fit, but that is not a great solution either.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AH6C3J6MWHWOCSL2TPRG6GYW64FQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R18Y1NOL116ORV",
                        "title": "5.0 out of 5 stars Best wstchbouy there!",
                        "author": "T. Wright",
                        "rating": 5,
                        "content": "I got tired of charging my Apple Watch every other day so I bought one of these. Can't say enough good things about it, keeps a charge for two weeks! I wish I had bought one sooner.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AHADG554P3XWZLRQ2ANB4Y556V4Q",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1DNUEZL2DD105",
                        "title": "5.0 out of 5 stars Upgraded from Forerunner 945",
                        "author": "U's Reviews",
                        "rating": 5,
                        "content": "For those of you who know with the forerunner 945 can do you also know this was probably a splurge upgrade. Coming off an Apple Watch into the Garmin family. I had quickly realized that the Garman was the absolute best fit for me when it came to my work out tracking and smart, watch features that I valued. However, after being used to the quality of screens coming from my Apple Watch, there was a bit to be desired. I initially started searching for the new forerunner 965 when I decided to take a look at the epic 2. The OLED screen was a key feature, and I would not have upgraded without that. That all being said, the epic two is absolutely living up to its name. This watch really has everything you could possibly need for everything other than diving. I feel the sleep tracking is slightly better with the epic than the forerunner. I also really love the training readiness and tracking more on the epic. The screen itself is absolutely gorgeous and function exactly how you would want it to. The dual GPS capabilities have shown marked improvement on the forerunner as well without a huge battery draw. Speaking of battery, when the watch is not on, always on mode, I have seen consistently around 12 to 13 days battery life before I need to charge. I have actually left on a weeklong vacation without my charger ran multiple times using GPS about 20 to 25 miles during the week and still came home with about four days worth of battery life.",
                        "timestamp": "Reviewed in the United States April 18, 2023",
                        "profile_id": "AFRSX3LQP44LJF7LL5EDH6IEF3SQ",
                        "is_verified": true,
                        "helpful_count": 17,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R10VCADD9KIV0L",
                        "title": "5.0 out of 5 stars Quick delivery",
                        "author": "John Pugh",
                        "rating": 5,
                        "content": "My previous Garmin watch finally failed. When I placed this order, the shipping date originally looked like I'd be waiting, but Amazon sent this new Epix much sooner than expected. No problems.",
                        "timestamp": "Reviewed in the United States September 5, 2024",
                        "profile_id": "AGFE7WXZT7WMWCOQRLY3ABV32RUA",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R23ORCUXRPXN3I",
                        "title": "1.0 out of 5 stars Prehistoric technology",
                        "author": "Los Angelinos",
                        "rating": 1,
                        "content": "I had my first garmin 2004, that gigantic chunky piece we used on our races like the Bike Transalp. A gadget you think you need, but we got lost many times navigating in the alps. Now 20 years later I tried the Epix. Nothing has changed, it is the same technology. The main issues are: it is so slow, too slow for mountain biking, not accurate enough, (still) loosing track and simply go in battery save mode during a navigation. Pulling out my iPhone with the trailfork app and it shows exactly position even on airplane mode meaning the Garmin still doesn't use available technology. I talked to many Garmin owner and all they do it tracking their training on a loop they are running every day. For that I don't need a $700 piece. Garmin basically invented the street navigation years ago, but in cities with bike mode on the Epix sends you constantly against one way streets which is quiet dangerous. Then you need the dynamic routing, but the recalculating takes more time on the EPIX than the Garmin 20 years ago. On top you need 5 Garmin apps to cover all functionality. This is prehistoric and so disappointing.Good news: At least amazon refunded although return window was closed due to traveling.",
                        "timestamp": "Reviewed in the United States February 15, 2024",
                        "profile_id": "AHVQP3C7DY35PPCZ6T2ONAN4TKXA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "RO8NPJUGPW8HD",
                        "title": "4.0 out of 5 stars Price discount changed got charged higher price.",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Online price was 44% off, when shipped they charged me a higher price of only 37% off. Tried to cancel or dispute. Got the watch, it is nice just disappointed about the price hike from time of order and pice charged to credit card with no prior notice of price change.",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AG6QMPKYTDFXR2AEGSH4NQBLJYEQ",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1EJUHO3L1CGUH",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "leostargazer",
                        "rating": 5,
                        "content": "Just opened it and wearing it first day. Love it. Very comfortable. Got several different color straps for it and looks great.",
                        "timestamp": "Reviewed in the United States July 13, 2024",
                        "profile_id": "AHDCR5TNSD22R3XXOTRL5UFEYLJA",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NMLVQ64",
                "product_name": "Garmin epix Gen 2, Premium active smartwatch, Health and wellness features, touchscreen AMOLED display, adventure watch with advanced features, white titanium",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:21",
            "updated_at": "2024-10-17 11:51:29",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252647374428832769",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=2",
                "asin": "B09NMLVQ64",
                "page": 2,
                "pages": 5,
                "reviews": [
                    {
                        "id": "RPGR415YZY4GZ",
                        "title": "5.0 out of 5 stars Umm'd and ahh'd over upgrading from the Fenix 5 - but now no regrets at all.",
                        "author": "B. Vyas",
                        "rating": 5,
                        "content": "I've had the Fenix 5x Sapphire since launch, and have used about 10% of the functionality (HR, GPS activities, Sleep, Steps, etc), but logged and tracked that consistently with the Connect app. My Fenix was getting tired: the battery was aging - never reached 100% charged, dropped to 50% in a few days, lasted about a week with no GPS, but that was hit/miss; and the watch strap lasted about 4 months before the silicon breaking, and that display, apps, and app controls weren't quite as compelling as what I was seeing on other devices.I umm'd and ahh'd over upgrading to the Epix, or newer Fenix or the instinct, thinking that the cost to upgrade wasn't worth it based on how little functionality I used. I watched a ton of video reviews, watch comparisons etc... eventually I pulled the trigger on the white Epix gen 2 and I have no regrets. Not surprisingly 5yrs make a huge difference in watch tech!The display on the Epix is stunning, the touch screen is a joy, the watch is noticeably lighter, and the watch strap seems a lot more durable, apps load fast, sensors are improved, GPS syncs quickly, and the battery life is stunning (with normal GPS activities, and esp if you tweak the display - ~2 weeks with batter saver).Yes this was still an expensive upgrade - did I need to do it? no; am I glad I did? absolutely!",
                        "timestamp": "Reviewed in the United States October 17, 2022",
                        "profile_id": "AELVR2ECMIVZFFNQA2ZVY5AO3E6A",
                        "is_verified": true,
                        "helpful_count": 22,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R6ML5TVB4AIVT",
                        "title": "2.0 out of 5 stars Big and heavy",
                        "author": "Katie",
                        "rating": 2,
                        "content": "Coming from an Apple Watch I really wanted to like this. Lots of really cool functions and capabilities. The battery was so much better than the Apple Watch too. In the end it was just too big, heavy, and clunky feeling for my wrist. Wish there was a smaller size.",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AFUOCE6DRF3WZQZNPN4N77ENKYWQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "RHIG8HDZ7HMK1",
                        "title": "3.0 out of 5 stars Not accurate",
                        "author": "Lee Oliver",
                        "rating": 3,
                        "content": "Garmin makes a nice product but if you are after tracking your heart rate, which is also tied into sleep patterns, save your money. I have this one and the Finix 6 and neither read my heart rate accurately. In fact they way off. Also, if you have an iPhone, text messages will not come through. It’s essentially an overpriced pedometer - but does offer some mapping options if that is what you are looking for.",
                        "timestamp": "Reviewed in the United States September 15, 2023",
                        "profile_id": "AHPWXIXRPTAJ6AQZYIGSWVTTMFZA",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2NVQU0C2FT2PA",
                        "title": "5.0 out of 5 stars Love Garmin",
                        "author": "Kate",
                        "rating": 5,
                        "content": "Garmin as always is great. Long battery life. Screen is very bright. I used it to track my path while hiking. It does a good job tracking in the middle of nowhere. The only thing that i can’t figure out is heart rate monitor. It is always off. I am not sure why.",
                        "timestamp": "Reviewed in the United States July 30, 2023",
                        "profile_id": "AHU5X4QV5ABB2FNRGP2Y5K45M5DA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2LL7GJNV198RJ",
                        "title": "5.0 out of 5 stars Absolutely love this watch!!!",
                        "author": "Jessica Miner",
                        "rating": 5,
                        "content": "I love all of the features. I’ve been a Garmin wearer for 10+ years. Garmin is the best for signal & ease of use. Great tracking. Garmin connect & IQ apps make it super user friendly.",
                        "timestamp": "Reviewed in the United States August 19, 2023",
                        "profile_id": "AHCS3FQKE7RZBPDPUY2T53BTHK3Q",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3TTBMF223OMOW",
                        "title": "5.0 out of 5 stars Reloj",
                        "author": "Maria c.",
                        "rating": 5,
                        "content": "Excelente producto.",
                        "timestamp": "Reviewed in the United States February 1, 2024",
                        "profile_id": "AG2LPXUZRAMDXNRWHYEFTMRFMJWQ",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2G3EWJA4UMMW9",
                        "title": "5.0 out of 5 stars Better display at the cost of battery life",
                        "author": "Mrinabh Dutta",
                        "rating": 5,
                        "content": "I have been a Garmin Fenix user for years and love everything about the Fenix BUT the display. While I understand the advantages of LCD display it just robs Fenix of the high end smart watch look. Epix 2 is the perfect balance between both worlds: it has all the features of Fenix and comes with a much nicer display. If you don’t mind charging once a week I think this is a better choice over Fenix.",
                        "timestamp": "Reviewed in the United States June 22, 2022",
                        "profile_id": "AGRSSHJWOGZZVJCLGAV37ME4QZHA",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1IBYBEBXS1754",
                        "title": "2.0 out of 5 stars Up/menu button stopped working",
                        "author": "Max",
                        "rating": 2,
                        "content": "I have bought the epix (gen 2) 4 months ago, worked fine till today. Up/menu button clicks on push, but does not work. I will try their help/support service. I will write an update.",
                        "timestamp": "Reviewed in the United States April 25, 2024",
                        "profile_id": "AF7OVQZIX6YXURXSP5ASIJL5SJLQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2VNEX27E98HSB",
                        "title": "5.0 out of 5 stars Great watches",
                        "author": "Evgeny Shmanev",
                        "rating": 5,
                        "content": "Initially I was surprised by a short battery life. The watches had worked for 3-4 days at most. After googling for a solution, I made a hard reset and renewed firmware. After that the battery works stable 16 days.",
                        "timestamp": "Reviewed in the United States April 26, 2023",
                        "profile_id": "AEQU7TH6B3TZLKJOHEAGSGA3WLTA",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2JIU51RQFCUVJ",
                        "title": "5.0 out of 5 stars Love it",
                        "author": "Hilary JM Topper",
                        "rating": 5,
                        "content": "I wasn’t going to buy this because of the cost. But I am so glad I did. I love being able to see my metrics in the water and the morning report is awesome!",
                        "timestamp": "Reviewed in the United States February 28, 2023",
                        "profile_id": "AGBK5JN76HEL5BPAIILEEGBDQHSQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NMLVQ64",
                "product_name": "Garmin epix Gen 2, Premium active smartwatch, Health and wellness features, touchscreen AMOLED display, adventure watch with advanced features, white titanium",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:21",
            "updated_at": "2024-10-17 11:51:29",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252647374428832769",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=3",
                "asin": "B09NMLVQ64",
                "page": 3,
                "pages": 5,
                "reviews": [
                    {
                        "id": "R2IBV26JUNCFX5",
                        "title": "5.0 out of 5 stars Years ahead of the Apple Watch I switched it with.",
                        "author": "bobblack",
                        "rating": 5,
                        "content": "Battery life is simply amazing at 16days if the always-on feature is turned off. Which works for me.If I have that one I’m looking at 7 days, and even then.. that’s amazing!",
                        "timestamp": "Reviewed in the United States September 9, 2022",
                        "profile_id": "AGIHNSMC7OLQRPB4VXMJKFAH4CUQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3H1H8W1S9DW5T",
                        "title": "5.0 out of 5 stars Great watch. Great Fitness Tracker. But do you need it?",
                        "author": "Michael",
                        "rating": 5,
                        "content": "Probably not a necessity for anyone that has any of their previous offerings. But if you don't have a product that does what this watch can, don't hesitate. Just buy it. My Apple Watch is very lonely now.",
                        "timestamp": "Reviewed in the United States May 11, 2022",
                        "profile_id": "AGOKJIEJTOPN3CTNE5L2XRDJCTBQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3A069L7XPQ22H",
                        "title": "5.0 out of 5 stars Expensive but worth it",
                        "author": "Nimbo",
                        "rating": 5,
                        "content": "Do you really need a $1000 running watch? No. But it sure makes running fun & the display is killer. The battery life is pretty damn good too.",
                        "timestamp": "Reviewed in the United States June 18, 2022",
                        "profile_id": "AFZHITYVEPPUFCZGILSCLV5TGP5A",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1J798PJ7BBBS2",
                        "title": "5.0 out of 5 stars Great sport and smart watch.",
                        "author": "MacGregor K. Phillips",
                        "rating": 5,
                        "content": "So far it works great. I am still learning about all it can do. The online manual is 130 pages long. All in all it is a great watch.",
                        "timestamp": "Reviewed in the United States March 13, 2022",
                        "profile_id": "AGRMEW4WZZSO6KWIWNM7SP3WLDQA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3NMYY6MM5S78K",
                        "title": "2.0 out of 5 stars Good Watch but Samsung Galaxy is Better",
                        "author": "Ajay B",
                        "rating": 2,
                        "content": "This watch has many features but the user experience and user interaction is better delivered by Samsung's Galaxy watch 4 that I already have. Switching to this watch felt like a downgrade and I had to return it back as it was not easy to navigate and use on a daily basis. If you do not have a Samsung Galaxy watch, this maybe a good watch to own. Priced very high and another thing I do not like about his watch.",
                        "timestamp": "Reviewed in the United States July 2, 2022",
                        "profile_id": "AER2GTVVLY7M7U4CKLWYPNPVZWXQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2GAAA8DT5I8WZ",
                        "title": "5.0 out of 5 stars Buen reloj. Muy completo",
                        "author": "LUIS KEMPER PERERA",
                        "rating": 5,
                        "content": "Un reloj mas para seguir todas las actividades.",
                        "timestamp": "Reviewed in the United States October 2, 2022",
                        "profile_id": "AGUNFIQJPJ23RJO3QCHGLHHLHI5Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2MHREJM9QR0AB",
                        "title": "1.0 out of 5 stars Not sealed and shows it was used/ opened before",
                        "author": "Mahmoud",
                        "rating": 1,
                        "content": "The box was not sealed. The item was recieved with several scratches on the box. The original screen protector before the first use had bubbles underneath it showing it was taken off before. This items seems someone elses watch packaged again.",
                        "timestamp": "Reviewed in the United States March 10, 2024",
                        "profile_id": "AEUFW3LRE32J6AZCLNEKYEKUWNKA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2VWE7SHLR38MI",
                        "title": "1.0 out of 5 stars Used watch that was sold as new",
                        "author": "Mohamed Alkhadhouri",
                        "rating": 1,
                        "content": "Not in the original package. No product manual or charging wire. Couple of scratches on the watch and the strap. Some Data is still in the watch that shows it has been used for at least 2 months.",
                        "timestamp": "Reviewed in the United States May 27, 2023",
                        "profile_id": "AEA3DAU5GHIOKGHNB7PUUY2JBMUA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3D3R6J2207NHN",
                        "title": "5.0 out of 5 stars Best garmin watch with fantastic features! Worth the wait!",
                        "author": "Elvis",
                        "rating": 5,
                        "content": "I originally had a vivoactive 3. Was looking at the venu 2 and possibly the Apple Watch 7. I decided to get the epix titanium gen 2 even though there was quite a wait for it. It is loaded with so many features and customization! A lot the stuff that was on my vivoactive 3 was a bit gimmicky, however the same features on the epix seem to work smoothly. For instance rep counting on the epix seems to be spot on. The screen is very bright, the maps are great, navigation works flawlessly, I no longer need to take my brick of a phone with me for workouts.I love that you can store music on the watch itself. Did not use Amazon or Spotify so I just uploaded music I already had purchased. My galaxy buds did not connect well to the watch but it seems the galaxy buds were the issue as the watch works flawlessly with my wireless Sony head phones.There are loads of other positive things about the watch and overall I think it was a great purchase",
                        "timestamp": "Reviewed in the United States February 10, 2022",
                        "profile_id": "AEJH2ZOMXCOIG2LVEGUYKRGTCU3A",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2RTSPU5XHBM0F",
                        "title": "5.0 out of 5 stars the best smart watch",
                        "author": "TF",
                        "rating": 5,
                        "content": "The watch met my expectations. It looks great, sits comfortably on my hand. The battery life is excellent. I use it for swimming - time, distance and other parameters are calculated accurately.",
                        "timestamp": "Reviewed in the United States February 10, 2024",
                        "profile_id": "AFJRBPDHRGUZBUJASKBJPDUU74VA",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NMLVQ64",
                "product_name": "Garmin epix Gen 2, Premium active smartwatch, Health and wellness features, touchscreen AMOLED display, adventure watch with advanced features, white titanium",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:21",
            "updated_at": "2024-10-17 11:51:30",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252647374428832769",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=4",
                "asin": "B09NMLVQ64",
                "page": 4,
                "pages": 5,
                "reviews": [
                    {
                        "id": "R26IWK0KTHQKGN",
                        "title": "1.0 out of 5 stars Great product but extremely delayed delivery",
                        "author": "Rahul Monga",
                        "rating": 1,
                        "content": "I had purchased this as a gift for a family member for a special occasion. The delivery was extremely delayed. Unacceptable in this day and age",
                        "timestamp": "Reviewed in the United States January 29, 2024",
                        "profile_id": "AFUBHRD2JNHHK6C6TPQACAU7BD2A",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R97BNOA2LUVDZ",
                        "title": "5.0 out of 5 stars Great Garmin Watch i purchased",
                        "author": "snsilver",
                        "rating": 5,
                        "content": "Sure a great watch. International version allow me using my own language in my city.",
                        "timestamp": "Reviewed in the United States April 4, 2024",
                        "profile_id": "AGI7BUWO6EAOYJG4FIBG37FHOJ2Q",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R9COJMN0TGESN",
                        "title": "Excepcional!",
                        "author": "emmanuel",
                        "rating": 5,
                        "content": "el diseño y la calidad son de lo mejor! y bastante completo para realizar practicamente cualquier deporte. estoy muy satisfecho con esta compra.",
                        "timestamp": "Reviewed in Mexico August 31, 2023",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "RHHPBDESCY6N0",
                        "title": "Muy Completo",
                        "author": "RICC",
                        "rating": 5,
                        "content": "De los mejores relojes que he tenido en mi vida muy completo en funciones con calidad premium",
                        "timestamp": "Reviewed in Mexico July 31, 2023",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2QL8LIR8BMO0T",
                        "title": "Highly recommended",
                        "author": "AP",
                        "rating": 5,
                        "content": "Well packed and arrive just in time as a father's day gift. Really love this watch. The resolution is brilliant and clear. Have been using it for the past 5 days and the battery life is amazing. Got this watch at an amazing price. Highly recommended",
                        "timestamp": "Reviewed in Singapore June 22, 2022",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R2H8CT4LH7QFR2",
                        "title": "Feature packed",
                        "author": "Cory Vernon Davis",
                        "rating": 5,
                        "content": "It has so many features compared to my older Polar. I use a Garmin Edge 530 on my bicycle rides and with this watch it allows me to get a more complete picture of my fitness, recovery, and overall body state. The number of features on this watch is astounding. I like that Garmin allows Zwift workouts to be imported, which is something that Polar didn’t allow. See dcrainmaker for a comprehensive review of this watch and its features. Garmin’s user forum is also a good place to get questions and issues solved. Overall I’m very satisfied with my purchase, especially since it was $599 Canadian on prime sale day.",
                        "timestamp": "Reviewed in Canada August 4, 2024",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1J6IC1Q6HI8FL",
                        "title": "Bonito, rápido, lleno de métricas deportivas",
                        "author": "RENATO ENOC",
                        "rating": 5,
                        "content": "Me está fascinado este epix 2. La pantalla amoled es sensacional, el sistema es rápido y las métricas deportivas de lo más completo. Es muy útil que pongas una fecha de carrera y te diseñe un plan de entrenamiento basado en tu condición física, nivel de VO2, sueño, recuperación, entre otros. El GPS se conecta rápido y es muy preciso, los sensores de Frecuencia cardiaca, podómetro, se conectan de inmediato en cuanto inicia una actividad. El material de la correa es suave y de buena calidad. El reloj no es pesado y es muy cómodo para correr, el día a día, dormir, ciclismo, yoga.",
                        "timestamp": "Reviewed in Mexico August 5, 2024",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R38KH33GQHT0QL",
                        "title": "Most beautiful watch",
                        "author": "ketheeswaran",
                        "rating": 5,
                        "content": "My first order ups Delivered somewhereNorth York I lost .then contact Amazon customer service very help full serviceMade replacement. They said it will take 60Days but within 10 days received myWatch",
                        "timestamp": "Reviewed in Canada May 7, 2024",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R7BD9IN3DPUO8",
                        "title": "BUEN PRODUCTO",
                        "author": "Rafa Fuentes",
                        "rating": 5,
                        "content": "Buen producto en general, finalmente GARMIN es líder en esta linea.",
                        "timestamp": "Reviewed in Mexico July 26, 2023",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NMLVQ64",
                "product_name": "Garmin epix Gen 2, Premium active smartwatch, Health and wellness features, touchscreen AMOLED display, adventure watch with advanced features, white titanium",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:21",
            "updated_at": "2024-10-17 11:51:32",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252647374428832769",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=5",
                "asin": "B09NMLVQ64",
                "page": 5,
                "pages": 1,
                "reviews": [
                    {
                        "id": "R3C7R1IT2UTFK3",
                        "title": "Perfect watch!",
                        "author": "Ivaylo Dimitrov",
                        "rating": 5,
                        "content": "Pretty satisfied with this watch! It has more features that you can ask for and the screen is spectacular! With always on display turned off and daily workouts of around 40 minutes I get 17 days of use on a single charge! Great watch. I don't listen music on it so I did not try the feature! I use all the training features, the syncing is perfect and garmin connect works flawlessly, so no complaints as of today! 17 days of battery life is perfectly acceptable for me!",
                        "timestamp": "Reviewed in Canada April 26, 2022",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3BE7BB4FFEF7",
                        "title": "Disappointing Experience with a Defective Unit and Poor Customer Service",
                        "author": "Ken",
                        "rating": 1,
                        "content": "I purchased this item during Prime Day, excited about the great deal. However, the unit I received was defective from the start—it constantly crashes, and the activity maps are blacked out, forcing me to restart it to work properly.When I reached out to customer service, they initially promised to exchange the defective unit. But in a later conversation, they went back on their word and asked me to return the item and repurchase it at the current, non-discounted price. This was incredibly frustrating, especially since the Prime Day discount is no longer available.I’m extremely disappointed, not just with the defective product, but also with the lack of support from customer service. It feels like they’re more interested in making a sale than standing by their products and promises. Buyers, beware—this has been a truly frustrating experience.",
                        "timestamp": "Reviewed in Canada August 16, 2024",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R3NDF76BULUXVO",
                        "title": "El mejor Smart Watch para deportistas",
                        "author": "Maria Méndez Soto",
                        "rating": 5,
                        "content": "Amé este reloj porque tiene todas las funciones necesarias para practicar cualquier deporte, pero además la iluminación de la pantalla te permite leer los datos, estando en exterior (lo que no pasaba con los otros modelos). La entrega súper rápida y todo en perfecto estado. Mejor experiencia que incluso ir a una tienda física.",
                        "timestamp": "Reviewed in Mexico July 20, 2023",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R1WENASUNYFPUC",
                        "title": "¡Un super reloj!",
                        "author": "CRS",
                        "rating": 5,
                        "content": "Apenas llevo usándolo dos semanas, en la banda corriendo es super preciso, caminando al aire libre y en el golf es fantástico, la pantalla se ve increíble sin duda es una inversión que vale la pena",
                        "timestamp": "Reviewed in Mexico April 8, 2023",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    },
                    {
                        "id": "R31Z3O80WZ3LNS",
                        "title": "Excellent",
                        "author": "Sohail rajwani",
                        "rating": 5,
                        "content": "It's superb",
                        "timestamp": "Reviewed in Canada July 16, 2023",
                        "is_verified": true,
                        "product_attributes": "Color: White TitaniumStyle: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NMLVQ64",
                "product_name": "Garmin epix Gen 2, Premium active smartwatch, Health and wellness features, touchscreen AMOLED display, adventure watch with advanced features, white titanium",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:51:21",
            "updated_at": "2024-10-17 11:51:33",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B09NMLVQ64?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252647374428832769",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:51:21",
        "domain": "com",
        "geo_location": null,
        "id": "7252647374428832769",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B09NMLVQ64",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:51:33",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252647374428832769",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252647374428832769/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252647374428832769/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252647374428832769/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252647374428832769/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}