{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=1",
                "asin": "B09NWDXS13",
                "page": 1,
                "pages": 50,
                "reviews": [
                    {
                        "id": "R2QOSJ5KY22BQN",
                        "title": "5.0 out of 5 stars Very nice watch",
                        "author": "t.s.",
                        "rating": 5,
                        "content": "This is a refurbished watch so I was a little skeptical about what I would be getting but just like all the other refurbished devices Ive bought....I was very satisfied. It looks just like a brand new one. So easy to pair with my phone, keeps a great charge and works like a charm. Very informative health and fitness tracking, text, talk,everything you do on your phone can be done on this watch. Good value!",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AG2UJXUM52OUQ73YDD7Y7IFLOQFQ",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1JK8JB9WT5WCO",
                        "title": "5.0 out of 5 stars Excellent deal",
                        "author": "JZ",
                        "rating": 5,
                        "content": "Received my Apple Watch series 7 which replaced my series 6. It was in excellent condition and functions perfectly. From a cosmetic perspective, it appeared brand new. My only disappointment is that the battery capacity was only 83% which means that I will only get about a year with this battery before it will need to be replaced. However, the price was substantially lower than a new one so I guess it was a fair trade off.",
                        "timestamp": "Reviewed in the United States August 8, 2024",
                        "profile_id": "AHRMWLUJOZ5YPQFLCN5YGMTL22NA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "RJGGXP7JCGI3J",
                        "title": "5.0 out of 5 stars Apple Watch is in excellent condition",
                        "author": "Lauren",
                        "rating": 5,
                        "content": "Apple Watch came in excellent condition. It had a few superficial scratches on the screen, but looks almost like new. Very happy with my purchase!",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AFH7OS5J2GZCIWR7U7UOUD6LZIBQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1HGCFLMPDOOPD",
                        "title": "1.0 out of 5 stars BEWARE- THIS DOES NOT WORK WITH AN iPHONE 8 ANYMORE!! IT IS INCOMPATABLE NOW!",
                        "author": "Ron P",
                        "rating": 1,
                        "content": "I bought a new Iwatch 7 in 2022 and had no problem pairing it up with my iPhone 8. That watch worked fine for 2 years but was stolen recently so I bought this refurb iWatch 7 on Amazon. Apple has made changes now so the iWatch 7 will no longer pair to an iPhone 8. Why. Because the iPhone 8 cannot go up to version IOS 17, WHICH THE iWatch 7 now requires or it will not pair!! I got Amazon on the phone and they confirmed it to be true so after trying everything to get around the problem, I finally had to return the watch. If you have an iPhone 8 or less, don't waste your time with this.",
                        "timestamp": "Reviewed in the United States August 24, 2024",
                        "profile_id": "AE5EJXMBMGHMPNLA3JLWGMPHGWQQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R196NAC0M0PDIF",
                        "title": "4.0 out of 5 stars Good watch, sketchy packaging",
                        "author": "Hlav1010",
                        "rating": 4,
                        "content": "Very nice watch, works completely fine. It did have minor scratches on the aluminum frame and the screen. The device came in very sketchy boxing though..",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AG53RPVOIFQU6NMBMOJJKBNPZGAA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1KPBSKBHVLAXM",
                        "title": "5.0 out of 5 stars Absolutely like new",
                        "author": "Dennis Crawford",
                        "rating": 5,
                        "content": "I’m very satisfied with this purchase, as it looks absolutely new and functions perfectly. Being new to Apple Watches, I struggled a bit with set-up and all its features, because there was no documentation provided. YouTube videos were extremely helpful. Battery life is a little disappointing at just two days despite turning off all unnecessary functions.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHV2ZVVV3AO3JIFOYH4OCCQBQ6EQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R17F590PEATWPL",
                        "title": "5.0 out of 5 stars Excellent condition.",
                        "author": "Mark F.",
                        "rating": 5,
                        "content": "Beautiful condition. A couple very small blemished. Battery has 89% life. Only negative is the included band is too small for my wrist.",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AEYJ6T5ZH3PPBNCZLTMGUWZRYF6Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R25EF354QLCBQZ",
                        "title": "5.0 out of 5 stars Great refurb watches!",
                        "author": "Heidi",
                        "rating": 5,
                        "content": "This is the second refurbished apple watch I have ordered from this vendor, and I’ve been very happy with both! The most recent was a 7, and it looks practically brand new. I can only see one tiny little scratch near the turn dial. It has 90% max battery capacity, which I think is pretty darn good for a used watch that’s a few years old. Works perfectly, paired easily, is just what I ordered. I will order from this vendor again in the future. Very happy to have an older model refurbished watch for half the price of new.",
                        "timestamp": "Reviewed in the United States August 1, 2024",
                        "profile_id": "AHXTT4GWGL64XDWGIOTUPOKSL7LQ",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": ""
                    },
                    {
                        "id": "RJPLIUFTK85B8",
                        "title": "4.0 out of 5 stars Honest review",
                        "author": "Chris",
                        "rating": 4,
                        "content": "I always end up reading the one star reviews of a product AFTER I buy it and end up getting pretty anxious about what’s going to end up at my door. I have to say I’m very happy with what I got. There are slight blemishes around the glass on the frame which I wouldn’t agree is excellent condition but my overall battery health is 89% which I do consider excellent. All the buttons and knobs work and so does the heart rate sensor. It arrived dead but charged rather quickly with the supplied charger and paired with my phone in minutes. I originally purchased this as a gift for my girlfriend because new ones are so expensive so I am off to find a empty apple box to put this in so she’s none the wiser I cheaper out lol. Overall I’d say it may not be excellent condition but it is very good and I’m more than satisfied.",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AFIVABSJMPPEPE3RIK5KBO3HTRCQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3MVVIZKN9EENP",
                        "title": "4.0 out of 5 stars Most(ly) Excellent",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "The watch looks to be in excellent shape with some minor scuffs on the underside but is otherwise like-new. The charger it was sent with doesn’t work and the band was too small. Luckily my wife has an Apple Watch so I used her charger and I went out and bought a band that fits. Overall I’d give this a solid 7/10. The watch looks and works great and the battery life is still 90% but the accessories it comes with are useless.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AGO2INIZ53OH6ALC7AKUGTF7O6OA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NWDXS13",
                "product_name": "Apple Watch Series 7 (GPS, 45mm) Midnight Aluminum Case with Midnight Sport Band (Renewed)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:25:11",
            "updated_at": "2024-10-17 11:25:39",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252640790164289537",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=2",
                "asin": "B09NWDXS13",
                "page": 2,
                "pages": 50,
                "reviews": [
                    {
                        "id": "R1472YHITY6K7H",
                        "title": "4.0 out of 5 stars Not too bad, for the price",
                        "author": "Omar Arroyo",
                        "rating": 4,
                        "content": "Battery last a good amount of time, came with 85% battery life. Has some minor scratches but can’t be too picky when buying a refurbished watch!",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AH5RW73JJQD3IUM3S5TWFZORMJRQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RQADHLWDZS6FH",
                        "title": "4.0 out of 5 stars Very impressed!",
                        "author": "BmB",
                        "rating": 4,
                        "content": "Watch came with all the accessories, and amazing shape. Was a little hesitant with a refurb watch, but figured I could always return it. Looks brand new, and was a significant cost savings. Battery showed 85% health, which is acceptable.Mine included a standard charger not the Apple fast charger. Not sure what comes with a new watch. Or if using the fast charger is good for the battery over time anyway. Also, the Oxygen sensor is disabled. But that’s for all Apple Watches with an O2 sensor as they are currently in a legal battle over a patent case. In theory, if they settle the case they could reenable the feature. Bit of a bummer.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AEX6BKXK6XWPUV2VRB3XBYPFWLBA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R28GJ9YJ5LBP6E",
                        "title": "5.0 out of 5 stars Super excited husband!",
                        "author": "ARenae",
                        "rating": 5,
                        "content": "I was incredibly nervous ordering this after seeing some of the horrible reviews, but I will say I'm so glad I went for it. I feel we were very lucky and received a nearly perfect watch. I bought it for my husband's birthday and he is thrilled! It actually ended up being the Nike series which I didn't even know existed, but he is hyped! Thanks so much!",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AHT2MSKFNZWFUGYVD253J7URILCQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1AGG3U2P2AFYI",
                        "title": "4.0 out of 5 stars The GPS on that is great",
                        "author": "Maryjane",
                        "rating": 4,
                        "content": "I like this watch it’s like new great price",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AEVZPVHEP2CM3M7QYES6PQAEZ62A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RGE28HDD1CLQF",
                        "title": "3.0 out of 5 stars Cheaper than new FOR A GOOD REASON",
                        "author": "TWilhite",
                        "rating": 3,
                        "content": "Needed a newer Apple Watch so I can do ecgs to share with my doctor. I didn’t want to shell out a shirt load of money for a new one. Saw these renewed ones for a fraction of the price. I ordered one and 2 days later, it showed up. It was in a plain box and had a charger with it. Good thing because it was dead as I’ve ever seen anything dead. It charged up in an hour or so I could get it set up.I inspected it. There are wear marks on the case and crown but the face was fine. I put a screen and case protector on it and it looks fine.I checked the battery life and it’s down to 85%. I’m sure that’s going to be fine. I know it can be replaced it I want to later.The sports band is not an Apple product but I don’t care. I quit buying Apple Watch bands years ago. I can buy 3 or 4 of these perfectly fine knockoffs for the price of one Apple.Other than the scuffs and battery it works as it should.Down with overpriced stuff and thumbs up for cheaper rebuilt semi quality stuff. Kinda like a rebuilt transmission.*****UPDATE*****As for the functionality of the watch, it's fine except for the battery life. I have to charge it part way through the day IF I want it to last all day. On more than one occasion, by 4:00 pm, I got the 10% battery left message and then it is dead until I get it on a charger. Now, I'm going to have to spend $100 to get the battery replaced.AND - the watch charger that came with it, does not work. Yes, I took the piece of plastic off of it before trying it out. I'm beginning to regret my purchase.I guess I could see if I can replace the battery myself but I don't want to perform surgery on a piece of electronics at my age. The battery will be around $25 and the tool kit will be around $30 plus shipping and handling. Still saving money though. Maybe I can start a side hustle replacing apple watch batteries and save enough to go on vacation in the tropics or buy a small can of pineapple juice.Buyers remorse is setting in. REMOVE A STAR!*****UPDATE #2*****Found a video tutorial that walked me through turning off a number of the functions of the watch to save on battery. I am pleased to report that after doing that, I can now wear it 10 or 11 hours and the watch will still have mid 70's battery left. I shouldn't have to do this but I did so Now I can wear it and not worry about taking a charger to work with me so I can charge it over my lunch break.",
                        "timestamp": "Reviewed in the United States March 26, 2024",
                        "profile_id": "AG5GEELZROUNKKZNJCCIFXGVA2DQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3PKXXNS9UMY77",
                        "title": "4.0 out of 5 stars Series 7 watch",
                        "author": "Jas",
                        "rating": 4,
                        "content": "I’ve ordered the Series 7 45mm “good” condition watch. Luckily, I’ve ordered the black color because the appearance has scratches on it. I colored it in with a black sharpie lol easy fix. Still planning to purchase a protective face for it though. The battery health is at 86%. It’s decent for a watch that’s a few years old. The screen, charging, connectivity, heart rate tracking is in good condition.",
                        "timestamp": "Reviewed in the United States July 24, 2024",
                        "profile_id": "AHM6N4CVBVVDHGXFNYQOTENL27QQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R353Z95032W502",
                        "title": "5.0 out of 5 stars Apple Watch Series 7 45 mm",
                        "author": "Josh",
                        "rating": 5,
                        "content": "Watch came dead and without original box and Apple Watch Series 7 USB’s charger but watch has no scratches or dings. Functions perfectly,and got here faster than expected",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AGHALA4VMND7GOAJPL6NGSFVQCHA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R31X6C4AYSQZ8B",
                        "title": "5.0 out of 5 stars This Apple watch arrived In like new condition",
                        "author": "FamilyMan",
                        "rating": 5,
                        "content": "Honestly, If I had not been told in the item listing that this was a refurbished product who thought it was new",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AF6MJHOV3FCU2NQ6VSGDPYLYY6QA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R29ELOX2FFYYRJ",
                        "title": "3.0 out of 5 stars Not what I hoped for",
                        "author": "Jpeterson13",
                        "rating": 3,
                        "content": "I ordered this for my husband for his birthday. It was listed as in \"Excellent condition\". I will give it that it the screen is scratch free, however there are quite a few chips of the finish missing from the bottom and the crown is heavily marked up. I haven't even been able to turn it on, as it didn't arrive pre-charged, so I have to wait until I he's at work to charge and test it. Given the fact it came uncharged, I'm a bit worried it won't hold a charge well. I mean, given the price, I guess I get what I paid for, but I was hoping for something a bit nicer based on the description.I'll update when I've had a chance to charge and test batter life.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AGANBQ5YVSXAWE2QT4WE7WT53YIA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3GRXOJQ814YIR",
                        "title": "4.0 out of 5 stars What’s with the wrist band",
                        "author": "Scott blum",
                        "rating": 4,
                        "content": "Apple Watch is great but the standard wrist band is garbage. Apple should be embarrassed to produce such trash for their watch.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AEGYZH4KVPIQ3Y32IO5ONPJNXIBQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NWDXS13",
                "product_name": "Apple Watch Series 7 (GPS, 45mm) Midnight Aluminum Case with Midnight Sport Band (Renewed)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:25:11",
            "updated_at": "2024-10-17 11:25:41",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252640790164289537",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=3",
                "asin": "B09NWDXS13",
                "page": 3,
                "pages": 50,
                "reviews": [
                    {
                        "id": "RYYW7CP1C1AK7",
                        "title": "5.0 out of 5 stars Great price",
                        "author": "guido13",
                        "rating": 5,
                        "content": "Great price needed replacement and this was refurbished and looked new. Great price.",
                        "timestamp": "Reviewed in the United States September 20, 2024",
                        "profile_id": "AGFKQRG4MU3H75VKARPPJ7OD34FA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1VUP9QXFL5C99",
                        "title": "3.0 out of 5 stars Blood oxygen sensor is disabled",
                        "author": "TheCodeWhisperer",
                        "rating": 3,
                        "content": "Like most other people who bought renewed, mine was delivered completely dead and the charger is cheap USB-A aftermarket and not the USB-C quick charger that normally comes with the watch. That is a disappointment. It took over an hour to charge to 44% and stopped from temperature protection.The condition was excellent, just tiny spots around the aluminum that are not really noticeable. The glass is perfect.Battery health is 86%. That's about what I expected.This is a series 7 so the blood oxygen sensor should work since it is not sold by Apple. However, mine is disabled. This was one of the main reasons I got the watch so it is a real let-down. Is this a mistake?The watch itself is nice and much faster than my old one, which is still working but no longer gets updates past watchOS 6.3. I love the larger display.",
                        "timestamp": "Reviewed in the United States August 7, 2024",
                        "profile_id": "AEIXOFSTXFQIFTXKYVJ2LSGKWEWA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RACSNEZ1SR87M",
                        "title": "4.0 out of 5 stars Muy buen equipo pero la batería no estaba al 100",
                        "author": "Cristian",
                        "rating": 4,
                        "content": "No me gustó que la bateria tuviera menos capacidad, pensé que al se run amazon renewed certificado vendria con bateria al 100",
                        "timestamp": "Reviewed in the United States July 16, 2024",
                        "profile_id": "AECQW5GTWWZGALKLTTWMDAHHA25Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2QUU2VX95G342",
                        "title": "4.0 out of 5 stars Refurbished Unknowns, but still worth it.",
                        "author": "Laurel",
                        "rating": 4,
                        "content": "I bought this Apple Watch 7 refurbished to upgrade from my series 4. Buying online, you never really know what “excellent” or “good” quality means. I bought a “excellent” quality watch. Here’s what that looks like:The screen on this refurbished watch is perfect, but the crown is more scratched than my series 4. Also, the battery health on this refurbished watch says it can only hold 85% of a charge (which presumably means 15.3 hours of battery life on a “full” charge as opposed to the original 18). In contrast, my series 4 is at 79% (about 14.2 hours on a “full” charge). I know batteries degrade over time, but I was surprised to see a number this low on a 2-year-old watch.I wish I’d known about the battery health, but it’s not a huge deal as I charge daily anyway. The performance upgrade from the 4 to the 7 is amazing. I had so much lag on the 4 that any watch face with widgets was useless as they took over 10 seconds to appear. Lastly, I guess I feel good for the planet for buying used.",
                        "timestamp": "Reviewed in the United States December 27, 2023",
                        "profile_id": "AH6JDBM4W4B63X6SP4GKG3XVB4MQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3SJ6CRF8AQ1YW",
                        "title": "5.0 out of 5 stars update on previous review:",
                        "author": "Sherridan",
                        "rating": 5,
                        "content": "after research, i found out that these new watches can’t be placed over tattoos. maybe that’s obvious, but i’ve had 2 before and the sensors never had an issue. i switched the watch to my right wrist and it’s been perfect! as i said before, it came perfectly with no scratches. a few resets later and it’s perfect :)",
                        "timestamp": "Reviewed in the United States August 5, 2024",
                        "profile_id": "AERGY6SEFVTG4BZH65BUOE7PWJ6Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "RRDRLHP21F1ZZ",
                        "title": "3.0 out of 5 stars Was not “excellent” condition",
                        "author": "Dave",
                        "rating": 3,
                        "content": "Battery health was only 83%, looked like the previous owner was a painter, paint on the crown and in the cracks. Sent mine back.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AGVLAHHZL4WEHG6IYPLK6OV7XWOA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R36VMO1Z6ELDIG",
                        "title": "4.0 out of 5 stars It’s an Apple Watch Series 7",
                        "author": "Connor Murray",
                        "rating": 4,
                        "content": "Great watch for everyday activities. Favorite features would have to be the fitness and exercise tracking, or the text message previews. Oh yeah and being able to unlock my Mac with the watch is great too. Make my friends think I’m magic when my MacBook opens without a password or Touch ID. Even though the series 7 was released in 2021, it works perfectly and the series 8 isn’t different enough to justify the price difference. On the downside though, the rubber sport band can hurt if you have a lot of hair in your wrist and you put it on too tight. Lastly, the 45mm size is perfect for me as I am 6’1” and have decently sized wrists that aren’t too huge.Seller (loop mobile) was great, even though the delivery took a while even though it was coming from Indiana when I live in CA. Ordered a renewed one and the condition was great. Any wear came from wearing it at work or during my exercises.",
                        "timestamp": "Reviewed in the United States October 28, 2023",
                        "profile_id": "AGOLIASSWIDNC63KQE73VYD23EYQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1CNO5G6XPZZW1",
                        "title": "4.0 out of 5 stars Good not great",
                        "author": "marshall",
                        "rating": 4,
                        "content": "Watch is in working order. Delivered early. Really maybe shouldn’t complain but several very noticeable scratches on side of watch face. Enough I bought a case for it. It is refurbished but still a lot of money to have scratches like that",
                        "timestamp": "Reviewed in the United States May 25, 2024",
                        "profile_id": "AHNXYINYLZ5ESF6MZHI6F7STKDOQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2H6VEDGNUT7LS",
                        "title": "4.0 out of 5 stars Real honest review",
                        "author": "CEO of reviews",
                        "rating": 4,
                        "content": "Comes with charger, Apple Watch had very very light scratches, and was a bit dirty near the rear sensor, I cleaned it, upon arrival was stuck in reboot loop, (had to let device complete die) then charge the device to 100%, battery life was at 81% which in my opinion is not an excellent refurbished, nun the less it was a buy that was worth the money, remember you’re buying a used product so you deal with used issues, overall it has held up great and even comes with a screen protector, overall 7/10. (45mm midnight, series 7)",
                        "timestamp": "Reviewed in the United States March 23, 2024",
                        "profile_id": "AFQKOC4UYUYIGRYMX2P5GU57BQZQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "RNEWA2X78I1HR",
                        "title": "4.0 out of 5 stars Mostly as promised",
                        "author": "Kelly",
                        "rating": 4,
                        "content": "Based on Amazons requirements for selling return’s electronics, the face should have had no damage but this one has a small scratch on the edge of the glass. It’s not in the display area but it is visible.No original packaging or “wall wart” for charging which was inconvenient because my old watch is a USB-A charger and this one is USB-CIt did come with a new band and the battery life seems good. Overall positive.",
                        "timestamp": "Reviewed in the United States April 12, 2024",
                        "profile_id": "AHSUEHFFQVLGD34BTQO7J24XSTQQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NWDXS13",
                "product_name": "Apple Watch Series 7 (GPS, 45mm) Midnight Aluminum Case with Midnight Sport Band (Renewed)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:25:11",
            "updated_at": "2024-10-17 11:25:43",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252640790164289537",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=4",
                "asin": "B09NWDXS13",
                "page": 4,
                "pages": 50,
                "reviews": [
                    {
                        "id": "R1QMVUDIBZWH8W",
                        "title": "4.0 out of 5 stars Bueno",
                        "author": "Ecxelente",
                        "rating": 4,
                        "content": "Buena",
                        "timestamp": "Reviewed in the United States June 29, 2024",
                        "profile_id": "AHFDJQAATTEH2HFTARJ2FGRFEI5A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R9VCC2ATZMTEO",
                        "title": "5.0 out of 5 stars Works great",
                        "author": "Addie",
                        "rating": 5,
                        "content": "The watch came not charged and took a while to charge fully but I just did that while I was setting everything up so I didn’t need to use it. It works as if new, no scratches, came with 2 wristbands (which I’m super happy about because I have small wrist. Everything was in the box, 2 wristbands, charger, and watch. No complaints so far super happy with it.",
                        "timestamp": "Reviewed in the United States July 21, 2024",
                        "profile_id": "AHGNEOYCF7AET2ZKHXP57NMN6DEA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R33LRTJ748ZBAR",
                        "title": "3.0 out of 5 stars Battery life is bad",
                        "author": "Kathy Selbi",
                        "rating": 3,
                        "content": "The battery health on the watch is 85% and it dies fast.",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AGXJWZJCRJVJZYQ5VZCCZHTAHTGA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3P9Q9IZN722JO",
                        "title": "5.0 out of 5 stars Refurbished but exactly as promised.",
                        "author": "Richard Johnson",
                        "rating": 5,
                        "content": "I received a quality product. The battery health was 89%, well above the \"over 80%\" promised by Amazon Renewed. And the unit had no visible scratches.If this is a representative sample of what this vendor delivers, I look forward to buying another refurbished watch from them in a few years.",
                        "timestamp": "Reviewed in the United States July 25, 2024",
                        "profile_id": "AG6UEYRZPNCQAKR575N2QBVEL3NA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R574LM5J9F1BJ",
                        "title": "5.0 out of 5 stars Excellent buy",
                        "author": "RLevere",
                        "rating": 5,
                        "content": "Great product",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AFTQEON3FO4YH3PIPWFYO2EK4BPA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2XBKPQE9Q2X5K",
                        "title": "3.0 out of 5 stars Apple Watch 7",
                        "author": "Wrong item shipped",
                        "rating": 3,
                        "content": "Listed as excellent condition. Not so. More likely good to very good. Scratching being difference.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AEZNXWQTO6CTC7IMFUK5RLH3IABA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2RW8MC5IXMLGT",
                        "title": "4.0 out of 5 stars Not in \"Excellent\" condition. More along the \"good\" condition.",
                        "author": "Alex Bazzanella",
                        "rating": 4,
                        "content": "Overall, I am happy with the watch so far. I did have the same issue as a lot of other buyers. The battery life is around 85% or so. Scratches around the crown and frame (kind of expected), but it's the battery life that makes this 4 out of 5. I will look at other places before I buy from them again.",
                        "timestamp": "Reviewed in the United States April 13, 2024",
                        "profile_id": "AGO6NKZKLX6C4C5OIILN75IIM7TQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RQA9AQIF47FO7",
                        "title": "5.0 out of 5 stars Nike run club and apple music",
                        "author": "K J",
                        "rating": 5,
                        "content": "I bought this apple watch to have accurate running distances and times as well as the health options and listen to my music while i run. I usually go for a run around my back block which is a giant oval and 2 houses over a mile when i measured the distance with my truck odometer, and it was exactly the same distance with the nike run app which i was glad to know, the apple music app plays my music no issues once i got it working. I dont really use the other apps and wish i could delete more apps to have more gigs for music but o well, id recommend a apple watch for exercise👍",
                        "timestamp": "Reviewed in the United States May 17, 2024",
                        "profile_id": "AFTQW3OG4WJ2OIXQQ3B736AOQQVA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3J55D295H4BBA",
                        "title": "4.0 out of 5 stars Closer to used good condition then excellent",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "It did arrive next day delivery halfway cross county. Packaged well, and didn’t have any pairing problems with phone. Battery health was at 83%, notable small scratches on top of case and glass, but don’t affect view. Works fine and is good enough for was I need at better price then a new on",
                        "timestamp": "Reviewed in the United States April 18, 2024",
                        "profile_id": "AFZTO463DDLBUSSLC5NELENQYXEQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R13ZEAQDZKDAU4",
                        "title": "4.0 out of 5 stars Great watch!",
                        "author": "Luke Yarian",
                        "rating": 4,
                        "content": "This is a great Apple Watch. However when I received the watch is was completely dead and took severe hours to charge. Also if you buy refurbished be aware you will not get an authentic Apple charger or band.",
                        "timestamp": "Reviewed in the United States April 21, 2024",
                        "profile_id": "AFEXM4GLKKW6JBH6PZPK3MZ2EZUA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NWDXS13",
                "product_name": "Apple Watch Series 7 (GPS, 45mm) Midnight Aluminum Case with Midnight Sport Band (Renewed)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:25:11",
            "updated_at": "2024-10-17 11:25:46",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252640790164289537",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=5",
                "asin": "B09NWDXS13",
                "page": 5,
                "pages": 50,
                "reviews": [
                    {
                        "id": "R3SYZYVJW747AN",
                        "title": "3.0 out of 5 stars Excellent quality I Watch??",
                        "author": "Amazon Customer",
                        "rating": 3,
                        "content": "I liked the quick shipping turnaround. Disappointed by the quality of what I thought was supposed to be excellent quality. Good quality at best.",
                        "timestamp": "Reviewed in the United States August 21, 2024",
                        "profile_id": "AHF2T4663R7YSNVJFXN2XUKEI4XQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RDALYQHO92XAX",
                        "title": "4.0 out of 5 stars Apple Prices",
                        "author": "Chris O.",
                        "rating": 4,
                        "content": "Everything is great I just hate that Apple prices thing so crazy",
                        "timestamp": "Reviewed in the United States May 13, 2024",
                        "profile_id": "AG5ZPXT33QSFHXG6NJABB4OPLU3Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2DVNWLLT5X9LQ",
                        "title": "5.0 out of 5 stars Refurbished goodness",
                        "author": "twin",
                        "rating": 5,
                        "content": "The watch came on time when I needed it. Very good refurbished. A very tiny scratch on it, but no big deal. Works just fine. Good price.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AF4NNKF36M3SM563VRP5SPHFPOJQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "RZZSOCKXC534",
                        "title": "5.0 out of 5 stars Very happy customer",
                        "author": "Jason D. Romer",
                        "rating": 5,
                        "content": "I'm happy with my purchase. It looked flawless.",
                        "timestamp": "Reviewed in the United States August 13, 2024",
                        "profile_id": "AEZ5UJZICI6E5PSUZ7ZZBTH5BHOQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R31MMRBXG4HKA9",
                        "title": "4.0 out of 5 stars Great value for price",
                        "author": "Nathaniel",
                        "rating": 4,
                        "content": "I recently purchased a 45mm gps series 7 and I love it. The watch was $200 for excellent condition, which was a great deal. The watch shipped faster than expected and came in a non-apple box containing both a medium large and medium small apple sport band. The included charger was a non-apple puck made of all plastic, instead of the aluminum one that ships with the watch normally. The watch itself was in perfect condition, as expected. After through inspection there was no visible damage and all the sensors were fully functional. The watch was stuck on the \"Green Snake Of Death\" but a quick drain and recharge of the battery solved it. The battery health was at 100% which was very surprising. overall a great value for the money with a few minor downsides.",
                        "timestamp": "Reviewed in the United States September 5, 2023",
                        "profile_id": "AFKLIYNA7EBNF4XGQ2Y2OJ6VSA5Q",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": ""
                    },
                    {
                        "id": "R127S5B2X4CV35",
                        "title": "4.0 out of 5 stars Battery Health Only 87%",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "The watch is in perfect condition and works as it should. I noticed another customer showed lower battery health so I checked mine when I got it. Battery health is at 87%. I'm not sure how this will affect the watch moving forward but I thought it's important to mention to other customers. I'm still happy with my purchase for the price.",
                        "timestamp": "Reviewed in the United States February 26, 2024",
                        "profile_id": "AE2IKZ6YJLZDJGI25EP4X7LRIAVQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "RFVF7TRWTZMXR",
                        "title": "4.0 out of 5 stars Toget the benefit of watch you much have a need for at least 50% of the apps.",
                        "author": "Richard Hodgkinson",
                        "rating": 4,
                        "content": "I like the notifications, but I have trouble something’s like “ I set face clock to the clock hands but want to change it but have not been able too. Some of the other appts are useless To me.",
                        "timestamp": "Reviewed in the United States March 25, 2024",
                        "profile_id": "AHVM4VDE2JHTWY3INIOGX5OSRSWA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R31JEO11UYFS7O",
                        "title": "3.0 out of 5 stars Good condition",
                        "author": "Raven",
                        "rating": 3,
                        "content": "Watch was in good condition, although i believe it was sent with the wrong charger.",
                        "timestamp": "Reviewed in the United States August 10, 2024",
                        "profile_id": "AEDBNIAQL2DM6Z4RPHY6IYVW43ZA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3DYXRQQN2D9QL",
                        "title": "4.0 out of 5 stars Charger sent didn’t work",
                        "author": "Stephen H.",
                        "rating": 4,
                        "content": "Love the watch.",
                        "timestamp": "Reviewed in the United States May 7, 2024",
                        "profile_id": "AGQBLYHTYUAQZMMAZ23AQGHZHCQQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RLFTGU1QIV5HG",
                        "title": "3.0 out of 5 stars Good!! Buuuuut…",
                        "author": "Ismael S.",
                        "rating": 3,
                        "content": "I don't know where it is \"reconditioned\" from, I bought 2 devices, one has 75% useful battery and the other 86%, both are scratched.",
                        "timestamp": "Reviewed in the United States July 20, 2024",
                        "profile_id": "AFKTPKKJNNUKOZFSVAABG2Y6LQRQ",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09NWDXS13",
                "product_name": "Apple Watch Series 7 (GPS, 45mm) Midnight Aluminum Case with Midnight Sport Band (Renewed)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:25:11",
            "updated_at": "2024-10-17 11:25:48",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B09NWDXS13?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252640790164289537",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:25:11",
        "domain": "com",
        "geo_location": null,
        "id": "7252640790164289537",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B09NWDXS13",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:25:48",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252640790164289537",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252640790164289537/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252640790164289537/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252640790164289537/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252640790164289537/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}