{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=1",
                "asin": "B09WTV6MMY",
                "page": 1,
                "pages": 31,
                "reviews": [
                    {
                        "id": "R2IH04G5QSXGWF",
                        "title": "5.0 out of 5 stars Great training tool for runners.",
                        "author": "MannyB",
                        "rating": 5,
                        "content": "I’ve owned Garmins before and find the ability to objectively gauge and plan your training is a powerful tool. This watch takes it to the next level compared to my old ones. You get essentially the Forerunner 265 here minus the Amoled screen and the training readiness metric. Here’s a hint, look at your body battery and recovery metric and you have pretty much training readiness nailed down. The biometric sensors of the 255 and 265 are the same.Activity tracking is light years beyond Fitbit and also stock Apple Watched. Hell, having 5 buttons blows any Apple Watch out of the water for running. You can just hit an activity and go, or take a recommended workout. You can also make your own routines and upload to to the watch. I had some workouts from when I last owned a Garmin that I designed 10 years ago, and was able to upload and run them. I principally use it for running and strength training. For running I can’t find any faults for me. For strength training my complaint is the list of strength exercises is missing common exercises, like any read deltoid exercises…. It has an exhaustive list of odd ones too. Worst of all, you can’t make new ones. You can just use an existing one that is close enough and make a note that exercise X is really the one you did…. The watch also does a good job tracking indoor runs and both indoor and outdoor walks. It is pretty accurate in automatically detecting activities like impromptu walks, as well. The MIPs screen is amazing outdoors and way better at night when you would don’t want to blast your face looking at the time. In mixed-level indoor lighting, it lacks compared to AMOLED. It doesn’t have the pretty colors nor the contrast indoors, but I like a more serious looking watch anyway and find AMOLED to look like a game. The battery life is amazing. To get this sort of life on the 265 you have to let face go dark when inactive and use gestures to wake it. Not a big deal, but nice to be able to see the watch with a side glimpse without having to raise hand all the time.Customization is great. I downloaded a watch face that allows me to put all the metrics I need and have the time highly visible. Data screens are also very customizable. I have downloaded a custom data screen for running and for strength training to supplement the default screens.This isn’t a Pixel watch or an Apple Watch. As a smart watch it has limited ability and that’s fine. It reliably shows notifications. If you have your phone with you, you can initiate contact with an emergency contact. For example, you can send a message to come get picked up. If you have a compatible bank or credit card, you can use Garmin pay. I do find my financial institutions don’t currently support it, though.The music functionality is flawless. I use it with Spotify and a pair of JBL earbuds. It’s nice to be able to run with just the watch and earbuds and not have to carry a phone for music.I was able to use my ANT heart rate strap and foot pod from 13 years ago with no issues. They sync quickly and stay synced. The onboard wrist heart rate and running dynamics functionality have been very good when I haven’t used my ANT accessories. So there is no need to get an HR strap, but if you have or want one, they work flawlessly.The Garmin ecosystem; the watch, Garmin Connect App, and the website are great. Highly customizable and reliable. I had most recently used Fitbit and found the experience with the app and its website to be headed in a negative direction this last year.Overall, I highly recommend this watch. If the price difference between this and the 265 is around $50, it’s a hard decision. It boils down to how you feel about AMOLED versus MIPS, and maybe the chance that 265 feature set continues to get updated a bit longer than the 255. When the price delta is above $50…. The 265 becomes hard to justify and the 255 is the obvious choice. To reiterate, training readiness isn’t worth much at all. It’s a combination of other metrics that are already on both watches. So the decision is simply AMOLED vs MIPS display versus price.",
                        "timestamp": "Reviewed in the United States July 30, 2024",
                        "profile_id": "AF2M3ARN2JV4CUNS6US46BA6BOTQ",
                        "is_verified": true,
                        "helpful_count": 8,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2GOLRQKPB93FR",
                        "title": "5.0 out of 5 stars Slight overkill for the non-elites",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "Watch is top quality with a bunch of bells and whistles. I really only needed a watch to stop me from having to hold my phone on runs.All the extra features are nice to haves and have allowed me to look at my training from a professional outlook however I know where I am at. Combined with the strava app (or whatever app you want) it maintains tracking information well and accurate.Battery life is almost never ending, with a nice low profile appearance. I will classify this watch as perfect for its price point and as a \"better to have it and not need it than need it and not have it\" purchase.",
                        "timestamp": "Reviewed in the United States May 8, 2024",
                        "profile_id": "AGQEIUCO5FFVYKQQ4P7NNVPSCGVA",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2O09FFKPD4Q16",
                        "title": "5.0 out of 5 stars Excellent product",
                        "author": "Thomas",
                        "rating": 5,
                        "content": "This is my first running watch, and I don't see myself buying another anytime soon. It's sturdy, comfortable, holds a charge for about a week, and I love all of the tracking features.",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AFSOZ5DVKIBHQ4B3NCO6JCE54MYQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RKWKM83JSQI8M",
                        "title": "5.0 out of 5 stars Great watch!",
                        "author": "Ryan Niebuhr",
                        "rating": 5,
                        "content": "Great watch, fits very well (male wrist). Smaller face (255S) may work for others. No problems (yet) playing music while I run. Lots of battery life. No problems swimming w/it either. Cool features with tons of great info. I wish Garmin had access to a bunch of other apps, but what I do get is perfect for what I need. Overall a great purchase.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AGOFQFWA6WVIWU6UJG76VB3CGNWA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R295D5L4WVL341",
                        "title": "4.0 out of 5 stars Not bad Garmin watch",
                        "author": "john",
                        "rating": 4,
                        "content": "There is plenty you can say negative things about Garmin products but this watch is actually very fine. What's snowing about 'music' feature: this watch is not able to create playlist from uploaded songs, navigation has only forward button (you have to click to get into menu every time you want to go back), can't set autovolume (songs are played with different loudness), doesn't have option to block buttons on BT headphones. Does not feel like some premium sport smart watch - rather cheap plastic toy but it's light which is a +. It has nice feats like suggested workouts. Battery holds well (longer than Fenix 5), you can easily listen whole day to music (bt headphones will die first). Garmin pay is very limited what cards you can use it with. Live tracking works only when connected with phone.",
                        "timestamp": "Reviewed in the United States July 16, 2024",
                        "profile_id": "AHAYDWOYHG5SHXYOKFAYOJUKJSNQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R375E69GTTHSM1",
                        "title": "5.0 out of 5 stars The best watch for a runner yet!",
                        "author": "Speedy Gonzales",
                        "rating": 5,
                        "content": "I've been running with garmin for over 10 years now and it keeps getting better. The updates from the garmin forerunner 245 are noticeable and the technology in this watch is outstanding. There are plenty of apps to connect the watch to, whether it's running to tennis it has a mode for it. The watch is light and responsive with every button pressed. The GPS signal is strong and accurate and the wrist HR is dead on. I'm going to be honest, I'll never get a garmin with out a music mode to it. It's super clutch to run around with Spotify Playlist loaded on my watch without my phone being needed. Additionally, if you do carry your phone while completing an activity and you happen to fall, there is an incident detection and will contact a designated person on your liat with accurate gps coordinates to you location.This watch is amazing and does everything you need it to do, and more !",
                        "timestamp": "Reviewed in the United States May 1, 2024",
                        "profile_id": "AGLTPLZXPMSMGKIPOJB3SSNQNMKA",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2RA8KRKA0C34D",
                        "title": "5.0 out of 5 stars Great watch for beginner runners",
                        "author": "Dave, Boston",
                        "rating": 5,
                        "content": "Got this watch during prime day. Prior to this I had a garmin instinct solar. This 255 is a much better watch to track runs and cycling events on. The music feature is nice to have, but it is a bit difficult for me to load my playlists from Amazon music. I’m sure I’m not doing something right. The screen is nice and useful enough, but the new screen on the 165/265 is much brighter and nicer. Just not worth the extra money to me.RI would recommend this watch at the $250 or less price point.",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AHLSKAFRLUE3EZZYSRQSYH265QYQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2YYM9CPQP7PUM",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "Jmonsalve",
                        "rating": 5,
                        "content": "Purchased this for my dad and he couldn’t be happier.Tons of information all very accurate plus being able to add music helps to abound the need to bring your phone for runs.Great value",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AFQTX7JXK3VHNLSI54I5IUB4S46A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RNNQTLR4S7EFU",
                        "title": "4.0 out of 5 stars Love this thing.",
                        "author": "Alva Conklin",
                        "rating": 4,
                        "content": "I love the fitness data. The only complaint would be that the bluetooth connection to headphones can be finicky. Sometimes it disconnects. I use iLive IAEBTW53B Bluetooth True Wireless Earbuds with Built in Mic, IPX7 Waterproof, Charging Case, and Bluetooth 5.3 (Black). As long as I only connect the one on the side that i wear the watch the connection seems much better. As soon as I try to use both earbuds the connection is intermittent at best. I'm not sure if better quality headphones would work better.",
                        "timestamp": "Reviewed in the United States September 15, 2024",
                        "profile_id": "AELFZKXVG3YOZ66UVOOYDOMSPDLA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R35ICI2GUO4J0G",
                        "title": "5.0 out of 5 stars Great functionality",
                        "author": "Dale B",
                        "rating": 5,
                        "content": "Great watch for the price. Provides great data.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AHBOXB6O3AUQYKCMRGR2WM3TL24A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09WTV6MMY",
                "product_name": "Garmin Forerunner® 255 Music, GPS Running Smartwatch with Music, Advanced Insights, Long-Lasting Battery, Black - 010-02641-20",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:46:17",
            "updated_at": "2024-10-17 11:46:39",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252646098274114561",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=2",
                "asin": "B09WTV6MMY",
                "page": 2,
                "pages": 31,
                "reviews": [
                    {
                        "id": "R2ZCKJZ8QDS30C",
                        "title": "4.0 out of 5 stars Bought one when it went on sale. Mostly happy. Frustrating start...",
                        "author": "George in Sonoma",
                        "rating": 4,
                        "content": "Used to a Wear OS watch, but went with a Garmin replacement. It has a battery life of 9+ days (not 14). Some of the setting drove me bananas for the 1st week. Thank goodness I could \"google\" a solution - the worst was every morning it would reset the watch face. But I finally found a face I liked and found a way so it stayed put! Happy now. It took over a week. Worth the effort, as it gives over a week per charge.",
                        "timestamp": "Reviewed in the United States August 11, 2024",
                        "profile_id": "AFHSMKTY7XOU53KTVFQ6FIM35XNQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2VK0UJT3QHLHB",
                        "title": "5.0 out of 5 stars I love mine!",
                        "author": "Connor Scott",
                        "rating": 5,
                        "content": "I use it for running, mtb, and the gym!",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AFSDPJT5PRNZEZ4QIO25ZXMY4HCQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RTLS3TR96KOAU",
                        "title": "5.0 out of 5 stars Moved to Garmin from Fitbit . . . so much happier",
                        "author": "Another Customer",
                        "rating": 5,
                        "content": "This watch is twice the price of a Fitbit Charge 6 (would like to have preferred due to it's small size). However, since Google bought Fitbit, I went through 4 Charge 5s (several replaced under warranty). Tried an Apple Watch but the health metrics are oddly bad . . . heart rate is displayed as an hourly summary. ???Anyway, bought this watch and am very happy with it. Thought the large size would be uncomfortable but I rarely notice it . . . even when sleeping. Health metrics are superior and GPS is awesome (I routinely run without dragging a phone along). Music is a nice touch since it will sync with bluetooth headphones.5 stars . . . thank you Garmin",
                        "timestamp": "Reviewed in the United States July 13, 2024",
                        "profile_id": "AF2VHG3NP2HYS7JFNEPZ6J52IR5A",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3QOJ16C3YCNNV",
                        "title": "4.0 out of 5 stars Nice features but music connectivity issues",
                        "author": "Sarje14",
                        "rating": 4,
                        "content": "The features on this watch are a far upgrade to my previous 2 garmins, the last being the Venu. The only drawback is there is no touchscreen. The watch has one major issue which is the connectivity to headphones are not rock solid. This is something Garmin has to address. I had similar issues with my Venu as well. Changed headphones but experience the same problems of music sticking on occasion (sometimes frequently).",
                        "timestamp": "Reviewed in the United States July 14, 2024",
                        "profile_id": "AFTKYJ4O2RZFKAMLNF5QKGHSEMLA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R275P0SD2BE2OV",
                        "title": "4.0 out of 5 stars Great running watch with plenty of functions",
                        "author": "Zach Smith",
                        "rating": 4,
                        "content": "Love all the suggestions and data, only complaint is the bluetooth is a little spotty with headphones.",
                        "timestamp": "Reviewed in the United States August 16, 2024",
                        "profile_id": "AETVKFP7LTXOUDEZLRC64DL6MIAA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2YDOSADQQM6VL",
                        "title": "4.0 out of 5 stars The watch that finally replaced my Pebble",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "I'll probably go back to my trusty Pebble Time Steel from time to time (no pun intended... that time). You just can't beat that watch.Anyway, this one works well as a replacement, I guess. I'll always miss some things like the fun animations (which I'll never get on the Garmin), or the 2-week calendar on the watch face (which might be possible on the Garmin but I can't figure that out). I don't really need to know my blood oxygen level, or track my runs down to the second, or get a nightly sleep score and a daily morning report, but this watch does all those things.It doesn't look as nice as my pebble, but the screen is bigger. It also doesn't have a microphone, the most underrated feature. Actually, that would be Timeline.Anyway, I miss you, PTS, and don't lose hope. Maybe I'll have it in me some day to replace your battery. Please forgive me.",
                        "timestamp": "Reviewed in the United States April 23, 2024",
                        "profile_id": "AHS4SXC5DOMLFDCP4HQ7Z6EAIJAQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R17WHT2JG9CVNK",
                        "title": "4.0 out of 5 stars Irritates the skin",
                        "author": "Augusto",
                        "rating": 4,
                        "content": "The watch is good, however after using it for some time it irritates the skin, I don't wear it tight nor do I have sensitive skin. The idea of ​​these watches is to use it for as long as possible so that the measurements are better.El reloj es bueno, sin embargo despues de algun tiempo de usarlo irrita la piel, no lo uso apretado ni soy de piel sensible. La idea de estos relojes es usarlo el mayor tiempo posible para que las mediciones sean mejores.",
                        "timestamp": "Reviewed in the United States June 13, 2024",
                        "profile_id": "AFFIOQAVOSFP7WFB6QF4MCY6ADPQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RF04BRPBAWU7P",
                        "title": "5.0 out of 5 stars Best fitness watch I've owned",
                        "author": "Aaron Weininger",
                        "rating": 5,
                        "content": "Not a lot of smart watch bells and whistles but when it comes to running analytics I've never owned anything better! The GPS is super accurate and uploads straight to Strava if you want to get your kudos 😁",
                        "timestamp": "Reviewed in the United States August 9, 2024",
                        "profile_id": "AEZA4AOZGPPQOSYAH2WUDXECS44A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R250TX9OSLRF7R",
                        "title": "3.0 out of 5 stars Decent running watch but prefer my Coros",
                        "author": "Kurt A. Rompot",
                        "rating": 3,
                        "content": "I previously owned a Garmin 245 Music. But the buttons on it (particularly the bottom left one) began sticking despite how often I cleaned it, which was super annoying. My main running watch is now a Coros which I highly recommend. But sometimes I like to listen to music which my current Coros doesn't support, and I don't like carrying my phone with me. I was able to get this Garmin 255 Music on clearance otherwise I probably would have gone with a newer Coros. Hopefully I don't have the same button issue, only time will tell. The one thing that is super annoying is that it often has trouble connecting to my Jabra Elite Bluetooth earbuds. That one issue has almost made me swear off Garmin for good.",
                        "timestamp": "Reviewed in the United States August 24, 2024",
                        "profile_id": "AF6EAIPDB3PO6NPIFYDJJIWNHC3A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RVT6M538ADM94",
                        "title": "4.0 out of 5 stars Versatile Watch",
                        "author": "Gary P.",
                        "rating": 4,
                        "content": "Great for tracking work outs & races. Links to my phone with no problems.",
                        "timestamp": "Reviewed in the United States July 8, 2024",
                        "profile_id": "AFZHTWN65CI5QBVJHCFPDRJRYZYQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09WTV6MMY",
                "product_name": "Garmin Forerunner® 255 Music, GPS Running Smartwatch with Music, Advanced Insights, Long-Lasting Battery, Black - 010-02641-20",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:46:17",
            "updated_at": "2024-10-17 11:46:40",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252646098274114561",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=3",
                "asin": "B09WTV6MMY",
                "page": 3,
                "pages": 31,
                "reviews": [
                    {
                        "id": "R2Z1MGS3NN3PKR",
                        "title": "5.0 out of 5 stars Light and comfortable.",
                        "author": "sun",
                        "rating": 5,
                        "content": "Everything I need as a runner",
                        "timestamp": "Reviewed in the United States August 18, 2024",
                        "profile_id": "AEJZVWT6CCAPVEW55BKQHJ4WK56Q",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R33TPXE9CG0BDR",
                        "title": "5.0 out of 5 stars Perfect for what i need and more",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "This watch is great for running and cycling (i have not swim with it yet bit im sure it will perform as intended). It fits great on my wrist and it is confortable, considering I have skinny wrist. I enjoy the stats and data it provides, specially the workout suggestions. I was not interested on the workout suggestions, however i did noticed that its recommendations are based on your saved work outs. The battery seems to last a considerable amount of time i have charged it once per week(i run 3-4 times a week for at least 40 minutes with the gps on). Lastly, it charges quickly, i would say an hour and a half to reach full charge.",
                        "timestamp": "Reviewed in the United States May 26, 2024",
                        "profile_id": "AHY3EKB7DPXS43O75AE4RHVALTRA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2FCL4YT0XEU8C",
                        "title": "5.0 out of 5 stars LOVE this upgrade from my 245M",
                        "author": "Vleyson",
                        "rating": 5,
                        "content": "Great watch! I run about 3-5 marathons a year and was more than happy with my older Garmin 245M and decided to treat myself to an upgrade and what an upgrade it is! Great seller - arrived sooner than expected which is always great!",
                        "timestamp": "Reviewed in the United States July 19, 2024",
                        "profile_id": "AGY4Z6CYLHZHCJO47GZR3N5JVEEQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R1ISOVK68Q9J5R",
                        "title": "4.0 out of 5 stars CABLE DE CARGA NO SIRVE",
                        "author": "Boris Maurette Cabre",
                        "rating": 4,
                        "content": "ACABO DE RECIBIR MI RELOJ GARMIN FORERUNNER 255, TOD EN PERFECTO ESTADO PERO EL CABLE DE CARGA DEL TELEFONO NO SIRVE, HE TENIDO QUE PEDIR UN CABLE PRESTADO A UN AMIGO PARA PODER CARGAR EL RELOJ, MI AMIGO PROBO MI CABLE DE CARGA EN SU RELOJ Y TAMPOCO LE CARGA EL RELOJ, COMO ME PUEDEN APOYAR ENVIANDOME UN CABLE NUEVO, PORQUE DE LO CONTRARIO TENDRE QUE DEPENDER DE TERCERAS PERSONAS PARA CARGAR MI RELOJEN ESPERA DE SU COMUNICACION Y AYUDA GRACIAS",
                        "timestamp": "Reviewed in the United States April 1, 2024",
                        "profile_id": "AGUKBVFR5XPSBYO7LEOS4DYG5VKQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R1HGQPCEGUGIFY",
                        "title": "5.0 out of 5 stars Avid Runner Loves This!",
                        "author": "Skye Baron",
                        "rating": 5,
                        "content": "My husband bought this after his Apple Watch, since it is more exercise focused. He has loved it thus far. The distance on his runs is much more accurate, it is waterproof, has sleeping insights, and battery lasts a long time! I still need some convincing to move from my Apple Watch, but for the regular exerciser, this watch is great!",
                        "timestamp": "Reviewed in the United States June 30, 2024",
                        "profile_id": "AHDE4L2K73LGS7ECPDHY3Q4W3V4A",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R34FI521GR6F0",
                        "title": "5.0 out of 5 stars Great product",
                        "author": "O.G",
                        "rating": 5,
                        "content": "Great product. Great features. Just what I was looking for",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AF5FE7DLPJLZ3BD3LA6OBMRZEUBQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RCXVH6TK68CX3",
                        "title": "5.0 out of 5 stars Best. Garmin. Ever.",
                        "author": "Andrew Buikema",
                        "rating": 5,
                        "content": "Great running GPS watch. One of my most favorite Garmin watches that I’ve ever had. Definitely a must buy with all the options.",
                        "timestamp": "Reviewed in the United States July 22, 2024",
                        "profile_id": "AF5QV4BRCUVUR74EQ3HJS23ZUHDQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RIOD4V9A0J7IY",
                        "title": "5.0 out of 5 stars No complaints",
                        "author": "KingDom",
                        "rating": 5,
                        "content": "At the least I track my sleep. At the most I use it to track my ruck marches. If in the military, highly recommended purchase. 10/10.",
                        "timestamp": "Reviewed in the United States July 12, 2024",
                        "profile_id": "AEO5WTA7KNPD2MMWAOAEJLH2KS4A",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R37SXID3QACS1O",
                        "title": "5.0 out of 5 stars After you figure it out it’s great.",
                        "author": "Ken C",
                        "rating": 5,
                        "content": "Have had Apple Watch’s for years and wanted a change. A bit of a learning curve but that was fun",
                        "timestamp": "Reviewed in the United States July 18, 2024",
                        "profile_id": "AF5GQINK6RULTSKVQMM2OEBORJVA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2HI8CA2STVCJG",
                        "title": "3.0 out of 5 stars UI not intuitive",
                        "author": "Amazon Customer",
                        "rating": 3,
                        "content": "Idk what all the hype is about. The 235 had a better UI. They need to let people who actually RUN design the UI.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AGE63MV464WVSRG7WMGRGP2VF5MA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09WTV6MMY",
                "product_name": "Garmin Forerunner® 255 Music, GPS Running Smartwatch with Music, Advanced Insights, Long-Lasting Battery, Black - 010-02641-20",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:46:17",
            "updated_at": "2024-10-17 11:46:41",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252646098274114561",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=4",
                "asin": "B09WTV6MMY",
                "page": 4,
                "pages": 31,
                "reviews": [
                    {
                        "id": "R2K70WTOHB17N9",
                        "title": "4.0 out of 5 stars Love the morning reports and exercise suggestions",
                        "author": "Dangelo Guanipa",
                        "rating": 4,
                        "content": "First Garmin I own and I love it. I can leave the phone at home, still track my workout accurately, and listen to music. It has a nice morning report that includes your sleep quality, gives you daily recommendations for workouts, and tracks lots of data from your running workout.The only con is the screen, coming from an AMOLED device the Garmin screen feels like a downgrade, but after getting used to it's fine",
                        "timestamp": "Reviewed in the United States December 23, 2023",
                        "profile_id": "AES45LZQKEFS7DQPUS42RTHJDGHQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RNXMPFY5NBBXB",
                        "title": "3.0 out of 5 stars Difficult to use",
                        "author": "M&M-L",
                        "rating": 3,
                        "content": "Confusing interface, difficult to use. Hard to figure out a lot of the basic functions. Music can be transferred from your PC but you have to download a Garmin App onto your PC and, virtually none of your iTunes music will work because it's protected. I was only able to transfer 6 of my many hundred purchased iTunes songs. Audible books can't be transferred at all. Display is too small and too dim to read in most indoor settings. To use a map and to see the route you took, requires downloading a third party app - good luck figuring that one out. The best thing I can say is that the watch collects a lot of great data and stats which you can easily view on your phone. The battery life is the only reason I purchased this instead of an iWatch.",
                        "timestamp": "Reviewed in the United States January 6, 2024",
                        "profile_id": "AGDN4BTQZOH6BY654752WUAVC4TA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RFRYN0HV5EPFS",
                        "title": "5.0 out of 5 stars Best smart watch",
                        "author": "Alfred Dantes",
                        "rating": 5,
                        "content": "Runner, cyclist and workout buddy.Garmin coach for the win",
                        "timestamp": "Reviewed in the United States May 30, 2024",
                        "profile_id": "AE7O7TWY3CKLMYOEJSM2FWTQ27QQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R20D7GYHWMHXZV",
                        "title": "5.0 out of 5 stars My son really likes it ! His favorite gift - ever!",
                        "author": "Erin A Hermes",
                        "rating": 5,
                        "content": "I bought this for my son and he really likes it! He even stayed it was his favorite gift - ever! Highly recommend!",
                        "timestamp": "Reviewed in the United States April 21, 2024",
                        "profile_id": "AEQB4XKPXRUI6IAHTM2ADJZW3ESA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2SP6W44QV47M7",
                        "title": "5.0 out of 5 stars Love my new Garmin",
                        "author": "James",
                        "rating": 5,
                        "content": "This is the Tech toy that is a for the workout addicted or the occasional user. I'm starting back on my exercise routine after a decade off. My old Polar and Moto watches no longer do what I want. This Garmin quickly finds GPS, tracks my movements, speed, pace, HR, Pulse Ox, HRV, and more things I just don't use every day. Still learning how to get the best out of it, but it seems to always have available what I want to try today. In normal operations I am getting 4 to 5 days of battery life. There is minimalist power saving mode that advertises about a month of power. My Moto was good for three hours, my Polar lasted a day, this is great.",
                        "timestamp": "Reviewed in the United States March 16, 2023",
                        "profile_id": "AEJPD6VTVDHHM5FE5ZXA7CYSQJPQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R4EZUIB9FD2D0",
                        "title": "5.0 out of 5 stars I love the music feature",
                        "author": "James Chappelle",
                        "rating": 5,
                        "content": "I liked every thing about it. And the battery life is unbeatable",
                        "timestamp": "Reviewed in the United States April 22, 2024",
                        "profile_id": "AFAOW3H7VGJGLKWV2GFZJSMVS4SA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2PNJ4HVU695IP",
                        "title": "5.0 out of 5 stars I love this watch! Very functional and stylish!",
                        "author": "Matthew S. Ryder",
                        "rating": 5,
                        "content": "I wear my Garmin watch all the time. I like all the different functions. I track my running, biking, elliptical, and free weight exercises. It also track the quality of my sleep lung functional. There is so much that this watch can do that I could write a book. The bottom line though is that it helps to alert me to changes I need to make health wise in my life, like getting more sleep, or more recovery from a strenuous workout. It also gives suggestions on what exercise routines I could do each day. I only take it off to charge it when I get ready for work in the morning and I've never had it die on me. Great addition to my life!",
                        "timestamp": "Reviewed in the United States May 16, 2023",
                        "profile_id": "AFMRNJX44TQKBLZF2XE5W4R4CVXQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3E1JJEHDT55AA",
                        "title": "5.0 out of 5 stars Good for value",
                        "author": "Jose",
                        "rating": 5,
                        "content": "It is a great Watch if you want more metrics of your runs, would recommend to buy with discount and you won’t regret about it! With Music or not that would be on your preference. I choose Music version because it is better to have the option for any future case.",
                        "timestamp": "Reviewed in the United States January 1, 2024",
                        "profile_id": "AFQ3HMG7CTHBIEPAPGWL6JGLBCOQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3ES905QQR6V3N",
                        "title": "3.0 out of 5 stars Push buttons to scroll don't like that operation.",
                        "author": "Robert S Cooley",
                        "rating": 3,
                        "content": "The most important thing is to let the public know that you cannot scroll if you want the watch to move you have to push the button manually. I just don't like to push buttons for it to scroll.",
                        "timestamp": "Reviewed in the United States April 9, 2024",
                        "profile_id": "AG4PHNJHSVBVMNTM65G6VEF3VZYQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R1OZJPI7PT64BT",
                        "title": "4.0 out of 5 stars Slight learning curve/ WiFi issue",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "With all of the functionality this device offers, it’s no wonder that there is a little learning curve. Don’t be intimidated. You should see most of the functions within about a week of use. Still can’t get it to connect to my WiFi but I will debug that later.",
                        "timestamp": "Reviewed in the United States July 21, 2023",
                        "profile_id": "AEIVZJSQ3LOHOZ2QV7G37TXBAIXA",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09WTV6MMY",
                "product_name": "Garmin Forerunner® 255 Music, GPS Running Smartwatch with Music, Advanced Insights, Long-Lasting Battery, Black - 010-02641-20",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:46:17",
            "updated_at": "2024-10-17 11:46:42",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252646098274114561",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=5",
                "asin": "B09WTV6MMY",
                "page": 5,
                "pages": 31,
                "reviews": [
                    {
                        "id": "R23KF9OQZOIU78",
                        "title": "1.0 out of 5 stars Worked Great until it didn't",
                        "author": "Baja Kids",
                        "rating": 1,
                        "content": "I really loved this watch and switched from the Whoop band to the Forerunner 255 to avoid subscription fees and enjoy the additional features. I purchased the watch in March 2024 and also bought Asurion insurance. However, in August 2024, the watch stopped working while I was swimming in the ocean. It simply turned off, and when I managed to turn it back on, the screen displayed colored lines.Asurion couldn’t replace the watch because it was still under Garmin’s warranty, leaving me to deal with Garmin directly. I preferred Asurion’s service, as they would have provided a replacement within two days. Garmin’s process has been slow; I’m currently in my second week without a watch and expect to receive a replacement in another week. Being without my workout tracker for three weeks is unacceptable to me. I took good care of the watch, and it had no damage. I’m disappointed to have spent $400 on something that lasted only five months. I am giving it only one star as I see in the reviews this is common with these watched.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AGKNNKPLNDEH56NFFUCB3VUXEL5A",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R1YV2X5VKZDK8",
                        "title": "4.0 out of 5 stars Good",
                        "author": "heziyev",
                        "rating": 4,
                        "content": "Good in general. I have been using for a while and not seen any problems",
                        "timestamp": "Reviewed in the United States October 23, 2023",
                        "profile_id": "AEK6LE76RPX5RH26D6ATKEY4DEBQ",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R1RKG2ZOYIOQ94",
                        "title": "5.0 out of 5 stars El reloj no le duraba la bateria como esperaba",
                        "author": "Mariano",
                        "rating": 5,
                        "content": "No me agrado que al reloj no le dure la bateria los 12-14 dias que promete en un uso cotidiano... No lo use en modo deporte, ni gps, ni con musica... Simplemente lo tenia conectado al movil para tener las notificaciones... Lamentablemente se drenaba un 30% de la bateria de golpe, lo comprobé 3 veces cargandolo y usandolo de esta forma por 3 semanas más y me pasaba lo mismo... Debe ser que venía con alguna falla el reloj, sin embargo, pude devolverlo sin ningun problema... Sin dudas alguna volveria a comprar un Garmin fuera de este inconveniente, me encantó el sofware para deportes! (Dejando de lado el inconveniente con la bateria)",
                        "timestamp": "Reviewed in the United States February 3, 2023",
                        "profile_id": "AEX2ZU4UBFELRIEMS6MATFJLKT3Q",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R2JDT7WSML6QHE",
                        "title": "5.0 out of 5 stars I didn't miss any features on my Garmin Forerunner 245",
                        "author": "Emilio Jr Albarando",
                        "rating": 5,
                        "content": "Perfect size. The main task on this watch is simply my running partner of at least 3 times a week for 15 miles or more.",
                        "timestamp": "Reviewed in the United States February 2, 2024",
                        "profile_id": "AGVGZ7V47YMUHVUKHXDFAS3GBX5Q",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3EEO3VEHDA622",
                        "title": "3.0 out of 5 stars update testing with garmin -This watch has some serious problems-",
                        "author": "J. Ducroiset",
                        "rating": 3,
                        "content": "I purchased the watch a about 2 months ago, I am having terrible battery life. I go to sleep watch at 75% wake up at 15%. I purchased the watch for the battery. Also it seems I have been doing a lot of stair climbing, the watch keeps giving me 10 flights sometimes before I get out of bed. I have heard other people who had this problem. I had a forerunner 245 for 3 years and never had these problems. The battery life is erratic, sometimes lasts sometimes dies. I would say I average maybe 5, 10 flights a day. I walk into my kitchen in the morning all on one level and the watch says 10 floors. It pisses me off I cannot see battery duration.Spoke with Garmin they added a log to my watch, I also took some third party apps off so far battery has been better, I will see it has been like this before.",
                        "timestamp": "Reviewed in the United States November 15, 2022",
                        "profile_id": "AHRBZJ2CXC4CI5V4PE4PLJNVO73Q",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RY7DDTKIO8SXR",
                        "title": "5.0 out of 5 stars Ultra distance capable with GPS and music",
                        "author": "harbink23",
                        "rating": 5,
                        "content": "This is a great upgrade in batter life and GPS accuracy",
                        "timestamp": "Reviewed in the United States February 2, 2024",
                        "profile_id": "AFMIQ64LSY7U46C7HYYQFQZFNM7Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3VR6AB03AG6SV",
                        "title": "3.0 out of 5 stars Problem with buttons",
                        "author": "Harry",
                        "rating": 3,
                        "content": "This was reported by other users online too. In my case it's the down button on the left. It gives you this two step click feel, really annoying. The other 4 buttons are smooth, so this is obviously a defect. Hope Garmin can improve the quality in the future. I can't tolerate it but I like the watch. So I'm getting a replacement and see if I get lucky.--- edit ---Got another watch this time it's the back button that has this strange click feel. I decided to keep the watch. Battery goes down about 5% every hour if you turn on GPS tracking. So 20 hours for a full charge. I don't use music because it's a battery drainer. Charging is quick. I didn't count exact time but it's around 30 minutes charge to full from 20%.",
                        "timestamp": "Reviewed in the United States December 7, 2022",
                        "profile_id": "AHA6NWRVD5NK6OGKVIGGHKOXQ66A",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RF95USLUZSXV9",
                        "title": "5.0 out of 5 stars Great freaking watch!",
                        "author": "EagleJoe",
                        "rating": 5,
                        "content": "This watch is wonderful. Great display. Awesome functions for workout and vital monitoring. And it's super comfortable with a long battery life. I charge it every 5-6 days. I'm very happy with this Garmin watch.",
                        "timestamp": "Reviewed in the United States October 3, 2023",
                        "profile_id": "AHH3D4RPTTFMZJZICYH3GILGH45Q",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "RV4CSL0Y5S6XP",
                        "title": "5.0 out of 5 stars Followup to review by Milesian",
                        "author": "Xak",
                        "rating": 5,
                        "content": "One important followup to the review by Milesian: The watch does NOT require the Garmin Express app in order to load music onto the device. You can set the watch to MTP (Media Transfer Protocol) mode by holding the UP button, select System, then USB Mode set to MTP. You can then connect to any computer with the included USB cable and then drag-and-drop MP3 files onto the device (this should work on any OS; I have tested on Windows and Linux, and it should also work on Mac).",
                        "timestamp": "Reviewed in the United States October 3, 2022",
                        "profile_id": "AGCGH6IM2YTTWDQFVUX7LED3ARKQ",
                        "is_verified": true,
                        "helpful_count": 23,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    },
                    {
                        "id": "R3MZ7SFACMOMSL",
                        "title": "4.0 out of 5 stars Garmin Forerunner 255 music",
                        "author": "John Smith",
                        "rating": 4,
                        "content": "The item arrived before the delivery date in great condition and working as expected thus far.",
                        "timestamp": "Reviewed in the United States June 3, 2023",
                        "profile_id": "AGHSR7TTTFW66IWG6TRD7NGXMJHQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: BlackSize: 46 MMStyle: MusicPattern Name: Smartwatch"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B09WTV6MMY",
                "product_name": "Garmin Forerunner® 255 Music, GPS Running Smartwatch with Music, Advanced Insights, Long-Lasting Battery, Black - 010-02641-20",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:46:17",
            "updated_at": "2024-10-17 11:46:43",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B09WTV6MMY?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252646098274114561",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:46:17",
        "domain": "com",
        "geo_location": null,
        "id": "7252646098274114561",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B09WTV6MMY",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:46:43",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252646098274114561",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252646098274114561/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252646098274114561/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252646098274114561/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252646098274114561/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}