{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0B4N6B93J",
                "page": 1,
                "pages": 271,
                "reviews": [
                    {
                        "id": "R2CNZZW7T3LP11",
                        "title": "5.0 out of 5 stars Make sure you have the latest version of the fitbit app",
                        "author": "Jason",
                        "rating": 5,
                        "content": "When I first got this, it would not maintain sync. I updated the firmware on the watch, tried doing a factory reset twice, uninstalled/reinstalled the fitbit app twice, ensured that the app wasn't allowed to go to sleep when in the background... nothing worked. It would work for a few minutes, then when I tried to command Alexa, it would say connection lost. I decided to contact support, and they informed me that my app was outdated. Come to find out, version 4.04 of the bitbit app is too old, and will not work. The latest version, 4.06.7 had not been released for my phone yet, as is typical ridiculous play store behavior. Google... are you listening? When a developer releases an update, you shall IMMEDIATELY make it available to EVERY device! I manually downloaded the apk and installed it, and everything has been working great since. Alexa follows my direct orders immediately, phone calls come through, texts come through, and I can sync with ease.Overall, I suppose this is an improvement over the Versa 2. Screen is a little bigger, but the notification vibrations don't seem to be as forceful, even when set to strong.This uses google wallet instead of google pay as the Versa 2 did, so my AmEx will not work for contactless payment.Phone call feature is nice, seems to work OK. I can hear them, they can hear me. You can only answer calls, you can't make them. The $50 brand x watch I ordered to replace this one before I got the sync figured out was able to do that. It could also control my camera and music player, neither of which is possible on the Versa 4.Google maps is nice if you walk in unfamiliar areas. I'll probably never need it, but it's nice.Battery life seems to be improved over the Versa 2, but mine was 2 years old so I'm sure the battery had gradually decreased it's charge capacity. I used it for several days, and he battery was still at 55%.Skin temperature sensor will one day be nice when it can sync with a smart thermostat and automatically adjust the temperature as needed. But for now, it's just a novelty and has no purpose. Yes, I know my skin is hot. I woke up in a puddle of sweat. Yup, I'm freezing, so my skin is cold.o2 saturation is nice if you have any relevant health problems.If you want to take full advantage of the watch, get the free \"Overview\" clock face by Chris Blyth. It gives you current and average heart rate, battery percentage, fully customizable date format, allows for a larger clock that shows seconds, and you can have weather, and 6 other health stats displayed on the main screen, all at once. I have steps, distance, calories burned, active zone minutes, floors, and BMI/BMR. It all fits, and is easy to read. Vast improvement over the default face, which shows no useful information. I had th is face on my versa 2, and loved it. So glad it's available for the 4.Bottom line, it's a good watch. There are cheaper brand x ones out there, but none of them have NFC payment, and not all of them have Alexa. And, you get what you pay for. fit & finish feels cheap, the screens get washed out in the sun, finicky alexa integration and so on. Best to pony up and get a refined product. Be sure to update your fitbit app. Their customer support said the latest version should be released within a week, but I circumvented the beurocracy and downloaded it manually. Why wait?",
                        "timestamp": "Reviewed in the United States December 23, 2023",
                        "profile_id": "AHDAEAFXQ7JNZARCFTXVUBU7SCTQ",
                        "is_verified": true,
                        "helpful_count": 363,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R1S6RQPUCT34TV",
                        "title": "5.0 out of 5 stars Really Very Good",
                        "author": "Maria",
                        "rating": 5,
                        "content": "Use it constantly, worth every penny.The charge lasts over a week and it gives a low battery warning at 35%, meaning it NEVER does unexpectedly in the middle of the day.It's definitely waterproof (wear it in the pool or shower all you want).Sometimes I have some trouble getting the GPS to work but strangely only for biking?Loved it enough that I also bought my husband one and he used even more than I do.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AEUMB6YIKYBYGQB4ICPVSG2E73LQ",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R34DQEFQ5UT1DM",
                        "title": "4.0 out of 5 stars It works well but not in extreme cold conditions.",
                        "author": "JV",
                        "rating": 4,
                        "content": "This is my second purchase. It works well with my IPhone. I can measure my steps, heart rates and keep tracking my sleep scores well. I also can receive all messages before grabbing the phone. A little bit of splash water okay. The first one didn’t do well with extreme cold weather, -25c. I wore it in the snow storm and noticed later that the function had been changed especially the shorter battery. I give it another try and overall is great.",
                        "timestamp": "Reviewed in the United States October 3, 2024",
                        "profile_id": "AH226FEUJXDMLOFHDZDQWICAGVWQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R2D0Q988HGHJ8C",
                        "title": "5.0 out of 5 stars Pretty much love",
                        "author": "Sj",
                        "rating": 5,
                        "content": "I had a Samsung Active 2 watch that finally died on me. I thought that watch was pretty awesome, but hated that it had to be charged every other day, so I decided I was going to get something different.. and then I got thiswatch.. I get about 11 days with gps. Sooo nice!The Versa 4 has me pretty much in love.All of the things that this watch can do is just amazing. I got it to monitor health, track my steps, and routes.. it does so much more. It's missing a few things, but I can live without them.Talking on it was cool for a minute, kinda felt like inspector gadget, but I'd rather just use my phone.. lol.I really wish it was linked to my alarms on my phone.. I got used to being able to hit snooze from my watch. The alarm on my Versa is a very dull vibration that I can't even feel.. kinda useless for waking me up. I think the steps are off a little bit, but aren't they all?!I miss having YouTube Music linked, so I could control what my earbuds played.. but it's ok. All of the perks that this watch offer really outweigh the 2 or 3 things it doesn't do.The band is super soft, and doesn't irritate my skin at all, which had me concerned, because I have sensitive skin, and seen that some people had issues.It was super easy to add the Fitbit app onto my Samsung phone and get everything set up.I decided to try the premium for the free 6 months, and I'm pretty sure I'll keep it.. I like all the extra stats that are available, and $79 a year isn't bad. I mean, I pay $13.99 a month for no commercials on YouTube, so.. there's that.When you get everything all set up through your Google account you're offered a 2 year warranty on your watch for $29.99 that covers all sorts of stuff.. enter in the serial number and it's done.Great color, stays synched, nice big screen that I can see even in the brightest light, and it does everything it's supposed to.great price.. I got it on Prime Day.",
                        "timestamp": "Reviewed in the United States August 3, 2024",
                        "profile_id": "AFOHYQIEVR5VM5YZDRDHYTJL4XAQ",
                        "is_verified": true,
                        "helpful_count": 36,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "RDTLVMFFRLA29",
                        "title": "5.0 out of 5 stars Not even on year",
                        "author": "Stephanie S",
                        "rating": 5,
                        "content": "Update… after talking with customer service thorough Fitbit… I’m sending my watch to them for a replacement. Customer service was awesome.I purchased this watch December of 2023 and as of August 2024 it quit working. I’ve been buying Fitbit products for over 8 years and upgrade about every 2 and so bummed this one didn’t last. I’m not sure what to get now.",
                        "timestamp": "Reviewed in the United States August 24, 2024",
                        "profile_id": "AFX6JEIUBXI7MU5DY7DJWJJNRENQ",
                        "is_verified": true,
                        "helpful_count": 17,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "RNUXVFTTG6QEA",
                        "title": "5.0 out of 5 stars Handy",
                        "author": "Lisa",
                        "rating": 5,
                        "content": "Bought this for my husband, but I've been using it. I love, love, love it! I am now lost without it. The look is also great!I love the quality of it. I can wear it while swimming. It is waterproof. You do need to put it on \"swimming\" mode so it will waterproof itself.It charges quickly and lasts for a good week. I like how it keeps track of my sleep, my heart rate, my steps, all the performance you're looking for in a \"watch\" and then some. The screen is easy to read. I love the calm feature.It's also easy to set up. Just know, you need to purchase. It's a great piece. You'll love it!! Get it!",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AECYZLXF45I5HNQ4SC4OEZGM7XKQ",
                        "is_verified": true,
                        "helpful_count": 12,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R3A8MZTXYT38L2",
                        "title": "5.0 out of 5 stars Need to pair with Premium subscription for all functions",
                        "author": "MarkM",
                        "rating": 5,
                        "content": "Works great, bright screen, I get 8 to 9 days on a single full charge, offers many helpful features with the premium subscription ($59.00/yr?). The sleep function is interesting and I do believe accurate, if I feel I slept good, the watch confirms. It monitors your activity level and adjusts how to recommend exercise for each day. All important info can be viewed on the watch, other less critical info is on your phone. Allows for variety of fitness goals to be set, daily and long term. All in all, I would buy it again.",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AFEH4EX2ZI5CAIM6AVGX57V4SOXQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R1BRAMONGPW9VS",
                        "title": "3.0 out of 5 stars Overall good excecpt the heart rate tracker - which is important",
                        "author": "Ross Smyth",
                        "rating": 3,
                        "content": "If someone asked me whether I like this watch or not, I would say that I like it. It is simple and the interface is decent. I do not want a watch that attempts to replace my phone, but rather one that complements it. I think that the Fitbit Versa is a good choice for this. It tells me notifications, tracks sensor telemetry, tracks my physical state, and has decent battery life. These are things that my phone cannot easily do.Other smart watches such as the Samsung Galaxy Watch do too much. I don't really care that I can reply to texts, browse the web, or essentially replace my phone. I always have my phone on or near me. If I am too busy to reply on my phone then I also wouldn't reply on my watch, an only worse experience because they try to cram a full QWERTY keyboard on it.I bought the Fitbit Versa 4 because one of my requirements is that the watch I use has Google Pay on it. It does not at release, but I'm fine with it coming later as it is not an immediate requirement. I also assumed that the fitness tracking on Fitbit would be good because Fitbit is basically the oldest consumer tracker company I know of, so I guessed it probably works well.Comfort - 9/10The strap that it came with is quite comfortable. I do not wear watches, primarily because the ones I have tried were not very comfortable. This watch and strap is pretty good. I've only had one day tuning the tightness and position where it was uncomfortable and that was my fault as it was too tight. I also like that it is small and light. I mostly forget it is there, and am comfortable sleeping it with.Update Nov. 5th 2022: After about a month of wearing it almost 24/7 I have some irritation. Also if I sleep with it and put weight upon the watch band (the watch face going down in to the bed) I will wake up with a lot of irritation.Interface - 7/10The interface is mostly intuitive. It is not that clunky as some smart watches I have seen in the past. The main thing I do not like and I didn't quite get at first was that the apps list is found by pressing the button. I didn't know how to use the alarm the first night because of this. But overall it works. It is mostly responsive, but sometimes not if it is rendering many things in the interface. I can forgive this as it is not a super powerful watch. I am happy with this.Battery life- 8/10One of the primary things that I want in a smart watch is a longish battery life. The more general smart watches' battery life is not that great. This one lasts about 3 days with the always on display turned on, which I am happy with. I will try it with the always on display off to see how it lasts. With sleep mode on it drains about 10% battery over 8 hours.Update Nov. 5th 2022: With display not on always-on, then it lasts about 7-9 days depending on how much I exercise.Sleep Tracking - 10/10I am quite impressed with the sleep tracking. I don't have to tell it anything. It just knows that I am sleeping and tracks it. Even random naps that I take in the evening. I do not know the times I fall asleep, but it is always on the exact minute I wake up. Good job on this, and I quite like it. As for the oxygen saturation tracking, I have nothing to compare it against so who knows, it could be made up for all I know.Heart rate - 3/10Oof, this is not good and I am quite disappointed with. During the day at work and home it seems to be fine. This is good for capturing my resting heart rate which I am interested in. But during workouts it is basically useless. I have worked out 3 times with it since I got it, and it is just wildly inaccurate. The only thing it is good for is using the workout timer to count my pulse manually. While doing some spinning in the gym I consistently measure my pulse at 170-180 BPM, but this thing is measuring as low as 90 BPM to 160 BPM, usually ranging in 130-150. I can forgive being off by 10 or so BPM, but this is just wild. Once my heart rate goes about 140 or 150 it just becomes useless. It will vary by 10 BPM each measurement, vibrate warning my heart rate is not in \"the zone.\" Well that sucks. I bought this thing specifically so that I could track my workout, hoping because Fitbit is a well known brand that it would do this specific thing well, and it does not.Other -I like the alarm, but I think all watches do something like that. I use the weather occasionally, and the timer is fine. I would prefer that it sets the timer, and allows me to actually start it rather than automatically starting when I lock-in a time, but that a minor gripe. The phone interface is good, and I think that it summarizes the telemetry pretty well. I also like the default watchface, and have not changed it.Update Nov. 5th 2022: I did not realize this before, but the alarm only alarms for like 20 or 30 seconds before turning off. This is fine some times, but other times I need way more effort to wake up. I have no seen a way to configure this. I would prefer that it alarms until I turn it off.ConclusionIf I can find a smart watch that is similar size, as I do like that this one is small and light, I may replace it. Mainly because of the heart rate tracking. But I am very impressed with the sleep tracking, and i like the battery life and comfort so I am going to stick with it for now. I hope that heart rate tracking can be fixed with a software update, because I do want to like this watch.",
                        "timestamp": "Reviewed in the United States October 9, 2022",
                        "profile_id": "AE4NDWU7OSCQEU7KAT3REVQOF64Q",
                        "is_verified": true,
                        "helpful_count": 701,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R16U22A723J0CL",
                        "title": "4.0 out of 5 stars Few Improvements, More Restrictions",
                        "author": "Jessica",
                        "rating": 4,
                        "content": "The media could not be loaded. *I'm a Fitbit Versa 2 owner, going to Fitbit Versa 4 I have been using this new watch since late Decemeber*BATTERY:Seemed fine to me. I'm not a person that doesn't ever charge my watch though. I always charge it when I shower. The charger is WAY better than Versa 2's charging cradle. No more fiddling around with it, dreading the \"not enough power\" error. This sits right on top of the charger.APPS:-- There is no music support-- they have the \"find my phone\" app. Works like it should.-- THERE IS NO CALCULATOR APP! WHY!?!-- no 3rd party supported apps. Whatever you have already installed is what you get. You can't get ANY other apps other than preinstalled. No notes app, no calculator, no memos, NOTHING. Hugely disappointing!!! Why would they do this?GOOGLE:--Google wallet is great and very easy to set up. You don't have to have the google wallet app on your phone to set it up; it's all through fitbit.NAVIGATION:Navigation works....but I don't think I would use it when you're driving. It's just not as easy to glance at or give as much detail as your phone will. You can have both your watch and phone navigating at the same time. I thought it might vibrate when to indicate an upcoming turn or something but it doesn't.DISPLAY:Crisp, clear display. Touch screen is very reactive, as is the button on the side. The watch is supposed to come on when you lift your arm, but this is very fidley and I find it only works half the time.CALLS:Calls are fantastic. You can hear clearly and be heard just as well. You can't make calls, only accept them.CLOCKS:-- I was disappointed to find that my Fitbit Versa 2 clocks would not be compatible with Versa 4. Honestly, I'm not sure why Fitibit doesn't have a fully customizable clock face, with custom settings and custom pictures. No, they leave that for other developers to figure out. I loved using Maxim clock faces, as everything could be customized (stats,colors,time, placements, and photo). No such luck here. There are a lot of options, and I did find one suitable for me. Should be offered by Fitbit themselves though. They have to know that most people want a personal picture on their device. If you are just looking for a cool background, there are tons to choose from.I found a photo clock that worked for me named Photo 2 by Wim Van Aerschot. There's a free version and a Premium versionPROS:-- Slim, lightweight-- No trouble syncing-- Google wallet is 1000x better than fitbit pay, which only supports certain banks. None of my cards (sam's club visa, capital one credit/debit) worked with fitbit pay. They work perfectly with google-- While you now have \"tiles\" that show your apps one by one as you swipe left or right (On versa 2 you swiped down and selected from a list) isn't as user friendly, you CAN rearange the tiles how you please. And you can add shortcuts via long press of the button, if you want. You can also choose to hide tiles you don't want.-- Calories burned seems very accurate. They reflect my suggested metabolic rateCONS:-- The style of the band is odd. The material is great, but for some reason they thought it would be wise to tuck the extra bit UNDER the band, not on top. It isn't irritating like I thought it would, but it makes it a big pain to take off and put back on. The extra bit also means you might have to readjust size because the extra bit is tighter on your wrist. It leaves marks on your arm. Even most off brand bands still feature the \"under loop\" fastener, but you can buy silicone \"band keepers\" that slip right over the band, allowing you to fasten as normal.-- Lost Calories. For some reason, I have LOST calories, particularly after syncing or charging. I've lost 200-300 cal this way. Very irritating and it can make a huge difference if you are in a calorie deficit. I haven't had it happened since, but worth noting.--It doesn't show calories eaten on any of the tiles. Furthermore, the \"calories left\" on the \"today's tile\" does NOT reflect calories eaten. Previously in the Versa 2, the Fitbit app would show how many calories you have left in that moment of time, whereas the watch would show how much you had left based on predicted calorie burn for the day. This watch only shows calories left to burn, based on your chosen \"calories burned\" goal.-- Stats don't stack as they used to on Versa 2. You can rearrange them for sure, and that helps, but you otherwise have to keep swiping to see each stat separately. It seemed cleaner when they stacked on top of each other and you have to scroll down. Scrolling down from the clock face only shows settings, no quick select for google wallet (although you can set up shortcuts for long press on the button)You can get around this somewhat; for instance, I put the \"today's tile\" on top of the list and the weather tile on the bottom. A swipe to the right brings up today's tile quickly. A swipe to the left brings up the weather. Otherwise, you have to keep swiping to get different stats.-- while there is never trouble syncing, if you step away from your phone for too far or too long, you will have to resync. This was a problem with Versa before. I work in a fairly small, single story building and very few times can I actually respond to text messages without getting the error to resync. Fitbit desperately needs to increase the range of the bluetooth.-- you can't \"write\" messages, like you can with Apple watches. You can respond either with voice (which does work well to be fair) or choose from a few quick responces from a list.FINAL THOUGHTS: I do love this watch, but keep in mind there are few improvements with many missing features. For a casual wearer, I think the update is well worth it. Downsides in customization, stats, and absent apps should be considered, however, and given that this watch has been out for a long while, it is unlikely to change. I'd say if your happy with your old Fitbit model, just keep it and skip on this.",
                        "timestamp": "Reviewed in the United States March 3, 2024",
                        "profile_id": "AEH6XWDIVZHC5OZJT5YSCPRUJO5Q",
                        "is_verified": true,
                        "helpful_count": 44,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "RD6YCPB9O1NQM",
                        "title": "5.0 out of 5 stars Overall - SUPER happy with FitBit Versa 4",
                        "author": "Rosa",
                        "rating": 5,
                        "content": "I had a Versa back in 2021 and it lasted about 18 months. Since then had bought cheaper watches but none lasted very long. Well then in October of 2024 I decided to go ahead and buy another Versa - the newest one Versa 4 and i am so happy with this watch. it is light weight - better than the apple watch - which tend to be heavier. I have changed the watch face everyday to match what I am wearing. I like that it tracks my sleep and the watch band does NOT irritate my skin. Overall super Happy!!!",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AG445FNQDDILMAQ5WGFNTCK6MGIQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0B4N6B93J",
                "product_name": "Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, 40+ Exercise Modes, Sleep Tracking and more, Pink Sand/Copper Rose, One Size (S & L Bands Included)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:35:21",
            "updated_at": "2024-10-17 11:35:33",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252643347204953089",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0B4N6B93J",
                "page": 2,
                "pages": 271,
                "reviews": [
                    {
                        "id": "R2Y0CN3DTRJIGU",
                        "title": "4.0 out of 5 stars Great for biking, but still can't read heartrate on tattooed skin.",
                        "author": "Kindle Customer",
                        "rating": 4,
                        "content": "I have owned a Fitbit Alta, Charge 4, and now this Versa 4.My biggest complaint is that the Versa 4 cannot read my heartrate on my arm that is tattooed. If I want the heartrate monitor to work, I cannot wear my fitbit on the wrist I typically wear a watch on, and that is deeply frustrating. I had the same issue with the Charge 4 and was really hoping this time would be different. (The Alta never had this issue, so I was hoping it was specific to the Charge 4 sensor. Alas!) If you have a tattoo sleeve, beware! And if you know of a fitness watch that works great on tattooed skin, I'd love to hear it.However, the Versa 4 has worked much better for tracking my heartrate (on my non-tattooed arm) when I am out on my bike. The Charge 4 heartrate monitor would often stop working while I was actively biking (maybe because of the jostling? How my wrist was positioned?), only working again when I was stopped at a stoplight or at the end of a ride. The Versa 4 monitor does not have this issue! It has been very reliable at tracking my heartrate while I am out on the trail, and I am much happier!I was hesitant to buy the Versa 4 because it is so much larger and bulkier than the other Fitbit models I have used in the past, but I do enjoy the \"Today's Activity\" display that puts so many stats on one screen. There are also a lot of options for clock faces / displays, which I appreciate. It doesn't feel as bulky to wear as I thought it would. The access to more information and displays has made it worth the larger size.My only other complaint is that I wish I could find a better option for more prominently displaying my heartrate zone while I am working out. This is the major reason I have a fitness tracker! I wanted a clock face or a tile that made this information easy to access. I figured out if I tell my fitbit to track my workout, that I can then swipe over to a screen with my heartrate zone visible. On my Charge 4, my clock face displayed this information all the time, and I loved it. I don't love having to click through several menus to get this info on the Versa 4.",
                        "timestamp": "Reviewed in the United States June 9, 2024",
                        "profile_id": "AFGW2JCTMM57NPAAA2I7MV77TWJQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "RZFY3LA9C71PW",
                        "title": "4.0 out of 5 stars Only shows a report every other day for sleep. Otherwise, it seems to be good.",
                        "author": "Esther Kidd",
                        "rating": 4,
                        "content": "I wish it did a better job of tracking sleep. It only shows a report every other day. Otherwise, it is good. I tried answering my phone with it once to see if it worked. It did. That was fun.",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AGUHCEEHIBPLSZGPPAULMS66VH6A",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R13APWWJ07QD1Q",
                        "title": "4.0 out of 5 stars Get a better closing band.",
                        "author": "Richard A. Schneider",
                        "rating": 4,
                        "content": "Fitbit works nice, feels comfortable and like features, but band comes appart easy. The closure is not good pulls apart easy, in fact I just lost mine I fell off. I only had it a short time :(",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AG3C76QMYALDLSN2GXI3OWIVMKFA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "RSBQG3N6NIE56",
                        "title": "5.0 out of 5 stars What's not to Love?",
                        "author": "William J. Siems",
                        "rating": 5,
                        "content": "I have had many smart watches over the years, including Apple watches. The Versa 4 is my favorite by far. If you want everything, including the kitchen sink, buy an apple watch, and be buried in complexity. However, for elegant simplicity and everything you really need, purchase the Versa 4. My single criticism is the Copper Rose color is difficult to match with a metal band. Limque Stainless Steel Band has come the closest (see photo). I also found a favorite analog watch face for $.99 that I love. I would give it six stars if I could.",
                        "timestamp": "Reviewed in the United States September 20, 2024",
                        "profile_id": "AGPPUOXVVGKHK35Q5FEGIRZL22PA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R3IJ06P37YXX71",
                        "title": "4.0 out of 5 stars Nice Fitbit but charging issues",
                        "author": "ljb3439",
                        "rating": 4,
                        "content": "I love the function of this watch. I wish it would keep its charge longer. I miss out on information about my sleep because I need to stop to charge it every day & half. I do like Fitbit otherwise and would recommend it overall.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AFN352L7Q5PWWCABNY2NYF7NX5HA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "RQ66TLBO13U5V",
                        "title": "5.0 out of 5 stars It i different",
                        "author": "Lisa M.",
                        "rating": 5,
                        "content": "I had a versa many many years. it finally stopped holding a charge so I decided to get an upgrade and chose the Versa 4 I great ! it is different than the original versa yet somewhat the same. It’s been a little bit of a challenge where things are and how to navigate through some of the tiles. Overall, however, the new versa for. I had one night that it would not give me my sleep record, but I had changed the setting from normal to sensitive so I’m thinking that might’ve been the problem. I put it back on normal and it’s been working fine ever cents. The battery life is really good, , It does not take long to charge it, which is a plus. It comes with two bands, a small and a large. I have the small on and it’s very comfortable. I would say the only con to the versa for for myself is just having to learn and figure out where to find different things. I have to use YouTube sometimes just to find the stuff that I’m wanting to look at to see how to do things but I am pleased with it and I would highlyRecommend the Versa 4. I. especially like that I Hello can link it to my Alexa.",
                        "timestamp": "Reviewed in the United States August 12, 2024",
                        "profile_id": "AG5U5W7W3DACP6FWG4737ZSQKPZQ",
                        "is_verified": true,
                        "helpful_count": 10,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R162WQVK4XE2OX",
                        "title": "5.0 out of 5 stars Gives me the information I want.",
                        "author": "Graeme",
                        "rating": 5,
                        "content": "I have been using Fitbit watches since they first became available.This newest one seems to be as good as earlier models. It does capture more data, but I have not decided yet if I will actually take any new action based on the data.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AGVLE3B3EHCZPE3WQQ6PX4VHNGVQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1Z6VX7QJP0JBJ",
                        "title": "4.0 out of 5 stars Great Smartwatch",
                        "author": "Janet S",
                        "rating": 4,
                        "content": "This is my first smartwatch, and I really like it. I don't think the step counter is totally accurate, but I do like all the other features and the app that can be used on a smart phone helps a lot. I especially like it for tracking my exercise which is generally walking trails and keeping track of my heart rate as well as sleep data. I recommend this smartwatch.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AG35LULLANPCMW6NREVITTJPCFNQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R221SN69U5GV9Y",
                        "title": "4.0 out of 5 stars Great fitness tracker!",
                        "author": "Cherith A. Keeton",
                        "rating": 4,
                        "content": "Let me state at the outset, I do not like wearing jewerly and especially to sleep in. That is where my displeasure with this device began. It is great if you don't mind having something on your wrist and can be a real assest to monitoring your progress. As of my last update in January 2022, Fitbit had not released a Versa 4 model. However, I can provide you with a general review of what a Fitbit Versa 4 might offer based on the features you've mentioned.The Fitbit Versa series is known for its comprehensive fitness tracking capabilities and smartwatch functionalities. Here's what you might expect from a Fitbit Versa 4:Fitness Tracking: Like its predecessors, the Fitbit Versa 4 would likely offer advanced fitness tracking features to help users monitor their activity levels, track workouts, and set fitness goals. This could include 24/7 heart rate monitoring, step tracking, distance traveled, calories burned, and more.Daily Readiness: The inclusion of daily readiness features would enable users to gauge their readiness for physical activity based on factors such as heart rate variability, sleep quality, and overall recovery. This can help users optimize their training routines and prevent overtraining.GPS: Built-in GPS would allow users to accurately track outdoor activities such as running, cycling, and hiking without the need to carry a smartphone. This feature enables users to map their routes, monitor pace and distance, and analyze performance metrics more effectively.Exercise Modes: With over 40 exercise modes, users would have access to a wide range of activity profiles tailored to different workouts and sports. Whether you're into running, swimming, yoga, or weightlifting, the Fitbit Versa 4 would likely offer dedicated tracking modes to suit your needs.Smartwatch Features: In addition to its fitness tracking capabilities, the Fitbit Versa 4 would function as a full-featured smartwatch, offering features such as notifications for calls, texts, and app alerts, music playback controls, contactless payments, customizable watch faces, and more.Battery Life: Fitbit Versa models typically offer multi-day battery life on a single charge, allowing users to wear their smartwatch continuously without frequent recharging. The Versa 4 would likely maintain this tradition, providing long-lasting battery performance to support all-day activity tracking and smartwatch usage.Overall, a Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, and 40+ Exercise Modes would be a versatile and feature-rich wearable device designed to help users lead healthier, more active lifestyles. It would combine advanced fitness tracking capabilities with convenient smartwatch functionalities to provide a comprehensive health and wellness solution.",
                        "timestamp": "Reviewed in the United States March 20, 2024",
                        "profile_id": "AGB2OSLFVWNL3X3T5SBWQ7LTKG2A",
                        "is_verified": true,
                        "helpful_count": 20,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R1HYPMDBVPMXQM",
                        "title": "5.0 out of 5 stars Great watch!",
                        "author": "Heidi H.",
                        "rating": 5,
                        "content": "I love this so far. It gets me my texts. Easy Bluetooth connection. Easy to learn and use. I hated the original band so I purchase and elastic aftermarket band. Very responsive features",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AF6LZMQ3SDUVIUPSLSGJEDCSZS5Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0B4N6B93J",
                "product_name": "Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, 40+ Exercise Modes, Sleep Tracking and more, Pink Sand/Copper Rose, One Size (S & L Bands Included)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:35:21",
            "updated_at": "2024-10-17 11:35:34",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252643347204953089",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0B4N6B93J",
                "page": 3,
                "pages": 271,
                "reviews": [
                    {
                        "id": "R32HKV3EJ4V4J4",
                        "title": "4.0 out of 5 stars Works as expected",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Upgraded from a Charge 2 so definitely better. Free clock faces are an adequate amount to choose from. Pay annually for Fitbit premium. Information accurately provided. Just doesn't show body temperature, but has it as an option. Will stick with Fitbit products. Make sure to put a protective cover or guard on screen so you don't scratch it. Keeps s good charge, at least a couple days.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AHHP62ZBRCGY464Y7MCSDXCAKTSQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R8QNMC0L2MUO3",
                        "title": "4.0 out of 5 stars Screen Popped out after one year",
                        "author": "Kalip",
                        "rating": 4,
                        "content": "I purchased this Fitbit Versa 4 watch just over one year ago. (May 2023)I use it as an everyday watch and to monitor the distance heart rate etc on my morning walking/joggingIt served me in good stead until the screen popped out.I took it to a watch repairer guy to glue back the face and it’s now working fine.I like the fact that this Fitbit Versa 4 has a battery life of over 7 days, unlike many other brands.I have noticed that the GPS accuracy issue appears to have been resolved with the latest firmware version 210.26. update.",
                        "timestamp": "Reviewed in the United States August 12, 2024",
                        "profile_id": "AEIRTCN4OM5Z3E4ZXZ7NYS2S7UCA",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R2K48HEP5MU8PE",
                        "title": "5.0 out of 5 stars Good stuff here",
                        "author": "Qwerty",
                        "rating": 5,
                        "content": "I like it, the only thing I don't like is I lost a lot of apps that I had on my old fitbit. Particularly miss my \"find my phone\" app.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEA423F6FL7ABIKVXXIYDSMCJ6UQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R2QVOF65LFEJYQ",
                        "title": "4.0 out of 5 stars Good watch for exercise.",
                        "author": "Rachel",
                        "rating": 4,
                        "content": "Basically your run of the mill smartwatch, but for some reason unable to control music from this device. Good on tracking steps, exercise, and sleep quality.",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AFA2WLDJXBK4RBYHUAMOLPRPM32Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R8RDWO54JCQLM",
                        "title": "3.0 out of 5 stars Not Compatible with Amazon Tablets and needs to have a Mobile device to work.",
                        "author": "jonathan clayton",
                        "rating": 3,
                        "content": "Bought this for my wife.She really loves it and if it were compatible with her Amazon Fire tablet I would have given this a 5 Star, but unfortunately their is no Fitbit app in the Amazon Appstore.After doing some research (After purchase), I found that only Android and Apple products have the Fitbit app in their stores but Amazon was left out.There is a way to put the Android Fitbit app onto your Amazon Tablet, but it requires a lengthy setup using a 3rd party app that pretty much tells the Fitbit app your Amazon Tablet is a Android device, but I do not feel comfortable doing that so wife ended up using her cell phone that has a small screen.Amazon should have placed a \"Not Compatible with Amazon Tablets\" warning on the product page.Also in order for the Fitbit to work, you MUST/NEED to have an Android or Apple device to sync with the Fitbit as a controller for settings among other things and to be able to see full reports of your data.It is not just an optional choice to pair a Fitbit with a device, it is a must need to pair together.But wife is still happy with her Fitbit despite having to use a small screen on her phone to see her data.But that is why I gave the 3 Star's, still works as described, but product description also lacked what I would like to consider crucial information such as the Need to Pair it with a compatible device and that Amazon Tablets are not compatible at all and yet wife is still happy.",
                        "timestamp": "Reviewed in the United States August 31, 2024",
                        "profile_id": "AGBCMW7VCCMCPWVSBTKFWYMBH2PQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "RZAMLQK5313Y4",
                        "title": "5.0 out of 5 stars This is my 3rd Fitbit.",
                        "author": "Nanaboo",
                        "rating": 5,
                        "content": "I like this brand and this Versa 4. I had a Versa 2 and a Sense 2. I really like these smart watches.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AHBEF2P3OWLSWD7XRMDAJIYDW76Q",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "RGHOQK5XOGFN3",
                        "title": "5.0 out of 5 stars Love this watch",
                        "author": "S Reed",
                        "rating": 5,
                        "content": "I had an Apple watch. It was a few years old and needed the battery replaced. I decided to try the more affordable Fitbit. So far I'm really pleased with the performance.",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AFTX2BOFOJXCHDWIOPEUSJGKTSPA",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R3QJDJ45R8IX07",
                        "title": "4.0 out of 5 stars Working so far! Dexcom g6 compatible. Here's how I connected it...",
                        "author": "KrisTiki",
                        "rating": 4,
                        "content": "I bought this because I loose my dexcom receiver once in awhile. Attached to my wrist, I won't loose it! I was leery that it works. I had to switch phones, my Motorola was not supported by dexcom software, see dexcom website for compatibility.1. Make sure you phone will receive dexcom. The phone reads it, and just sends data to the watch. Phone has to be within about 20 feet of you. A. When phone is out of your area..you will loose Bluetooth connection. B. If that happens, all I have had to do is open the fit it app on my phone and it starts syncing again .2. Download fitbit app to your phone. Fitbit is owned by google, now. You will need a gmail account. They are free.-- the fitbit app is very clear, follow the menus and change your phone settings to ensure it works well! The watch will auto connect if everything is set correctly.3. Download the Dexcom app onto your phone. This software is very good, as well. It walks you thru any setting s that need adjustment. You do not need Clarity, just the main Dexcom app!--you are successful when your phone starts reading you cgm! Ps. You need your sensor and transmitter numbers! My transmitter # had to come from my Dexcom receiver! The sensor...dug in the trash! Found it!4. Last step. Go to your fitbit app on your phone. There is a blue icon to select screens, see YouTube videos for visuals! Search for \"Glance\". It was created for this use. download it for your fit it watch.Now you are ready to wear your watch!!! Done!Ps. There are some good YouTube videos that discuss Versa 4 connecting to a dexcom g6 and g7.Hey, fitbit...get on the ball and create 1 software to download and give a set of screen gui's! Make it easy for people!!Its been a couple weeks. I had to adjust my alert settings. It was buzzing me all night. It DID wake me up to say I was going low. Does a good job with heart rate and sleep patterns is interesting.What does NOT work? The step counter. My first 8 hours, I was asleep. It was going nuts with alert vibrations. The FitBit was VERY proud I had walked 150,000 steps at night, asleep. I must get tons of work out. No wonder I don't sleep well! 😁😁😁😁😂😂 it counted each vibration on all the alerts all night as steps!!! Stupid watch. I have not tried to fix it. Don't care about that function.I really like the convenience for CGM. I still need my regular receiver. But this is a quicker glance and a quieter alert. Its also nice to have weather, and maybe Alexa and Google maps. Have not tried the maps yet. Google voice is not loud enough unless its held on your ear!",
                        "timestamp": "Reviewed in the United States July 18, 2023",
                        "profile_id": "AGXALIPNKNTLH6FR6ZVZFZT37U4A",
                        "is_verified": true,
                        "helpful_count": 31,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R1YJCPETEB6BH4",
                        "title": "5.0 out of 5 stars Couldn't be much better",
                        "author": "Paul L. Davis",
                        "rating": 5,
                        "content": "Overall I really like this watch. It’s far more accurate tracking steps. It has its quirks but overall I am very happy. I do wish there was a better minimalist face. The one I really like doesn’t work on this model.",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AHJQD2KE7L7IHXKGEPOQU2SPOWXA",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "RZBXLROK5N1CQ",
                        "title": "5.0 out of 5 stars Works well",
                        "author": "Patsy",
                        "rating": 5,
                        "content": "Will never go back to a fitbit sense, to many glitches for me. So far no issues with this versa.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AEVNJESZXCMUL4UCC4SMRM6G4L4Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0B4N6B93J",
                "product_name": "Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, 40+ Exercise Modes, Sleep Tracking and more, Pink Sand/Copper Rose, One Size (S & L Bands Included)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:35:21",
            "updated_at": "2024-10-17 11:35:35",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252643347204953089",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0B4N6B93J",
                "page": 4,
                "pages": 271,
                "reviews": [
                    {
                        "id": "R3O75IEWGJIBYH",
                        "title": "5.0 out of 5 stars Bought for a friend for Christmas.",
                        "author": "KC Weidman",
                        "rating": 5,
                        "content": "Ordered yesterday with Prime, delivered today at noon. Very pleased with purchase. Bought as gift.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AHFGBRK7FAC3RWHU24CXGNGIONKQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "RLZRHM9S4ZRZU",
                        "title": "5.0 out of 5 stars EASY TO READ!!",
                        "author": "Sophie",
                        "rating": 5,
                        "content": "I love my Fitbit Versa 4. It's invaluable in tracking exercise from walking to swimming to yoga! It's simple to operate, understand and read in the sunlight.",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AHZHWJN7DS4X3EPDOCAYBQSXZBCQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R3ABWSLBM21XL2",
                        "title": "5.0 out of 5 stars I replaced my Versa 3 Smartwatch with a Versa 4 Smartwatch and am very happy with my new watch",
                        "author": "Albert Ugelow",
                        "rating": 5,
                        "content": "I wear this watch all the time. I only take it off when I shower or charge the watch. I use it to track my daily step count/distance walked, various health parameters, my type and duration of various forms of exercise and the quality of my sleep.By syncing the watch with the FitBit app on my iPhone I can get weather information for my area.It fully meets my expectations",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AGZXY46IVHNQRBPCGXPWTV2OUUJQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R9R4MT06HMIY3",
                        "title": "5.0 out of 5 stars I love it!",
                        "author": "Abigail",
                        "rating": 5,
                        "content": "The debate is still up for me between apple or Fitbit!! I find both work amazing but this Fitbit has less to worry about! I like being able to only use messages and calls with seeing my heartbeat",
                        "timestamp": "Reviewed in the United States September 22, 2024",
                        "profile_id": "AEI44RSK6RCBLALGYW6NMEFIABQA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R38DM7D63DI2CS",
                        "title": "5.0 out of 5 stars Good purchase good product",
                        "author": "eugene doose",
                        "rating": 5,
                        "content": "Great watchGood lookingall the features work as described",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFQYUPRCBNA2ROTI3MLB7WCEEJJQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R3S5BL4I2CGA0W",
                        "title": "4.0 out of 5 stars So far so good",
                        "author": "Mr Miami",
                        "rating": 4,
                        "content": "I haven't used a lot of its features but the basics seem to work well. The only thing that is off a bit it the heart rate function. It reads about 8-10 beats higher than actual (I have been to two doctors since I purchased it and got the same results from each one). It's not a problem for me since I just subtract 10 bps off of the number it shows. At least it appears consistent.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AHEHP7NS7FYYRZPJ7W2ZU7TQWQ5A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R3UEZ3JDRD2RGU",
                        "title": "5.0 out of 5 stars Watch",
                        "author": "Kenitchairy",
                        "rating": 5,
                        "content": "Love my watch so far 2 years with it and still working",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AH7OXU4WDWDOEVQHK3RDWC74CVHQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R2HSD453QNPJJ4",
                        "title": "5.0 out of 5 stars Good for a wellness-based watch",
                        "author": "maple",
                        "rating": 5,
                        "content": "I decided to finally get a fitbit to encourage myself to track my wellness and sleep after using my moms for a week, but i was pretty dissapointed when I couldn’t find the watch faces for this one i had just added to my moms, or any games and what not. You can’t add any tiles or apps with this watch that aren’t preset. Other than that, it’s pretty durable and water proof- i’ve swam and showered with it on, wiping down my screen cover and my skin under it after and it does just fine. It was easy to pair it to my phone and set up. Although the sleep and stair tracking is kinda off, because it shows i was awake for minute intervals throughout the entire night, and says i haven’t gone up or down any stairs when i live on the second floor of my house and go downstairs often. That’s just the more tedious bits for me though.It charges super fast. I didn’t record how long but it was just about dead when i put it on the charger and it wasn’t past an hour to an hour and a half when i looked and it was fully charged.",
                        "timestamp": "Reviewed in the United States July 23, 2024",
                        "profile_id": "AFF3LAES4ZMKSP7RN65LZUSZTGMA",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R1OGY6Q1Y499OV",
                        "title": "4.0 out of 5 stars Received my watch on the 19th of July. I just opened the box this morning",
                        "author": "Nancy Benetich",
                        "rating": 4,
                        "content": "I just opened the box to download and charge the Fitbit and connect it with my app. I was reading the side of the box and it gave everything that should be in it. I said it includes two sets of bands one small and one large. It had the large one connected to the Fitbit and did not have the smaller set. The Fitbit people owe me a set of small wristbands to go along with the watch.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AGXZDWPCJLJMOUH6QPJHDBUKGI6Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1C2VPEOSRQYGS",
                        "title": "4.0 out of 5 stars I really like watch",
                        "author": "Katie",
                        "rating": 4,
                        "content": "It takes some time to connect it to your phone. Tracks everything, sleep, excerise, great features etc. Reading it is easy, but you can also customize that.",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AFRSSJC3L5TZ5J65S7XCDCF5JHWQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0B4N6B93J",
                "product_name": "Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, 40+ Exercise Modes, Sleep Tracking and more, Pink Sand/Copper Rose, One Size (S & L Bands Included)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:35:21",
            "updated_at": "2024-10-17 11:35:36",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252643347204953089",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0B4N6B93J",
                "page": 5,
                "pages": 271,
                "reviews": [
                    {
                        "id": "R1T5D5MHB9Q0FD",
                        "title": "4.0 out of 5 stars Great watch",
                        "author": "Elaine Hatch",
                        "rating": 4,
                        "content": "My versa 2 died and I upgraded to this one. Love the watch but dislike the bands. The tuck under closure is awkward and I don’t like silicone. They are easier to change out than the Versa 2",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AF3VE252FAMDS5TEBE7DOOCLRYNQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R3D4UNZHJ2HTU2",
                        "title": "5.0 out of 5 stars Works great",
                        "author": "DH70251",
                        "rating": 5,
                        "content": "Long battery life 7-8 days",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AGO3XAQMXMNTQN735MQESQEJ7P3A",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R3D8TBLGFLES01",
                        "title": "5.0 out of 5 stars An Amazing Watch Upgrade for Me!✨",
                        "author": "KittKattG",
                        "rating": 5,
                        "content": "The media could not be loaded. I just upgraded from a FitBit Charge to this Fitbit verse 4, and I absolutely love it! Its charge usually lasts about a week to sometimes a week and a half but I have it on everyday and every night, so it’s always in use! It’s arrived in great quality and it looks good. I worried it would look too big on my arm but it fits and looks just fine! It works really good and haven’t had issues with the stats. Sometimes I question the steps, but that’s with every watch. I think it’s perfect! I can read it just fine; the screen looks good and it’s such an easy set up!I highly recommend Fitbit products. And yes, I do have an iPhone and am able to take call on the watch. I just cannot text with it which makes me sad. I can only read texts and notifications.Other than that it’s a great purchase! I love it!✨",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AET6RNXC3VKA3YLQZTSBKOW73IMQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1JTTCXQJFQ7EQ",
                        "title": "5.0 out of 5 stars Can't live with out it",
                        "author": "Troy",
                        "rating": 5,
                        "content": "I upgraded to a Versa 4 after my Versa 2 after 5 years finally would not hold a charge. I have heart issues and want to know my HR at any time. While I waited for the new one to come after my decision to buy the versa 4 I felt like I lost a friend. I always look at my Versa as it shows my steps as well as tracks them for my review. I can see my heart rate go up or down as that is what I need the most as my resting HR is tracked and I can see a trend. I can set my timers for when I do laundry just by telling Alexa to do that for me. The best feature is the Alexa talks back through the speaker on the Fitbit. I have to my surprise taken calls and felt like some super spy talking into my watch and looking around while on a cell call my phone in my pocket looks odd, but it works great. The Fitbit is keeping track of my sleep to me this is also important as I want to see my trends. I as a heart failure patient use my features of the Fitbit as I have goals on how far to walk. What is my HR when I walk. There had been some complaints I read about not having third party support for apps the thing is you can set the Fitbit to shows ALL the same notifications that the phone sees send them to the Fitbit so if you are getting notifications sent to your phone you can send them to the Fitbit Versa. Notifications like camera notifications, text messages, and The rest of the Notifications you see on your phone that you do or do not care about. The Bluetooth sync is perfect as well as the Versa has GPS built in so you do not see any cell phone battery reduction. I love mine. I would suggest screen covers so you do not accidentally scratch the face. I like the phone app more than any other one. I recommend this Fitbit to anyone who wants a solid Fitbit that works well.",
                        "timestamp": "Reviewed in the United States May 20, 2024",
                        "profile_id": "AHF53KBSGECRTT4U2GFKUHWZVDNA",
                        "is_verified": true,
                        "helpful_count": 46,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1TJVBQ8CZ6077",
                        "title": "5.0 out of 5 stars Watch",
                        "author": "Joss",
                        "rating": 5,
                        "content": "I love the watch.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AFBROW35MERKSAETYNT3GVVHLPQQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "RZOGZ0GCMU7GN",
                        "title": "5.0 out of 5 stars easy to use",
                        "author": "April Tokarsky",
                        "rating": 5,
                        "content": "fast shipping. an feels great . easy to use. needed for heart rate monitoring an does that perfectly",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AE44RG4II7JWX74ST3H4XCBZF6ZA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    },
                    {
                        "id": "R29A9PXEYW37RC",
                        "title": "4.0 out of 5 stars Good battery life",
                        "author": "Megs",
                        "rating": 4,
                        "content": "Battery lasts almost a week as compared to 4 days with the versa 2. Different screen set ups just take some getting used to. Totally different charger type and band attachment so had to get all new everything when upgrading from the versa 2",
                        "timestamp": "Reviewed in the United States August 18, 2024",
                        "profile_id": "AFVCZRZWJH7U7AEZQ47PTZOWO65A",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1WA2NFW8FOX9X",
                        "title": "5.0 out of 5 stars Versa 4",
                        "author": "Cindy",
                        "rating": 5,
                        "content": "So far I’m enjoying it. It has great features and I need to track my steps most of all. Syncs fast, charges fast and last way longer than an Apple Watch. Had a versa lite but finally died on me. Don’t care for the band though.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AHTKCNDYAJZYH3ZDTOWHSJEUNBFQ",
                        "is_verified": true,
                        "product_attributes": "Color: Waterfall Blue/Platinum"
                    },
                    {
                        "id": "R1MLB1I58XRVKK",
                        "title": "5.0 out of 5 stars GREAT",
                        "author": "Dawn F.",
                        "rating": 5,
                        "content": "Can't live without my fitbit!",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AFJRJUP5X6Q6TSQUEMHKVUQUFT7A",
                        "is_verified": true,
                        "product_attributes": "Color: Black/Graphite"
                    },
                    {
                        "id": "R33OIP1IAVXQP",
                        "title": "5.0 out of 5 stars Replaced old beat up Versa 2",
                        "author": "Gah-Gah",
                        "rating": 5,
                        "content": "Great so far. Navigation on the device is a bit different from Versa 2, but great once you get used to it.One thing I LOVE Love LOVE about Fitbit Versa, as opposed to other smart watches (Pixel, Apple, Samsung )is the stellar BATTERY LIFE. I wouldn't want a wearable that needs to be charged every day. I mean, you can take a long weekend trip with the Versa and leave the charger at home.",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AH6I74UVQSPLPWFPDYQKHI2PBFCA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink Sand / Copper Rose"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0B4N6B93J",
                "product_name": "Fitbit Versa 4 Fitness Smartwatch with Daily Readiness, GPS, 24/7 Heart Rate, 40+ Exercise Modes, Sleep Tracking and more, Pink Sand/Copper Rose, One Size (S & L Bands Included)",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:35:21",
            "updated_at": "2024-10-17 11:35:37",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0B4N6B93J?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252643347204953089",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:35:21",
        "domain": "com",
        "geo_location": null,
        "id": "7252643347204953089",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0B4N6B93J",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:35:37",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252643347204953089",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252643347204953089/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252643347204953089/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252643347204953089/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643347204953089/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}