{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0C1GNXTSW",
                "page": 1,
                "pages": 91,
                "reviews": [
                    {
                        "id": "R3K5SYRTINNHL8",
                        "title": "5.0 out of 5 stars Bluetooth Connectable!!",
                        "author": "Emily",
                        "rating": 5,
                        "content": "I love this watch!! It connected super easily to my Iphone 14, and still syncs well. Helps me track my sleep, steps, and heartbeat. It is comfortable, and stylish. People ask me if it is an Apple Watch too and are surprised that it's not. You can manage the brightness on it. It can have your notifications on or off. It allows you to set alarms and connect to Alexa if you want to. It can handle washing dishes, working cattle/ horses, and every day wear and tear. It charges really easily and quickly. I have not had any problems with it so far and I have worn it every day for two months already. Super affordable too! You will need the download the app to go with the watch but the app takes up very little space and is super easy to use. You can also personalize your watch screen with your own photos!! (My favorite feature!)",
                        "timestamp": "Reviewed in the United States September 13, 2024",
                        "profile_id": "AGUMMCOVUGYBILPNAKIPSRAJ2X4A",
                        "is_verified": true,
                        "helpful_count": 16,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2HNUP9OJRWRZR",
                        "title": "5.0 out of 5 stars Great buy",
                        "author": "Hey",
                        "rating": 5,
                        "content": "I have had a FitBit and 2 Garmins in the past. This is my favorite of all of them. It is easy to use and the charge lasts for a week or better. It charges quick. Plus I like that it has an SPO2 and heartrate monitor. It's so easy to use and looks great on.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AHHOG26XNTN4VSBB7QIINBDBKR2Q",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RWTLZYYJ0FMCD",
                        "title": "4.0 out of 5 stars Practical, good for the price point",
                        "author": "Kyra",
                        "rating": 4,
                        "content": "I needed a watch for my waitressing job and thought it would be nice to have fitness tracking since I also go to the gym. It works to track my steps, calories burned, and can track my sleep as well. I'm not sure how accurate everything is but it works just fine for me. It connects to my phone to show me notifications, what they are and who they're from. I can not text back or take calls on it. The band is comfortable enough, I don’t really wear things on my wrist so I'm still getting used to it. It connects to Alexa, music pause/play/volume, find phone, camera remote, timer and stopwatch. You cant add any apps or background photos like on an apple watch. If you are looking for something simple, practical, and affordable, I would definitely recommend.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHBWHEVH5OVJH3MWGXS6RAGTL4JQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Size: 41mmColor: Black"
                    },
                    {
                        "id": "R3GQ7DTVUWU5XP",
                        "title": "5.0 out of 5 stars It’s pretty good!",
                        "author": "HarleyReadIt",
                        "rating": 5,
                        "content": "So I’ve been wearing it since 8/15 I think, and overall it’s pretty solid. My only gripes about it is that the fluid measurement is only in ml and that it does not have a calculator. I have the one that uses the app VeryFit, and I like the layout of it. Both watch and app are pretty customizable to taste or holiday season and it’s pretty easy to navigate. I like the daily goals, they synced workout cycles and how you can set a water reminder. The timer is excellent. Since having it, my battery has only fallen below 60% once. I haven’t figured out if you can swap the straps or not or if there’s an apple case compatible with it, but bracelets and unprotected screens don’t last very long with me and there hasn’t been a single scratch on it yet.Overall I feel as though it’s pretty accurate and easy to use! I’ve recommend it to 2 people who’ve been in the market for a similar type of watch",
                        "timestamp": "Reviewed in the United States September 5, 2024",
                        "profile_id": "AFKCHYUGO2ZYWVP5EKPSZPTJC53A",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Size: 41mmColor: Black"
                    },
                    {
                        "id": "R2S3YAQY4S7JUP",
                        "title": "5.0 out of 5 stars Works with Iphone!",
                        "author": "E",
                        "rating": 5,
                        "content": "Pros: Has timer, stopwatch, relax(guided breathing), heart rate monitor, oxygen monitor, exercise log, alarm, sleep monitoring, weather, changes the music, and pedometer built in. Charges easily and holds charge for about a week at a time. Syncs to show you your messages so you can see if anything urgent comes through.Cons: I can't respond to my messages.Love this watch. It has helped me see my sleep patterns, and overall lifestyle patterns. It is helping me make healthier decisions.",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AGTACUXDMT72TEKBQGDYBRVDZ67Q",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RYPE3Q4VB8RCI",
                        "title": "3.0 out of 5 stars I may return it!",
                        "author": "nanniehead",
                        "rating": 3,
                        "content": "Update: You can set your planned sleep time! But if I get up to go potty, it stops counting sleep data. Shows a couple hours of sleep and then it's purple for the rest of the night.Update: I figured out the exercise mode issue. Sort of. The reason it didn't register is because I was using a standing desk & walking pad. So my arms weren't moving. I tested it by starting the indoor run on the watch and just moving my arm back & forth with it in my hand. It only registered 9:24 minutes of a 15-minute test time but it did register on both the app and the watch. And it did add steps to my daily total. So, I upped the star rating to 3. Overall, it's ok for the money. We'll see if I get any sleep time tonight. PS-Customer service is pretty good. They will respond and try to help in a pretty timely manner.It is so hard to find one of these smart watches that actually works. Mostly, it's the apps. I think that's the case here. I've had issue after issue with this one. First, it wouldn't let me join Fitdock. Kept saying the server was having problems. So, I just continued thru setting it up. When I tried to change the face, I got a blank gallery. Turns out you need to join Fitdock and then you get a gallery of available faces. The watch insisted I do a factory reset on day 2. I tried everything but it would only work after a full factory reset. So, I lost everything from day 1. When I turned on Message notifications, I got a notification every few minutes on the watch telling me that my messages were available because I had paired a device. Annoying as all get out. Turns out that had something to do with my Google account but I'm not techy enough to explain it. Then more issues this morning. First, I did a 15-minute indoor run in exercise mode on the watch. It didn't register on the app, no real info about it at all on the app. Under Training, it says my workouts will appear there but there's nothing. I did find a reference of 3:24 minutes in the exercise record on the watch. But it didn't add anything to my steps for the day. Seems like if you have a goal of say 5000 steps and you use the exercise mode to record a run, those steps should be added to your total goal for the day. So now I'm not sure if it just didn't register the run, or if it will add to steps when you do a run. I think it did show an elevated heart rate because of the run, tho not entirely sure about that. No sleep record, either. It registered the first night but not last night. And finally, I tried to take my blood oxygen level and it just keeps telling me to confirm I'm wearing the watch. One good thing is you can use your own picture as a face. I have a picture of a cute drawing my granddaughter did when she was little. That's drawing me in (no pun intended). Cuz it's pretty cool to look at your watch and see your granddaughter's drawing. But the bad thing is you can only put time and date on your own picture. I want steps and a battery icon. Which brings up another gripe. A lot of the faces don't have the battery icon. But that brings up another good thing. The battery seems like it will last a good while. With all the messing around I've been doing with it over the last couple days and it's still at 95%. So, my decision is do I keep it as just a watch with my granddaughter's picture and take hit or miss on everything else. Or do I return it and try another one.",
                        "timestamp": "Reviewed in the United States July 5, 2024",
                        "profile_id": "AFQTQEQENLOL5DMZR6HNO347VCHA",
                        "is_verified": true,
                        "helpful_count": 22,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "ROPVAOYM295XJ",
                        "title": "5.0 out of 5 stars Excellent watch!",
                        "author": "shs036",
                        "rating": 5,
                        "content": "Great budget watch. Perfect for outdoors. Lots of features and easy to use. Long battery life. Great customer service!",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AH4Q7RLNV67F7H7LEKO2OOQL2XMA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RSMWSGBBTYYH6",
                        "title": "4.0 out of 5 stars You get what you pay for",
                        "author": "Nick",
                        "rating": 4,
                        "content": "It’s a cheap option and it works relatively well. I notice some of the measurements are wildly inconsistent but I really bought this for the step counting feature. At a few points it measured my heart rate at 209 but when I measured it myself, it was at 64. It also thought I slept 3 hours last night when I actually slept 8+ (I know because it was the best night of sleep I’ve had in a while).It sounds like I’m knocking it but I’m quite happy and frankly, even with the inconsistent measurements, you can quickly figure out which ones are bogus and which ones are relatively accurate.If you want a smartwatch but don’t want to pay and extraordinary amount, this is the one. It tracks steps well and beyond the inconsistencies, it allows me to get a pretty good reading on my heart rate, stress and sleep.One last thing, if you sweat or wear sunscreen, it’ll likely not get proper readings.",
                        "timestamp": "Reviewed in the United States April 21, 2024",
                        "profile_id": "AGCBHD4U2SNMSCQBBBWRGGBTLRJA",
                        "is_verified": true,
                        "helpful_count": 16,
                        "product_attributes": "Size: 45mmColor: Black"
                    },
                    {
                        "id": "R3UU0U2TBRNYNL",
                        "title": "5.0 out of 5 stars So far so good...",
                        "author": "DEBRA L HETZER",
                        "rating": 5,
                        "content": "I've only had a couple days, so far I I like it. Couldn't beat the price point at $16, I purchased on a Prime deal day. Easily connected to my Galaxy 24+, which has a light purple case and band was close to same color. The face isn't too big or too small. The band is soft and doesn't bother me at all when I'm sleeping. I have been easily annoyed by some previous watches. I like to keep track of exercise/steps and see how well I slept. I also like receiving notifications. Seeing heart rate and stress levels may be nice too. I had to turn off the feature that makes it light up when I move my wrist because it would wake me up. So far I've kept it off by may need to turn on during the day. Again, I've only had a couple days so there's a lot to figure out still. I'll try to remember to post an update in a few months.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AEEA4DVGORW6TVI4DSO57UKOBZLQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R6PXE3F0DMRAR",
                        "title": "5.0 out of 5 stars What I need it to be",
                        "author": "M.S.",
                        "rating": 5,
                        "content": "I absolutely blast this thing with water on a near daily basis. Like actually directly hitting it with a hose, on purpose, because it gets covered with soapy water when I'm bathing dogs at work. I honestly have no idea if it actually does any good with tracking pulse or blood pressure, but it counts my steps, keeps time, and gives me reminders if I set them up. I didn't need this as a health tool, just a good waterproof watch with an alarm function,and that's definitely what I got.I will say though, the \"green\" I got is awfully blue.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEAUFG6Q2N5EH7YKPOO7IEYAQACQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: green"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C1GNXTSW",
                "product_name": "Smart Watch, Fitness Tracker with Heart Rate Monitor, Blood Oxygen, Sleep Tracking, 1.5 Inch Touchscreen Smartwatch for Android iOS Swimming Waterproof Pedometer Step Calories Tracker for Women Men",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:09:29",
            "updated_at": "2024-10-17 11:09:55",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252636838815356929",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0C1GNXTSW",
                "page": 2,
                "pages": 91,
                "reviews": [
                    {
                        "id": "R1UNQDAZRNIN74",
                        "title": "4.0 out of 5 stars So far so good.",
                        "author": "Ronnie",
                        "rating": 4,
                        "content": "It can manage music and alarms which was all I was hoping actually worked.As for metrics, it was pretty close to the heart rate of a bike machine at my gym. Just make sure you place the sensor over your inner wrist for better results and actually turn on the active workout measuring on it. Otherwise you're not gonna get as accurate of a reading with it on the back of your wrist and not activating workout recording.If you want to change the image on it, make sure the downloaded app has permission to access your images.Sleep measurements seem pretty accurate considering my habits.I don't count my steps already so I can't comment on the pedometer.My only annoyance is the responsiveness of swiping and . I can't complain too much though, I got it on sale for $18, all in all impressive for the cost.Now I just gotta see how long it lasts.",
                        "timestamp": "Reviewed in the United States July 22, 2024",
                        "profile_id": "AG22GSP3JVVAMY73KBHLPT5OW5XA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "RE5SWFN87HRXW",
                        "title": "4.0 out of 5 stars It’s great almost!",
                        "author": "Krista",
                        "rating": 4,
                        "content": "I love the watch and purple was beautiful. But the weather part has a hard time stay connected. I have everything like I’m supposed to and it still won’t work properly. It tells you to sync your phone and I do it and it still doesn’t work so that’s the only flaw I have with it . Everything else is great especially for the value for your money. I love that you can customize your screen. Other than the weather it does great .",
                        "timestamp": "Reviewed in the United States August 31, 2024",
                        "profile_id": "AHV5FSFWB52ZY6I7GHL5XKOQYPSA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R37M8JN838KMSA",
                        "title": "4.0 out of 5 stars Pretty good",
                        "author": "jennifer mahon",
                        "rating": 4,
                        "content": "This is a good quality watch for the price. My watch was missing the charger so I cant use it anymore. I thought I would be able to use my charger from my old watch,but no can do. So disappointed that less than a month later I can no longer use it",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AHRT57HQ4RKPWGCAYNSN2UF4VKAA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R30QACM87108NT",
                        "title": "3.0 out of 5 stars Not what I expected.",
                        "author": "Diana",
                        "rating": 3,
                        "content": "Let me start saying that I hate to wear any wrist accessory, including bracelets and watches….or even rings. Possibly not being a good candidate for wearable monitors I expect more may be?I bought this smart watch only for one reason, I wanted to check my sleep pattern to see all the different phases of my night sleep. If you are looking for a review of a wellness device this is for you.I wore it asap I received it.I Downloaded the app and sync it. I wore in on left side (that is where I measure my BP with a traditional cuff). Although I expected not to be accurate as a blood pressure monitor…..I assumed at least the sleep pattern function had some accuracy.I wore the watch for 18 hrs and tested steps and all functions related to wellness.Lest say that none of the functions listed for wellness will be ever accurate enough in any of these devices for the time being. Consider that an Oxymeter needs to read on finger not on top of the wrist and that a regular blood pressure wrist cuff lacks of accuracy as well. So, you cannot expect this type of accuracy from any wearable monitors. However based on movement and HR (heart rate) I thought it would give me some sleep pattern precision. It did not even registered the 2 times I woke up at night to pee. It just gave me a total of hrs sleep split in Light sleep and Deep sleep. Not enough details for me on the app graph. It also did not register my HR at night, or it failed to display it on the app screen on phone.Hearth Rate function overall sucked too. It gave me a reading of same HR for resting, minimum and maximum.The timer and steps functions are useless to me…..I already use the sensor of my samsung phone. I cannot be bothered with the timer for the aerobics, I always used a traditional chronograph stop watch for training.Other functions such as music and messaging or phone calls I cannot write a review on those.In summary if you are using this as a wellness monitor, do not buy it because it will give you very inaccurate functions like O2, Blood Pressure, HR recording (through the night) and Sleep Pattern important details.",
                        "timestamp": "Reviewed in the United States June 26, 2024",
                        "profile_id": "AEFD6B4FCJW5ORBRWAMPXOA3T6ZQ",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Size: 41mmColor: Purple"
                    },
                    {
                        "id": "R1N3IDZ4N6O4YK",
                        "title": "4.0 out of 5 stars Works well",
                        "author": "Den",
                        "rating": 4,
                        "content": "Had to set time using the app from my phone but works well with long battery life.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AGZ7WNCM7O5WI5BT42BSYNIO7JMA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: gray"
                    },
                    {
                        "id": "R12D3BKPOEFDRC",
                        "title": "4.0 out of 5 stars On time delivery and quality",
                        "author": "Love love love this product",
                        "rating": 4,
                        "content": "Love my watch works great",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AEVIHZU6F3T5SQAGUJNN4VNGVHDQ",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: green"
                    },
                    {
                        "id": "R30Q2I13U8RI0U",
                        "title": "5.0 out of 5 stars Accuracy",
                        "author": "Pamela Simpson",
                        "rating": 5,
                        "content": "I love my watch. It takes an accurate account of my steps, and my heart rate. Changing the watch faces is fun, I have a picture of my grandsons. I have it linked to my phone so I get my text messages. I love the color and yes I would buy it again.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AGSH2JWS6WHRFXFOZNOGC22YZUDA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Green"
                    },
                    {
                        "id": "RSEGKBO4TW15D",
                        "title": "4.0 out of 5 stars It's ok.",
                        "author": "Susan S.",
                        "rating": 4,
                        "content": "So I got the light purple one first, that I love, and decided to get the red and black for my son. They not only use two different apps but they also work totally different. The purple is more accurate in counting steps and more customizable with the picture and watch face. The red n black let's you change the Pic and color of the clock but not placement. It also doesn't count steps correctly, which was my main reason for getting it. So a bit disappointed with that. Plus, since they use different apps, I can't pair them together under the family profile. Pretty disappointed with it all. If I wasn't stupid and threw away the box, I'd probably return it.",
                        "timestamp": "Reviewed in the United States July 25, 2024",
                        "profile_id": "AE6RWXI4YG3VYHNKUPVVMYNJN7WQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": ""
                    },
                    {
                        "id": "R25BN9QOSSO2HL",
                        "title": "5.0 out of 5 stars The battery last seven days I am not kidding",
                        "author": "Kyera",
                        "rating": 5,
                        "content": "With a long battery life connectivity is easy. It’s easy to use. You could customize screens the screen is very bright It’s comfortable to wear. It’s very accurate with the steps the calories and the sleep monitoring. It’s a very great buy",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AF7YHVO2CHJB6TWPFXDOEGTVFE6A",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R2LQ1EDVW3OHID",
                        "title": "4.0 out of 5 stars works as expected",
                        "author": "Eilene Sproul",
                        "rating": 4,
                        "content": "Watch band is mostly comfortable with a keeper that controls the long end of band. Long lasting battery. Phone app works ok. Watch isn't entirely accurate, especially for sleep information, but is close.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AGREVMKZTMEU67VVRY27GSWFQSHA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: gray"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C1GNXTSW",
                "product_name": "Smart Watch, Fitness Tracker with Heart Rate Monitor, Blood Oxygen, Sleep Tracking, 1.5 Inch Touchscreen Smartwatch for Android iOS Swimming Waterproof Pedometer Step Calories Tracker for Women Men",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:09:29",
            "updated_at": "2024-10-17 11:09:58",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252636838815356929",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0C1GNXTSW",
                "page": 3,
                "pages": 91,
                "reviews": [
                    {
                        "id": "R2VOZX88IXJMFM",
                        "title": "4.0 out of 5 stars Excellent tech but poor construction",
                        "author": "uzerswa",
                        "rating": 4,
                        "content": "I love this watch....I love it enough to keep it and get a new protective case as the straps already broke off the base after only light use. I'm currently in a more sedentary lifestyle due to work.. so the watch isn't at risk of damage and heavy wear and tear.If the straps were attached better... I'd give it a 5 star",
                        "timestamp": "Reviewed in the United States August 20, 2024",
                        "profile_id": "AEPITK4WXARIR573AR2BM5DGCBFQ",
                        "is_verified": true,
                        "product_attributes": "Size: 45mmColor: green"
                    },
                    {
                        "id": "R20LUAQBW4FJQB",
                        "title": "4.0 out of 5 stars Great for the price",
                        "author": "Lindsay",
                        "rating": 4,
                        "content": "Bought this “smart watch” because I wanted something to help track fitness/sleep/health without dropping the money on the name brands. This little watch does the trick, and while it’s noticeable that it’s a frugal choice I think it does just fine and I don’t feel guilty for spending too much money on the bigger better brands.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AHXFUXKTZ2BACD5W6K5YX3PUDWKQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Black"
                    },
                    {
                        "id": "R2808YC3YRDPVQ",
                        "title": "4.0 out of 5 stars Decent for the price",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Great price for a smart watch. Long battery life and looks similar to the Apple Watch. The step tracking isn’t always accurate, same with miles when working out/walking. But otherwise it is a decent watch. It shows notifications from your phone and has a few options for workouts (walking, running, biking, etc)If you’re looking for a basic fitness/smart watch for a good price, this one will do the job.",
                        "timestamp": "Reviewed in the United States August 14, 2024",
                        "profile_id": "AE3TRNPEK6KOM23GXRO4D57NN36A",
                        "is_verified": true,
                        "helpful_count": 10,
                        "product_attributes": "Size: 41mmColor: Purple"
                    },
                    {
                        "id": "R3VUK77SGGOSRC",
                        "title": "5.0 out of 5 stars Works well.",
                        "author": "Michael A. Hobson",
                        "rating": 5,
                        "content": "Bought this to have as a time for work. Works well as a timer/pedometer. Not many other uses but it does exactly what I wanted it to do. Connects to phone app where you can make custom wallpapers. Good buy.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AFDTELNKSJJNPIGVB6W55JRGDGXA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 45mmColor: Black"
                    },
                    {
                        "id": "R21QP7J72896NH",
                        "title": "4.0 out of 5 stars So far so nice",
                        "author": "Melanie",
                        "rating": 4,
                        "content": "I've been wearing amd using the watch for lip over 2 months. It's been very nice snd easy to use I'm not a tech savvy person at all. It does seem to lag in response when I'm not close enough to the phone amd I'll get several msg in a row once I'm close enough tho. It's OK because I'm still able to keep my phone at my desk instead if in mr pocket",
                        "timestamp": "Reviewed in the United States August 9, 2024",
                        "profile_id": "AES7QVUGZMA4S6DVLQOQ6TLNW4HA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RHYW5RPDUTMLJ",
                        "title": "5.0 out of 5 stars I LOVE THIS",
                        "author": "Julie",
                        "rating": 5,
                        "content": "This watch is awesome! It is so easy and comfortable and the watch has so many features and things to do and track it was cheep and worth it I love this and I will be sure to wear it a lot!",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AE2D4NIRMSJXN42534Z5UIV7TVRQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Green"
                    },
                    {
                        "id": "RRKYCKDSJ7XCR",
                        "title": "4.0 out of 5 stars IT WORKS!!",
                        "author": "Acemax1",
                        "rating": 4,
                        "content": "IT WORKS!",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AG3BGTMSLP43ZOHZYOTMOEQMADLA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R3237F6GW841R4",
                        "title": "4.0 out of 5 stars Love the Color",
                        "author": "Dr. Java Collins",
                        "rating": 4,
                        "content": "Though I ordered this in err, I loved the color! Very durable. I wish they made one with a round face, which is my preference.",
                        "timestamp": "Reviewed in the United States September 6, 2024",
                        "profile_id": "AESYKMARBAB3UEXD6MS46JR74V2A",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R3J3I1AV7BVJ42",
                        "title": "5.0 out of 5 stars Wonderful watch ⌚️",
                        "author": "Mercedes Ward",
                        "rating": 5,
                        "content": "I love how it feels, not to heavy, super easy to put on, the set up is really easy. However in my opinion I don't like that the \"Alexa\" option is always there. For long press when it's on, even when I disabled it on the app.I also didn't know I couldn't respond to a message, I can only see it. That's on me tho. I thought I could.Beautiful watch. Easy set up.Its good brightness. I like that it's adjustable as well. Great price, pretty color.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AFTZ3YCMFIBLGFR3P4F5KNNS764Q",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Size: 41mmColor: Light Green"
                    },
                    {
                        "id": "R3FXLEUVE1VF0E",
                        "title": "5.0 out of 5 stars Works just as good as a fitbit and costs CHEAPER",
                        "author": "Kate Rose",
                        "rating": 5,
                        "content": "All the features for this work just as good as a fitbit. Beats spending $60-$250 for a smartwatch any day. Connection instructions to the phone were also very clear and concise. Would by again, 10/10 would recommend :)",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AEBJEHBVVRFFPSFHGBP54T7FBHNQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C1GNXTSW",
                "product_name": "Smart Watch, Fitness Tracker with Heart Rate Monitor, Blood Oxygen, Sleep Tracking, 1.5 Inch Touchscreen Smartwatch for Android iOS Swimming Waterproof Pedometer Step Calories Tracker for Women Men",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:09:29",
            "updated_at": "2024-10-17 11:09:59",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252636838815356929",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0C1GNXTSW",
                "page": 4,
                "pages": 91,
                "reviews": [
                    {
                        "id": "RZDHP50OG1CYE",
                        "title": "4.0 out of 5 stars Awesome fitness watch",
                        "author": "Laura Jones",
                        "rating": 4,
                        "content": "I am impressed with this $20 smartwatch. I got it 2 days ago and used it on a 3 mile hike. It does km instead of miles. The app is pretty neat. I figured out how to sink it for notifying me about calls, but cannot figure out how to get text notifications. If you are wanting a watch for fitness, this is definitely worth the money. Great bang for your buck. I haven’t tried to use my headphones with it for music but am guessing it sinks to your phone instead of the actual watch. Even as a watch, you can’t find one for this cheap, let alone with so many features. I figured out how to sink the weather too so overall very pleased with this product. Does anybody know how to sink your text messages? I turned on notifications within the app and on my settings.",
                        "timestamp": "Reviewed in the United States June 9, 2024",
                        "profile_id": "AGSPEHHRE2XQITFD25BG5SNVICDQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 45mmColor: Light Green"
                    },
                    {
                        "id": "R24TNH9RMRTKKD",
                        "title": "4.0 out of 5 stars It's time to get yourself a watch",
                        "author": "Ashley",
                        "rating": 4,
                        "content": "Great product, comfortable to wear all day, fun to customize the screen background I just wish you could customize the clock on to different backgrounds.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AFTCGEWWEWTXDB6IUGUQDLGJSPVA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R3INTTIB2L4HX6",
                        "title": "5.0 out of 5 stars Love Mine",
                        "author": "C. Hornsby",
                        "rating": 5,
                        "content": "I just got mine and I love it. It tells me how many hours I sleep and if I am in Rem sleep or not.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFTKPMSDG3564Y5RAFHESNQOWHAQ",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R2S6XGRSI78XQH",
                        "title": "4.0 out of 5 stars I like this watch very much",
                        "author": "Phoenix Mary Grace Hocking",
                        "rating": 4,
                        "content": "I wear the watch every day because I like that it keeps track of my steps. I haven't quite figured out how to sync it to my phone, but that's just me.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AGSE7YYNCCFD63K72RN3R6RNFKKA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R3JKL4HXSORZQ9",
                        "title": "4.0 out of 5 stars Good So Far",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "Order yesterday, arrived TODAY! I chose the lavender purple and the color was actually correct 👍🏼. The app was easy to find and download and comes in both IOS and Android. The watch was easy to set up. I haven’t started using it yet, as I’m letting it charge fully. It does count steps, heart rate, has a sleep mode, and I have gotten text notifications on it already. Comes with a magnetic USB charger but no outlet block FYI. I will update after I’ve started using and can provide better usage feedback.Editing to say: I’ve used this watch 24/7 for the last 2’ish weeks. I just had to charge the battery last night and it still has 21% left. It seems to track steps pretty accurately and the sleep mode looks pretty accurate. I leave it on to make sure all of my steps are counted from wake up to sleep. I like being able to get text messages from it too. I’m not a huge fan of the straps. It either feels too tight or too loose, and the loops don’t stay where placed to keep the strap from snagging (picture added to show which part I’m talking about.) Sometimes when pushing the button to turn the screen on it’s blank and black but you can tell the watch is on, not sure what’s going on it just started that yesterday.",
                        "timestamp": "Reviewed in the United States March 28, 2024",
                        "profile_id": "AGKT2Q3QJKJ2EVEC5EOSWKIK72CA",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RMVKQC5T1XLS6",
                        "title": "4.0 out of 5 stars Fitbit watch",
                        "author": "Beverly",
                        "rating": 4,
                        "content": "Track my health/dates",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AFACLNIW6ELEVHYOCEHFENWSYFYQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R3CWKZQVVKPMG3",
                        "title": "5.0 out of 5 stars All this for less than $25 ??!!",
                        "author": "T. Hernandez",
                        "rating": 5,
                        "content": "Okay; I’m old and I can’t see the numbers on my classic G-Shock watches anymore. I also don’t want to spend big bucks on an Apple Watch so, I opted for the sub $25 digital watch. Tons of options for the screen so choose you poison. I went with the full information led style watch face. Too many added features to list but, for the price, you can’t beat this little gem.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AGTHKCF4EXXDLNTC44XXR3AFZ4EQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 45mmColor: Black"
                    },
                    {
                        "id": "R34GSUJQRJ3L23",
                        "title": "4.0 out of 5 stars Counts your other activities as steps",
                        "author": "Taurus58",
                        "rating": 4,
                        "content": "The media could not be loaded. I like the fact it counts going up and downstairs etc.as part of step activities. Comfortable to wear,bright screen, good apps,good at notifications. I can't figure out how to count glasses of water.",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AHQ3VUQHVXEDUVL3KNT4UACXUZZA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RG16HNE90X3V9",
                        "title": "5.0 out of 5 stars Love it",
                        "author": "Stacy H",
                        "rating": 5,
                        "content": "Absolutely love this watch. Easy to use with the app. Love the color, charges fast. Long battery life.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AHE6CFGZE3PUFGBDGUYAYBKVE6SA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R15HGNWZEZCOPR",
                        "title": "5.0 out of 5 stars Great Watch for the Money",
                        "author": "Nicole Endy",
                        "rating": 5,
                        "content": "Bought this smartwatch to replace my Apple iWatch since I no longer have the carrier assigned to it. The Apple Watch unfortunately would not sync to my new phone number or to my new provider defeating the purpose of the watch.Found this one on Amazon in purple, waterproof and would monitor my heart rate and oxygen levels which were my main requirements for a new smartwatch.The package came earlier than expected which was great.The setup was quick and easy.It is working perfectly! I have been able to answer calls from my iPhone on it, view my text messages and messenger messages along with all of e-mails.The app that you need to download to track your activity allows you to even join groups like the Fitbit device to compete with other users of the device and join a little community for encouragement.There are so many features on this device that I know I will never use but that doesn’t matter. There are features for everyone to use no matter what your level of physical fitness is.The watch itself is easy to use as well and charges super quick!",
                        "timestamp": "Reviewed in the United States July 30, 2024",
                        "profile_id": "AF2L3OAUWLR5H6IBHBEFYVT2YQBQ",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C1GNXTSW",
                "product_name": "Smart Watch, Fitness Tracker with Heart Rate Monitor, Blood Oxygen, Sleep Tracking, 1.5 Inch Touchscreen Smartwatch for Android iOS Swimming Waterproof Pedometer Step Calories Tracker for Women Men",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:09:29",
            "updated_at": "2024-10-17 11:10:06",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252636838815356929",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0C1GNXTSW",
                "page": 5,
                "pages": 91,
                "reviews": [
                    {
                        "id": "RN2P9GVFXD9A7",
                        "title": "5.0 out of 5 stars Great for teens",
                        "author": "Andrea",
                        "rating": 5,
                        "content": "This has been perfect for my daughter who wanted a fitbit. She loves the color, design, and that she can track her steps, activity, and sleep. A whole lot cheaper than a name brand.",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AFXRXP7XXDM742QGQOUZKDR4PNJQ",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R1AU7YFIVVH4PF",
                        "title": "4.0 out of 5 stars Does what it says it’ll do",
                        "author": "Leigan",
                        "rating": 4,
                        "content": "",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AE5TR4VCXFD67OH26IKHY5DRWZIA",
                        "is_verified": true,
                        "product_attributes": "Size: 45mmColor: green"
                    },
                    {
                        "id": "R1B355IOBOQ4SF",
                        "title": "4.0 out of 5 stars Nice watch..doesn't sync automatically",
                        "author": "Linda",
                        "rating": 4,
                        "content": "It is a nice watch, however, every morning, I need to go to the app on my phone to sync or it stays on the previous day and time.",
                        "timestamp": "Reviewed in the United States August 16, 2024",
                        "profile_id": "AHU2BFDRNKETD5NAYWQBDQ2GKRBQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R1HME1PR6QDSL5",
                        "title": "5.0 out of 5 stars watch",
                        "author": "Cathy Smith",
                        "rating": 5,
                        "content": "My daughter got this to keep up with her pulse, etc. She loves it. It does what it says.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AGLOTSL367RP6GMPRXQGDPSCVLTQ",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R1K2ONTZ5GBDN2",
                        "title": "4.0 out of 5 stars Comprehensive Fitness Monitoring",
                        "author": "Tanya S",
                        "rating": 4,
                        "content": "The watch is a versatile fitness tracker that offers comprehensive monitoring capabilities. With features like heart rate monitoring, blood oxygen measurement, and sleep tracking, it provides valuable insights into overall health and well-being. I've found the heart rate monitor to be accurate and reliable, allowing me to track my heart rate during workouts and throughout the day. The blood oxygen measurement feature is also useful for monitoring oxygen saturation levels, especially during physical activity or sleep. The sleep tracking function provides detailed analysis of sleep patterns, helping me understand the quality of my sleep and identify areas for improvement.The watch itself is sleek and comfortable to wear, with a stylish design that complements any outfit. The battery life is impressive, lasting several days on a single charge.The TYKOIT Smart Watch offers excellent value for its price point, providing a wide range of features for fitness monitoring and overall health management. I've rated it 4 stars instead of 5 because the user interface could be more user friendly, it's still a solid choice for anyone looking to track their fitness and health metrics.",
                        "timestamp": "Reviewed in the United States April 7, 2024",
                        "profile_id": "AHW3AHHHSQUXYYBPJLB75PVPNBFQ",
                        "is_verified": true,
                        "helpful_count": 23,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2T2POQOWLYXBP",
                        "title": "4.0 out of 5 stars Smart watch",
                        "author": "Marty Sanchez",
                        "rating": 4,
                        "content": "So far working very well for the price. I wish that would be a little larger the screen itself, but the information is kind of hard to see. But so far the performance is good, I’m getting my notifications. It’s very accurate like I said I just wish the display was a little larger. I think it’s a great buy!",
                        "timestamp": "Reviewed in the United States July 7, 2024",
                        "profile_id": "AGZEOAWZZSC37JYHTHCYIEZ6WN4Q",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R1GO3BKL38X7CT",
                        "title": "5.0 out of 5 stars More than worth it!",
                        "author": "Phil Henderson",
                        "rating": 5,
                        "content": "My 3rd Garmin watch fizzled out, so I decided to go for the deal of a watch to track my steps for under $20. It holds a charge for over a week, I have not hooked it to my Iphone, but never intended to, so I can't speak to that. It's been great at tracking my steps, you can set it to not interrupt you at sleep time. There are celebration features when I reach a milestone and I enjoy those popping up. Give it a try!",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AHNGMUBE4ROEDHFIH6HMIUN7GBKA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "RW9SLQDQ5OXEG",
                        "title": "4.0 out of 5 stars It works",
                        "author": "Dusty Hummel",
                        "rating": 4,
                        "content": "This watch is really good for what you pay for it. The step counter is off a bit but not bad enough for me to hate it. I'm poor and this guy does just right by me",
                        "timestamp": "Reviewed in the United States July 26, 2024",
                        "profile_id": "AHDDASGNXPIR4CGLNI2OWNF7XQPQ",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Black"
                    },
                    {
                        "id": "R3OKZ5O06KPMA0",
                        "title": "4.0 out of 5 stars Super simple to set up.",
                        "author": "Leanna Pencil",
                        "rating": 4,
                        "content": "It's easily set-up and runs very well. Notifications run very well. It tracks steps very well. It has only tracked my sleep about half the nights I've worn it. I think if it is taken off for any time shortly before bed, it will not track sleep at all. The display is simple to figure out and runs quite well.",
                        "timestamp": "Reviewed in the United States July 8, 2024",
                        "profile_id": "AGXADYPR6RBEHOB7U4UHBOVMIEUA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Size: 41mmColor: Light Purple"
                    },
                    {
                        "id": "R1HMEB46KDPM7A",
                        "title": "4.0 out of 5 stars Nice watch",
                        "author": "Placeholder",
                        "rating": 4,
                        "content": "Inexpensive watch , and a nice watch . Has some great features . Pleased with it so far",
                        "timestamp": "Reviewed in the United States August 17, 2024",
                        "profile_id": "AGKHNQYRBNZ3WLKHBHBK6Z3YV4CA",
                        "is_verified": true,
                        "product_attributes": "Size: 41mmColor: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C1GNXTSW",
                "product_name": "Smart Watch, Fitness Tracker with Heart Rate Monitor, Blood Oxygen, Sleep Tracking, 1.5 Inch Touchscreen Smartwatch for Android iOS Swimming Waterproof Pedometer Step Calories Tracker for Women Men",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:09:29",
            "updated_at": "2024-10-17 11:10:07",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0C1GNXTSW?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252636838815356929",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:09:29",
        "domain": "com",
        "geo_location": null,
        "id": "7252636838815356929",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0C1GNXTSW",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:10:07",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252636838815356929",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252636838815356929/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252636838815356929/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252636838815356929/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636838815356929/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}