{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0C792QRW6",
                "page": 1,
                "pages": 134,
                "reviews": [
                    {
                        "id": "RTCSMLGCY9LV6",
                        "title": "5.0 out of 5 stars Make the Switch, Apple to Android.",
                        "author": "Trinity",
                        "rating": 5,
                        "content": "Coming from being an apple user and making the switch to android, this watch thus far is superior in almost every way in comparison. From the screen pixelation to sound quality to vibration intensity to superior app integrated. The samsung watch offers a variety of superior features which I think is definitely enticing enough for the switch. Coming from the apple watch it had the basics, the message replies, calls, apple pay, a few mediation and breathing apps, remote phone camera click and an ECG app that never worked. With the Samsung Galaxy watch 6 you're definitely getting better value per buck, you can use Google maps, a semi small but functional google web browser, a watch that measures your stress, gives you a decent review of how you slept from body temperature, heart rate and the cycles of sleep from rem to awake, a customizable watch face, Gmail, YouTube music, various work out apps, fitness and calorie tracking apps, games, a variety of music listening apps, etc. The only necessary cons I would mention about this watch is the voice to text feature isn't quite as consistent or picks up words correctly and the battery life is definitely a little short then my previous apple watch and the band that it comes with for us petite people is horrendous; I had it on the smallest hook and it was still about 3 inches above my wrist and would slide down, thankfully I bought a replacement band that is much better, however I would say for the value, quality and features this the watch to go.",
                        "timestamp": "Reviewed in the United States August 1, 2024",
                        "profile_id": "AHOBKJOMVVK24DIPC7SQCJDILNNQ",
                        "is_verified": true,
                        "helpful_count": 134,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "RFOTIJ7EFLAUO",
                        "title": "5.0 out of 5 stars Best Smart Watch I've had Thus Far",
                        "author": "Ryn",
                        "rating": 5,
                        "content": "Got it used and it's in great condition.I've only ever had fitbits in the past, and this is really nice in comparison. Especially since I have a Samsung phone. Set up was a breeze.The battery does drain after about 24hr, if you're using the more advanced tracking capabilities. But I just charge it every morning while I'm showering. It charges extremely fast.I love the level of customization, and especially like that it automatically has everything from my phone connected, including my calendar and text messages. Very useful for my adhd forgetfulness. Even with reminders set in my phone, I still often miss them. This watch is always connected to my wrist, even if my phone is on silent or not on me, my watch always buzzes and let's me know. I've missed a lot fewer things because of it.",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AHNR6GIETU5L7LF3F5QK4B5WZXVQ",
                        "is_verified": true,
                        "helpful_count": 43,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3CFTN00NLTEKH",
                        "title": "5.0 out of 5 stars watch is nice",
                        "author": "T. Thomas",
                        "rating": 5,
                        "content": "It fits well. The face is not too big or too small. The band is made of some rubber substance it is comfortable. I do sleep in it occasionally to get a sleep score. The battery life is only about 2 days, sometimes less when I use it more. I like that I can keep my phone at my desk or on the charging station and I know when I get calls, texts, emails etc. I also like that I am able to change the watch face. Lastly, it does keep accurate time.",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AFXD5FS4EG5GC72UDNGZTUNYCLHA",
                        "is_verified": true,
                        "helpful_count": 16,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2LO3A3JD2KH9D",
                        "title": "4.0 out of 5 stars Pretty sweet smartwatch, with caveats",
                        "author": "A. Bombac",
                        "rating": 4,
                        "content": "I've got a handful of pointers regarding this watch that you might heed before buying it. That being said, I love the thing as of a few months owning it.Pros:1. The watch has many functions for health monitoring and is top of its class in that regard.2. It has the perfect sized face on it, not small at all but not too big.3. It feels sturdy all around, glass included.4. The amount of great digital faces available for free and for purchase (typically $1-$2 only) is awesome.5. It does GPS tracking for hiking and mountain bike rides that is used to display your path/location on a map in the Samsung Health app at the end of a workout, so you don't need to pay some obnoxious subscription for a 3rd party app like Strava to track that.6. Given that my last watch, a FitBit Sense, literally corroded and burned my wrist skin at the battery contact points, I'm all for the new non-electrical / \"wireless\" (magnetic) charging functionality of this one and will promote that as a reason to get one.Cons:1. It is hard to dial in the best watchband length/size with spare links. You either get it too loose and then the sensors don't work well (way inaccurate heart rate readings during workouts, lack of blood oxygen readings at night, etc), or you get it too tight and the watch clasp pops undone constantly as you go about your day or your hand circulation suffers while you're trying to sleep. Unless you don't mind adjusting the links on your band twice per day or more (even in the middle of the night since everyone's wrists expand as we sleep), it might be best to go with a synthetic, flexible band that you can switch out to for when you're not dressed nicely on an outing or something (the band does at least look good). I have done this and it is way easier to wear now.2. Bixby seems to randomly activate, which takes over your screen with her icon and a note that says \"Listening\". You have to swipe or push buttons to close out of this prompt every time it happens.3. Sometimes there is a delayed response time when switching activities on the watch such as going from your clock face to starting a biking workout, and it feels clunky.4. Randomly vibrates, often twice or three times within a 5 second period, without any notification on the screen as to why.5. When starting a hike in the watch OS, it seems to possibly take your last known elevation and then add whatever the difference is between that and your starting elevation, and it claims you've climbed that height within the workout you are doing at the moment, which is entirely erroneous. That's what I want to believe it is doing, anyway - it could just be super glitchy and thinks you are actually thousands of feet higher than you really are at some point during the workout, due to satellite connectivity or data or something strange, and just jumps your workout to having done that kind of climb.6. The battery lasts about half as long as my FitBit Sense did prior to this, for some reason, despite having the face set to not be always on.7. The blood oxygen saturation sensor must have some kind of weak detector or can't record information when the watch is loosened up for sleep time (to prevent tightening during the night when our wrists swell a bit), because there are typically many gaps in the O2 data on the nightly chart.Takeaway:The watch is well worth it if it is on a good sale, so long as you know that it's not perfect (which the regular price would seem to indicate).",
                        "timestamp": "Reviewed in the United States August 18, 2024",
                        "profile_id": "AGVLJY7MM5KF53TRBXXZJVBKZ3FA",
                        "is_verified": true,
                        "helpful_count": 71,
                        "product_attributes": "Color: BlackSize: 47mmStyle: BespokePattern Name: Watch6 Bespoke"
                    },
                    {
                        "id": "RTB7L8HO6UGEO",
                        "title": "5.0 out of 5 stars AMAZING WATCH",
                        "author": "Pandalox",
                        "rating": 5,
                        "content": "The Samsung Galaxy Watch6 44mm is a remarkable blend of style, functionality, and advanced technology. Right out of the box, the sleek design catches the eye, with a larger, vibrant display that enhances visibility and user interaction. The watch feels premium on the wrist, thanks to its lightweight yet durable build.One of the standout features is its impressive health tracking capabilities. The Galaxy Watch6 offers an array of sensors that monitor heart rate, SpO2 levels, and sleep patterns with impressive accuracy. The Sleep Coaching feature provides personalized insights, helping users improve their sleep quality. Fitness enthusiasts will appreciate the extensive workout modes, which cater to various activities, from running to yoga, all while providing real-time stats.The smartwatch integrates seamlessly with Android devices, offering notifications for calls, messages, and apps right on your wrist. The Bluetooth connectivity ensures a smooth experience, allowing you to control music, respond to messages, and even answer calls without reaching for your phone.Battery life is commendable, lasting multiple days with moderate use. The charging process is quick, so you won't be left waiting long to get back on track. Additionally, the customizability of watch faces and straps allows users to personalize their device, making it suitable for both casual and formal occasions.Overall, the Samsung Galaxy Watch6 44mm Bluetooth Smartwatch is an excellent choice for anyone looking to enhance their smartwatch experience. Its combination of stylish design, robust health tracking, and seamless connectivity makes it a top contender in the smartwatch market. Whether for fitness tracking or everyday use, it delivers on all fronts.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AEBGLIM4QN4I4XKETVHRGRODVUBQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2RLZZ981C0O5I",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "Tom",
                        "rating": 5,
                        "content": "I finally did it, bought a smart watch. Wow this is a great watch. Does more than i expected. Great buy and great price.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AGF3GVSBCBFCIETHBQI3DDMK6VOQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R36AXJ9PG0B6GD",
                        "title": "5.0 out of 5 stars Another winning Samsung product",
                        "author": "Dan",
                        "rating": 5,
                        "content": "First off, the label next to my name says I’m a VINE VOICE reviewer. That is correct, however, please note that I paid for this watch myself with my own funds and the following are my unbiased and independent comments.I bought this watch brand new about 7 weeks ago. It is the standard 44mm Bluetooth Watch (not Classic, not LTE). This watch takes the best from Samsung (SS) and Google. The features are excellent but please realize that to use them to their full potential, you must use a SS Android Phone that is compatible with the watch. My phone is a SS Galaxy S10+ phone.My experience over the past years with smart watches includes four $300-$400 watches from competitors and none have superseded or matched the performance of this device (excluding battery duration without needing a charge). In addition, I owned the SS Galaxy Watch 5. The Galaxy Watch 6 counters seem accurate when checked with other devices that are calibrated and they are easy to use. For example, I do a lot of walking both indoors and out. The outdoor distance counter and GPS has been right on. When I walk indoors, it’s on a measured track that is exactly one mile. The distance counter on the watch is generally within a couple of percent of the track, which, in my experience, is far superior to those other competitors. With cycling, I’ve found the Galaxy Watch 6 to be great in measuring distances, speeds, heart rate, etc. The SS Health App teams well with the Watch 6.The UI is very similar to, if not identical to the others in the latest SS Galaxy watch family. The apps that are available for this watch are many and I’d guess are all interchangeable.Why did I upgrade from my Galaxy Watch 5? It was primarily due to the Watch 6’s upgrade to the hardware, but to me, it was important to have the technology that will seamlessly connect the watch to a new SS phone when the time comes to upgrade the phone. I understand this feature is available on the Galaxy Watch 6. Earlier versions require you to re-profile the watch settings when you change to a new phone.Did I have any issues with the watch? To begin, as others have noted, battery life could be better, but I am getting 2+ days on a full charge. I’m good with this, even though it is not as good as other brands. As far as recharging the watch, when I first received the watch, it took 2 to 3 hours to recharge, I felt this was excessive. There is the “Samsung Members” app to trouble shoot the device, and in addition, SS can “remote” into the watch through the phone to troubleshoot further. Don’t want to be repetitive, but you need a SS phone for SS Tech Support to do this. After some over the phone troubleshooting with SS and sending the watch back to them under warranty, they found that the charging cable was faulty and was the cause of the long recharge time. SS replaced the cable under warranty (after a 4 week long backorder delay), and now it takes an hour to recharge the watch from 20% to 100%. This is the expected time to recharge the watch. Kudos to SS Service, they were generally responsive in troubleshooting this issue and correcting it.I’m satisfied with this watch, it's appearance, and all it can do and can recommend it if you are in the market for a new smart watch.",
                        "timestamp": "Reviewed in the United States September 29, 2023",
                        "profile_id": "AF3CYEQJX5HFH6VQKMUFZWQJ2KMQ",
                        "is_verified": true,
                        "helpful_count": 277,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1C0O21N419HI2",
                        "title": "5.0 out of 5 stars Samsung Watch 6 - Stylish and Functional",
                        "author": "tracey somsouk",
                        "rating": 5,
                        "content": "I recently upgraded to the Samsung Watch 6, finally replacing my old Samsung Gear, and I couldn’t be happier! The design is sleek, modern, and fits perfectly on my wrist. It’s a huge improvement in both style and comfort, making it a great accessory that I can wear all day.But what really stands out is the functionality. It seamlessly integrates with my phone, keeping me connected with notifications, calls, and messages. The health tracking features are more advanced than ever, and I love how user-friendly the interface is. Whether it’s tracking my steps, monitoring my heart rate, or even using the GPS during walks with my dog, Kobe, the Samsung Watch 6 has become an essential part of my daily routine.Overall, I’m loving the upgrade! It’s the perfect blend of looks and functionality, and I’m glad I made the switch.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AHY7DKGTXFPE57FLBNILG6JFTTTQ",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2WRZR1HEXXFFO",
                        "title": "3.0 out of 5 stars Software keeps beautiful hardware down",
                        "author": "dt2008",
                        "rating": 3,
                        "content": "I have used two fitness trackers in the past: the Fitbit Charge 2 and the Fitbit Versa 2. I will compare the Samsung Galaxy Watch 6 to the Fitbit Versa 2, since it's the only other smartwatch I have used. I tried the watch with two different Samsung Galaxy smartphones: the S22 Ultra and the Z Flip 5.Pros:- Samsung Galaxy Watch 6 has a beautiful, wide-enough display. It was the biggest reason I could never go for a Watch 4 or 5.- 2 side buttons with different customizable shortcut options.- It has both a microphone to dictate text messages, e-mails, commands, etc. AND a loud speaker. You can play back YouTube Music, for example, without bluetooth earbuds.- It has Wi-Fi, so it can connect to your network instead of just your smartphone, which helps with downloading / streaming.- Temperature sensors which can aid better cycle tracking (ovulation timing, etc.)- The watch can consistently charge up an extra 55% in 30 minutes. Great for quick morning or evening routines.- If you have a Samsung Galaxy smartphone with wireless power sharing features, you can place this watch on the back of your smartphone to charge up if you don't have the watch charger with you and need a top up. If you do have the watch charger, you can plug it into any USB-C smartphone or tablet and pull charge there.- Unlike Fitbit Pay, there are more banking and credit card partners that work in both Google Wallet and Samsung Pay.- You can control playback on your smartphone with the watch.- GPS tracking for long walks and hiking provides a map, similar to Fitbit.Cons:Unfortunately, every Pro also has a con with this watch!- While there is fast charging, the battery life is 24 hours at best. Fitbit Versa or Sense users--be prepared! I turned on the Sleep tracking feature and lost 15% overnight! I charged the watch up to 100% at 6:30 am and by 9:00 pm I was at 34% (Wi-Fi, Location, Bluetooth and NFC were turned on, and I used NFC to set up several credit cards in Samsung Pay). If I turned most of these off, where's the appeal in a smartwatch?- I initially set up the Galaxy Watch 6 on the S22 Ultra, and it was so confusing. First, I needed to set up the watch in an app called Galaxy Wearable, then I needed to install Samsung Health to get fitness and wellness tracking, but finally I needed Samsung Health Monitor to use the ECG feature of the watch! Of course, each of these apps has its own T&C, privacy policy and profile set ups required!- Samsung Health is presumably made by a Korean company which uses the metric measuring system, but I can only enter in glasses of water in U.S. 8 fluid ounce increments. I understand I purchased the watch in the U.S., but it's poorly thought out. They should turn on the ability to track food and water intake in metric units, like Fitbit.- The first time I did the ECG test, I had to place 2 fingers on the two different buttons. Three days later, I went to the ECG test again, and had to go through another policy agreement screen and then was told to only use 1 finger. No idea why this has changed. Some information about how it works vs. before would be interesting.- The watch cannot sync your sound settings with your Galaxy smartphone. If I am in a quiet space and put my phone on Silent, the watch cannot sync that setting. I have to manually go into the watch's control panel and put it on silent. If you use the Modes and Routines function of Samsung's One UI 5, you'll know how convenient it is to use Location or Wi-Fi connections to stipulate if your phone should be on silent! Connected to library wi-fi? = phone silent. At home = phone vibrate+sound. If this watch could sync with the smartphone, it'd be truly \"smart.\"- I feel that the Galaxy Watch 6 overstates my level of activity. It feels like I get a trophy just for puttering about. I walk around the office here and there for 2 minutes and by the time I get back to my desk to leave at the end of the day, it says I've reached my level of activity for the day?? Fitbit is more drill sergeant in that regard--I need to actually be moving for a consecutive amount of time and energy level for it to register as \"exercise/workout.\" No freeby trophies.- I had to figure out through complex swipes how to stop my walking workout--it was not intuitive. The Fitbit uses a simple Flag as the goal icon to end the workout.- Although not fitness related, one of the big draws for this watch was the ability to use Google Wallet since some of my banks do not allow Fitbit Pay. Although Google Wallet works with manager major U.S. credit card issuers, and although one credit card in particular (Discover) could show up in my smartphone's Google Wallet, it just will NOT allow itself to be sent to the watch's Google Wallet app.This isn't Samsung's fault, I thought. So I decided to try out Samsung Pay. First, the app has to be installed and set up on the phone, which defaults to an annoying Quick Access gesture which is nearly identical to the swipe up to show all apps gesture. I tried multiple times to add the Discover card and several other credit cards, and finally was successful the 3rd time I tried to add. This is after getting multiple frozen screen prompts to Add to Samsung Pay.- The apps that are on the Watch and accompany it on the Samsung Galaxy smartphones, as ever, have English spelling mistakes littered throughout that I have never seen in my Apple Wallet or with Apple Pay. Language Localization should not be so poorly done.- Since I started with the Samsung Galaxy S22 Ultra but was transferring over to a Samsung Galaxy Z Flip 5, I decided to use the Watch > Settings > Transfer to New Phone. This app did not work. It would find the watch 6 when I had the Galaxy Wearable app open on the new Flip 5, then ask if I would agree to automatic updates (optional) - I selected NO - then next. Nothing happened. Blank white screen, and a failure notice on the watch. After 4 attempts and seeing 2 different Galaxy Watch 6 options appear in the new Flip 5's Galaxy Wearable app for syncing, I finally decided OK FINE I WILL DO THE OPTIONAL AUTOMATIC UPDATES -- still a blank white screen. I didn't want to erase and set up all over again, so I am still on the S22 Ultra. I do not know if this is a Google WearOS issue or a Samsung issue, but it was a sour experience.- Another USB-C to USB-C device with no charger brick or USB-A adapter. At the very least, a C to A adapter would have been nice and of very little weight to help bridge the hurdle to an all USB-C world.Beautiful, stylish smartwatch with a gorgeous screen is ruined by software quirks of Google WearOS and Samsung's fragmented health-related apps. Maybe progressive updates will fix this. Do you want to gamble $299 on a maybe?",
                        "timestamp": "Reviewed in the United States August 24, 2023",
                        "profile_id": "AHNHKMROI63ACJGOSFCSBI27UAWQ",
                        "is_verified": true,
                        "helpful_count": 150,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R14FY52O1LO00N",
                        "title": "5.0 out of 5 stars Great upgrade from my Samsung Active2 watch.",
                        "author": "Matt",
                        "rating": 5,
                        "content": "First of all, I love that the media player will now let me rewind and fast forward YouTube rather than just skip to the next video when wearing earbuds. This might sound like an insignificant feature, but it's valuable to me because I can wear earbuds at work, but I'm not allowed to get my phone out of my pocket.Another notable improvement is that the bezel and other touches to the screen are much more responsive than my old watch, which would sometimes have a delay.The fast charging is significantly better than the charge time of my old watch. I was a little worried for the first few days because it was draining 65% of my battery in less than 4 hours, and I had to carry the charger to work and use a power bank to charge it on lunch break. But I did some googling and learned it was an issue with Google assistant, and once I uninstallled that my battery lasted all day, draining maybe 5% per hour. And that's with having continuous heart rate monitoring and other Samsung Health features like tracking my steps.My only real complaint is that on my old watch, when using voice text, I could say period to make a \".\" comma to make a \",\" etc. but on this new phone it only types out the words, and the only way to use punctuation is by using the keyboard. Which can be frustrating when I planned on carrying the watch by itself and using a data plan and number sharing to text when I'm on walks or runs on my days off.Overall, I'm glad I upgraded and found it worth the cost. Especially since my old watch did not have the ability to use standalone with a data plan and numbersharing.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AEUYOGTJYZLOW236MWXDM5IJ75MQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: LTEPattern Name: Watch6"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C792QRW6",
                "product_name": "SAMSUNG Galaxy Watch 6 40mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:15:50",
            "updated_at": "2024-10-17 11:15:52",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252638437092636673",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0C792QRW6",
                "page": 2,
                "pages": 134,
                "reviews": [
                    {
                        "id": "RJUPIBPK7IZIC",
                        "title": "5.0 out of 5 stars Samsung Galaxy Watch 6 Classic 47mm Bluetooth Smartwatch",
                        "author": "Benjamin",
                        "rating": 5,
                        "content": "I've been using the Samsung Galaxy Watch 6 Classic 47mm Bluetooth Smartwatch for a few weeks now, and it has exceeded my expectations in several ways. From design to functionality, this smartwatch offers a premium experience.First and foremost, the design of the Watch 6 Classic is stunning. The 47mm size strikes a perfect balance between being substantial and not overly bulky on the wrist. The classic rotating bezel is back, which not only adds a touch of nostalgia but also provides a highly intuitive way to navigate the interface. The build quality is top-notch, with a robust stainless steel case and a clear, vibrant AMOLED display that’s easy to read even in bright sunlight.Performance-wise, the Galaxy Watch 6 Classic is impressive. It runs on Samsung’s latest Wear OS, which is smooth and responsive. The integration with Android is seamless, making it easy to receive notifications, respond to messages, and control music playback directly from the watch. The Bluetooth connectivity is reliable, with no noticeable lags or disconnections.One of the standout features is its comprehensive health and fitness tracking. The watch offers accurate heart rate monitoring, sleep tracking, and even advanced metrics like body composition analysis. The GPS functionality works well for outdoor activities, and the array of workout modes is extensive. The built-in health apps are useful and provide insightful data that can help you stay on top of your fitness goals.Battery life is another strong point. Despite its powerful features, the Watch 6 Classic manages to last around two days on a single charge with moderate use. This is quite reasonable for a smartwatch with such a rich feature set. The charging speed is also satisfactory, with the watch reaching full charge relatively quickly.However, there are a few minor downsides. The size, while perfect for many, might be too large for those with smaller wrists. Additionally, while the watch offers extensive features, some users might find the interface a bit overwhelming at first, especially if they are new to smartwatches.Overall, the Samsung Galaxy Watch 6 Classic 47mm Bluetooth Smartwatch is an excellent choice for anyone looking for a premium smartwatch that combines classic design with modern functionality. It’s a versatile device that caters to both tech enthusiasts and fitness-minded individuals, making it one of the best smartwatches currently available.",
                        "timestamp": "Reviewed in the United States August 2, 2024",
                        "profile_id": "AEDFDKIODHQSLQYGURCJ636SCTIA",
                        "is_verified": true,
                        "helpful_count": 13,
                        "product_attributes": "Color: SilverSize: 47mmStyle: BluetoothPattern Name: Watch6 Classic"
                    },
                    {
                        "id": "R37SQM0ZRO9WIK",
                        "title": "5.0 out of 5 stars no external heart rate monitor via Bluetooth was a deal breaker for me",
                        "author": "Human-bot",
                        "rating": 5,
                        "content": "really wanted to keep this watch as the 40 mm size was perfect and loved the features.My use case was very simple, using it as a stand alone cycling fitness tracker that syncs to Strava fitness app. I wanted it to record my miles ridden with gps and also leave my phone at home and still be able to make phone calls in case of emergency. Everything was working fine even though the miles tracked with gps were about a tenth of a mile off from my phone for every ten miles ridden. I could tell from the gps map of my ride using both the watch and the phone that my phone was able to track more accurately. There was less variability in the gps signal.Ok, so I could live with gps being off by a mile over a 100 mile bike ride.I was also comfortable with the battery life. Seemed like I could get a good 7hours or more using cellular, gps tracking, and data service. The rest of my day I didn't even wear the watch.The deal breaker for me was the lack of external heart rate monitor support.Shocker! I have seen reviews saying how the heart rate tracking for the samsungs weren't that good and I had an external polar heart rate monitor I wanted to use. Well, I could not do that. I could not get my motorola phone to recognize the HR Monitor via bluetooth. I researched some and found some people had luck getting it to work with a little effort but only with a Samsung phone. Mine was a motorola.Sorry, but I need an external hr sensor so that was the deal breaker since I know the google pixel watch and the apple watches support that.If you're not picky like me and can live with the less accurate heart rate tracking built into the watch then it's a great device and probably the best android based watch. I really didn't want to have to move to the apple eco system just for a watch.",
                        "timestamp": "Reviewed in the United States July 25, 2024",
                        "profile_id": "AH2FDTNZV7PHBS62PTTVHJTAQJTA",
                        "is_verified": true,
                        "helpful_count": 8,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: LTEPattern Name: Watch6"
                    },
                    {
                        "id": "R2RU17RI72DCGN",
                        "title": "5.0 out of 5 stars Muy bonito, practico y completo",
                        "author": "Ana Naranjo",
                        "rating": 5,
                        "content": "Es un reloj muy completo, todas las funciones que uno se pueda imaginar. El precio muy bueno pero unos días después de comprarlo salió en los días prime con más descuento todavía, mi impaciencia me jugó una mala pasada porque pude haberme ahorrado otros dolaritos. En cuanto al reloj, es excelente y recomiendo ampliamente que ahorres hasta que tengas con que comprarte un reloj original de Samsung y no inviertas en relojes más económicos que si bien funcionan sin problema (tengo uno de amazon fit y esta perfecto), no tienen todas las funcionalidades de este tipo de relojes.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AEKH5DSJ3JKFXFBR6JR53EKUCJ7A",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R11ENYGN9XH9X4",
                        "title": "4.0 out of 5 stars Samsung doesn't have FDA approved blood pressure monitoring on this watch",
                        "author": "Ewell",
                        "rating": 4,
                        "content": "I love this watch, it sincs up great with my phone.I didn't give a 5 * rating because it doesn't do blood pressure monitoring.The biggest disappointment is that the watch doesn't have blood pressure monitoring. This was one of the purposes for getting a smart watch for me. As far as I can tell Samsung doesn't have a watch with FDA approval. However, other countries do have an ap with the ability. Come on Samsung, get on with it!I like the way the band fits. It can even monitor your snoring, heart rate, oxygen level and your exercise activity.Overall it's a great watch. The battery doesn't stay charged very long. My old smart watch would stay charged for 3 days. This one needs charging pretty much daily.",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AHYKOE2XTJO57L2EMOASNAVGBZTQ",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "RGLD0X434TP9L",
                        "title": "4.0 out of 5 stars Day 1! So far sooooo good",
                        "author": "Samantha Swanson",
                        "rating": 4,
                        "content": "Only complaint so far is the battery drains SUPER QUICK when you're looking through your apps but other than that it's awesome! I have wanted a smart watch ever since I found out you can text back on them and seeing them on sale I couldn't resist anymore! Looks amazing I tested the typing and while the keyboard is teeny tiny (for obvious reasons) I can still swipe text pretty nicely on it! If I have any big problems I'll update!",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHWWACCJF3VEX7W73A5U3HM3NGHA",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2JP57FOIXRKVP",
                        "title": "5.0 out of 5 stars 34 hours since full charge and sitting pretty at 54%",
                        "author": "Gadget Man Forever!",
                        "rating": 5,
                        "content": "Samsung is such a good company. I bought the 40mm galaxy watch 6 from amazon. But Ihad to send it in for repair to Samsung. They sent me a email saying the watch was not repairable as they would give m e a full refund. Guess what! They did. I will tell you what. If a company gives you your money back if something is not fixable that's a great guarantee and peace of mind. I used the money from that one I got back to pay for the 44m version. It is just wonderful. I really love it and they have great products. Most importantly they stand behind their products 44mm has the bigger battery and you should go for that one. It also makes the touch screen easier.",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AGY46IAF7ODH3XWJEGTV2GYGYKVQ",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "ROMJC92DFGP7W",
                        "title": "5.0 out of 5 stars It's more than a watch!",
                        "author": "Bel B",
                        "rating": 5,
                        "content": "Why didn't I get one of these much sooner? It's great to know how much moving I've done. I also like the reminders to get up and move. I haven't explored everything it can do, but it sure is nice to use this to make calls and receive them when I have no idea where my phone is.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AGOOGRKUI7XOXJJNXW5FH4Y4DBVQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1ZZTVDSUE984F",
                        "title": "5.0 out of 5 stars Better than my fitbit!!",
                        "author": "THawkins",
                        "rating": 5,
                        "content": "I am loving the features on this Samsung Watch! I was hesitant to upgrade from my fit bit, but when it died for the 3rd time in 3 years, thought it was time for a change. The only drawback to this watch is the battery does not last nearly as long, but I can deal with that! I love the fitness features, and the ECG that can be done if necessary... I don't need that yet, but could in the future! This watch has been a dream so I hope it lasts longer than my fit bit did!",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AH7M4QVPM4HD2HEFONE6CU2FMEHQ",
                        "is_verified": true,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "RGQVZVSVXCWMX",
                        "title": "5.0 out of 5 stars Better than my Fitbit",
                        "author": "April",
                        "rating": 5,
                        "content": "I have a fitbit however this watch is amazing. I love the EKG which you can download the results and email it to your doctor. It has many functions, and when I call people on the watch they can hear me clearly. I feel like a kid in a candy store.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AEDE25WC2YWVKAY5TB3ECSO6ULTA",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R19ZNDG4NJILW4",
                        "title": "4.0 out of 5 stars Works for me",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "I really like this watch. Easy to manage, works with my phone flawlessly. Lots of watch faces available online for this watch, face for every need. A bit bulky but most all of the smart watches are. Bright face, love the rotating bezel.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AHCBYDG3K3QLJF2O7IAAYHBDHNMA",
                        "is_verified": true,
                        "product_attributes": "Color: SilverSize: 47mmStyle: BluetoothPattern Name: Watch6 Classic"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C792QRW6",
                "product_name": "SAMSUNG Galaxy Watch 6 40mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:15:50",
            "updated_at": "2024-10-17 11:15:54",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252638437092636673",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0C792QRW6",
                "page": 3,
                "pages": 134,
                "reviews": [
                    {
                        "id": "R1LYS7KIGB1S1I",
                        "title": "4.0 out of 5 stars Love love love this watch",
                        "author": "Vanessa Truelove",
                        "rating": 4,
                        "content": "I love this watch and it does all the things I need/want it to do! My only issue with it is that the bevel around the edge is quite thick so having a colored background on your watch face looks kinda funny.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AFRHCM4BUJEWI3MFK5SDUZBJAP5A",
                        "is_verified": true,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R32OWGD76VLDFY",
                        "title": "5.0 out of 5 stars Very good, but...",
                        "author": "Linda Graul",
                        "rating": 5,
                        "content": "When I purchased this watch I thought it could be connected to Verizon, but learned that it was the wrong version of the Samsung Galaxy Watch6 which only connected by Blue-Tooth, so I returned it and purchased the one I wanted. The quality of this watch is excellent and I would recommend it to anyone who doesn't need to connect it to a provider.",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AFPZVD433XJSQGDRQM3U3GREGUPQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1AVZ1BTATU10B",
                        "title": "4.0 out of 5 stars Good but smears",
                        "author": "Nicholas Lindberg",
                        "rating": 4,
                        "content": "First ever smart watch buyer. I use an android phone, so I got this on sale during Prime Day. I like it, except it smears whenever I use the touch screen (drives my OCD crazy) even with freshly washed hands. Nothing a quick wipe on my pants can't fix, but it's annoying to have to keep doing that every so often. I also don't know how accurate the pulse reader is (swings of nearly 60 bpm at rest every other reading). Here's hoping it's the watch and not me lol.",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AH2HQ6W3BAERKCOZZE2TIMKQOKSQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2F6DL7HZHHTN2",
                        "title": "4.0 out of 5 stars Reviews",
                        "author": "Keegan Stall",
                        "rating": 4,
                        "content": "The watch is amazing and also came with charger (as expected) the only thing is that it didn't come with a block that was compatible with the charger. I only had ones that went with type b chargers not type c. I needed to go buy one to charge the watch.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AGQGAMZM2LZKUJD2FPUQ5IW3RC7A",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R6GH59SU2BW7V",
                        "title": "4.0 out of 5 stars Very solid smartwatch",
                        "author": "Raul Lozano",
                        "rating": 4,
                        "content": "I did not rate with 5 stars, as I am disappointed with battery duration and time to charge. It takes a one hour charge every day to keep it working. Compared to a Fitbit Versa I had, that only needed 10 - 15 min per day.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AERVD5JY46XMST3KNUCC5CMZSR6A",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "RM7A77QG71WPC",
                        "title": "4.0 out of 5 stars Great watch",
                        "author": "Sandra Phipps",
                        "rating": 4,
                        "content": "It was not as advertised and with a manual in your phone you that must be downloaded before installing your watch. It was more of a chores than a pleasure of watches. I ended sending it pack for a $19.99 watch at Walmart which is pretty to look at, easy to read, & no need to install software or updates. Much happier with this one over the expensive one from Samsung.",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AE3NHUTILESNN5R5AYXW4NAKNY3A",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3CL6TG576KR1T",
                        "title": "5.0 out of 5 stars A great watch",
                        "author": "Sarah",
                        "rating": 5,
                        "content": "1st off, get a screen protector before wearing the watch. I did and I am so grateful. I am always doing things and have cracked 2 screen protectors. The watch is completely fine.I had a Garmin vivoactive that I was happy with but I messed it up so I decided to get this. I have had for a bit now and have had no issues. I live that I can add apps, talk to text but I really love that when I'm walking, it will automatically start tracking and after 10 minutes it will let me know its tracking my activity. This makes it worth buying for me because I always forget to set my watch up when walking.I'm not a tech person but I think it's a great watch.",
                        "timestamp": "Reviewed in the United States August 31, 2024",
                        "profile_id": "AHM7NUJFWBIOYQECM6ETTCPMKL2A",
                        "is_verified": true,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2N5M6W32KXCF5",
                        "title": "4.0 out of 5 stars Not Easy to Figure Out",
                        "author": "Young Not Young",
                        "rating": 4,
                        "content": "It's durable, but the silicone band is very sweaty (you can replace with other band types--Amazon has tons to choose from) and it's taking me a long time to figure out. I've also found that it only wants you to use Samsung apps, not Google or others that I use on my phone. For example, I cannot talk-to-text a message and send it to a contact of mine unless I use Samsung Voice, Samsung messaging, and have my contacts saved to my phone using Samsung's phone app. Which I don't use because I find them to be inferior. So that's annoying. It also has all these fitness things I couldn't care less about since I bought this for work. I just think it could be more flexible, more user-friendly, and more customizable.",
                        "timestamp": "Reviewed in the United States August 23, 2024",
                        "profile_id": "AF7SL3IQ2CTTGNA6PXLGZQASLBOQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1M1P75JPRAXFZ",
                        "title": "5.0 out of 5 stars The Samsung health data",
                        "author": "dobliv",
                        "rating": 5,
                        "content": "After researching the reviews on smart watches it came down to the Samsung watch 6 and the Garmin Vivoactive 5. I chose the 6 because it is more compatible to my Samsung apps. I'm glad I got the Samsung watch 6. It's size is perfect and fits comfortably on my wrist. I sleep with it on for the sleep information and barely know its on my wrist. The battery life could be better but I found that putting it on the charger for a short time, makes it manageable. Love the selection of watch faces! I play a lot of Pickle ball and wear my watch to record the activity. No regrets purchasing this watch. I highly recommend the Samsung watch 6. This watch is as good, if not better, than the watch 7.",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AHGOFXLU345Y7BLXUM3WGK72TGRQ",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2EUWQG41VXI6S",
                        "title": "4.0 out of 5 stars Watch loaded with details",
                        "author": "Teril",
                        "rating": 4,
                        "content": "I bought this watch to work with my samsung phone. It works great! I wanted a watch for fall detection (to keep my sister happy since I live alone); I'm tracking my sleep patterns with my watch; tracking my # of steps & it detects when I start an activity like my afternoon walk. My messages & phone calls come to my watch. I can do pretty much everything on the watch that I can do on my phone. It is so comfortable to wear, that i don't mind sleeping with it on. It comes with the charger, but you will have to buy a C type block to plug the charger into. Overall, it's a great watch but the reason I took 1 star off is that the band is on the tightest setting and it's a little loose on my wrist, so I'll probably need to buy some more adjustable bands. There are also bezel & screen protectors that I plan on buying.",
                        "timestamp": "Reviewed in the United States July 31, 2024",
                        "profile_id": "AE4SKMRKUF6ZD4YEM2EFAI2LTKBA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C792QRW6",
                "product_name": "SAMSUNG Galaxy Watch 6 40mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:15:50",
            "updated_at": "2024-10-17 11:16:06",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252638437092636673",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0C792QRW6",
                "page": 4,
                "pages": 134,
                "reviews": [
                    {
                        "id": "R2KTOYHAPB3YZL",
                        "title": "3.0 out of 5 stars Doesn't Ship with Wall Charging Adapter",
                        "author": "R&T",
                        "rating": 3,
                        "content": "I just received my Samsung Galaxy Watch 6 and I'm already pretty annoyed and irritated. Nowhere on the product description page does it mention that the watch doesn't ship with a wall adapter for the USB-C charging cable. So out of the box, I can't charge my watch. Had I known the watch wouldn't come with a specialized adapter for charging, I would have ordered one when I ordered the watch. Now, I will have to wait 2 more days for the wall adapter to arrive before I can successfully charge the watch. I haven't evaluated any other features of the watch yet and I will update this review with more or less stars once I figure out how the watch functions. But out of the box, I'm annoyed I don't have all the gear I need to be successful. For a $250 product it feels lazy and cheap that Samsung is nickel and diming customers by neglecting to provide a wall adapter to charge the device AND omitting the fact the device doesn't ship with all necessary components, so you are surprised when you open the box and cannot charge your device. Unfortunate and honestly, unacceptable. It should be clear that the consumer needs to purchase additional components in order for the device to function. Most consumers are not clairvoyant, so I'm not sure how or why I was expected to know this information without it being clearly communicated on the item's description.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AHAZDKNTPJ2E5ZCM5EB2BGFGTJLQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R13ECPZM7CT9O4",
                        "title": "4.0 out of 5 stars Great product, poor battery life",
                        "author": "Shawn V.",
                        "rating": 4,
                        "content": "Great product, poor battery life, this is my 2nd Galaxy watch. First was a Galaxy 3. This one does everything I want but the battery life is only 2 days between charges.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AEGVHRTHYVVSRAZWFX7RDONN6C5Q",
                        "is_verified": true,
                        "product_attributes": "Color: BlackSize: 43mmStyle: BluetoothPattern Name: Watch6 Classic"
                    },
                    {
                        "id": "R3EDVWK1RQ984S",
                        "title": "4.0 out of 5 stars Bueno",
                        "author": "Angie",
                        "rating": 4,
                        "content": "Sólo decepcionada con el tiempo de duración de la bateria...hay que cargarlo diario, a diferencia de mis otros relojes.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AFCJTS6O2N3KV4H437I2442HYLCQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R30JRIXK6CG3KF",
                        "title": "3.0 out of 5 stars A Watch That Nags You and Causes Your Phone to Do Unwanted Things",
                        "author": "AC",
                        "rating": 3,
                        "content": "I wanted to track my exercise, heart rate and O2 saturation. I chose this watch because it also gives an approximation of your EKG and estimates your BMI. And I still like the way it gives me a snapshot of my steps, exercise time, and calorie expenditure throughout the day. The readings seem to be fairly accurate. Mileage on the walks matches the AllTrails app within 0.05 mile. pO2 matches the fingertip oximeter at the doctor's office. I like being able to track my activity level through the day.But the negatives just about cancel out the positives. After 6 weeks, I'm still using the watch, but mostly so I won't feel like I'm throwing away the money I spent on it.When I'm taking a walk, a synthetic voice periodically interrupts my thoughts with statistics. I've tried various suggestions to silence this intrusive behavior, but no luck so far.When the watch was new, I tracked my water and food intake for a couple of weeks, and found that both seem to be within acceptable ranges. I stopped tracking them, and now the watch repeatedly urges me to continue this unnecessary tracking.I always feel rested in the morning, so I would have thought I was sleeping well. But I was curious about the sleep monitoring, so I tried wearing it to bed. Not so, apparently. I should be consuming Samsung's free and paid pre-sleep materials to improve my sleep. If Samsung could provide a new bladder to replace the 74-year-old one that gets me up twice a night, I might try that, but since I always fall back to sleep right away, I really don't see it as a problem. At least that annoyance has an easy solution--just take off the watch at bedtime, and after a few mornings of ignored suggestions, it seems to decide you're in a dead sleep while it sits on your dresser.The most troublesome thing is that I have tried to disable calls, texts, emails, and music on the watch, but when I bump my arm against things, it seems to be activating my phone, even while the phone is locked and put away. I find apps open that I haven't used in months. Unwanted music blares out at inopportune times. Yesterday the phone called a family member I often text but rarely call. When I didn't respond to her \"hello,\" she was concerned that her 74-year-old loved one was having an emergency. I have tried multiple solutions, but without success.When this watch bites the dust, I think I'll be fine without it.",
                        "timestamp": "Reviewed in the United States August 12, 2024",
                        "profile_id": "AEC6YDRWDBOIHSZMDOQV43KKBCMA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2S30CAYUXT2OH",
                        "title": "5.0 out of 5 stars Good deal",
                        "author": "Katharin Norris",
                        "rating": 5,
                        "content": "I snagged this on a super sale, I love the options and wear it all the time. I suggest turning off all unnecessary applications and features you don't use, it'll max out your battery life.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AE4B2DJMJLPA5VEVGCEGM3Q2TRDA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3H1MDUNDX9R6H",
                        "title": "4.0 out of 5 stars bezel is best",
                        "author": "Matt Richard",
                        "rating": 4,
                        "content": "the bezel is so much better than swiping, its a bit heavy but you get used to it after a while. battery lasts me over 2 days WITHOUR doing any of that disable bloatware, turn off adaptive display, etc. it fits well, but i'd double check to make sure you are getting a M/L band and not a S/M one because the bands are pretty small. Display is clean and customizable",
                        "timestamp": "Reviewed in the United States September 20, 2024",
                        "profile_id": "AFZAW2LJAZDEGTZIU6BOQYF7UQXA",
                        "is_verified": true,
                        "product_attributes": "Color: SilverSize: 47mmStyle: BluetoothPattern Name: Watch6 Classic"
                    },
                    {
                        "id": "R2PD4EZPH0DR4G",
                        "title": "5.0 out of 5 stars Love it",
                        "author": "Donna Neal",
                        "rating": 5,
                        "content": "I love this watch so much I bought one for my son and he love it. I wear it every day since I got it. It does everything I need it to do and monitors, my heart rate, pulse and sleeping habits. I have had so many other watches, but this one is the best of them all. It works perfect with my galaxy android phone. I highly recommend it.",
                        "timestamp": "Reviewed in the United States September 20, 2024",
                        "profile_id": "AEMG4JMNDIFBITU5HSE7YJSKGQQQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3U93MU9PBTXBK",
                        "title": "5.0 out of 5 stars Very Satisfied",
                        "author": "LBoone5",
                        "rating": 5,
                        "content": "I had the Gear2 so upgrading to the Galaxy6 was a huge improvement. The phone call clarity is amazing and the overall use is somewhat similar with many updates. I am very glad I made this purchase.",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AFSDB7MM7Q63JBWZBZ5JQZEXVVPA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2HGS04304TN0U",
                        "title": "4.0 out of 5 stars Samsung Smart Watch6",
                        "author": "Patós",
                        "rating": 4,
                        "content": "Thw watch is is nice, it's light weight and the material used for the band gives it a nice close fit and has a scratch resistant face, which is good if your an active person and do a lot of outdoor activities. I got a black, but there are some other colors but I like to keep it simple and black color blends while with my wardrobe. The watch connects easily to your phone and the process to register your watch online is also quick and just a one time process.The battery life is good and there are some nice apps out there to make the watch very interesting (health, watch faces etc.).So, overall, this is a good product.",
                        "timestamp": "Reviewed in the United States August 17, 2024",
                        "profile_id": "AGV2I2PMK4MWP7K2ANLFAFNX64UQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraphiteSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3JU85WCFWVOCP",
                        "title": "5.0 out of 5 stars So much better than Fitbit",
                        "author": "K Carter",
                        "rating": 5,
                        "content": "After Google bought out Fitbit, my device needed to be replaced but this was SUCH a better option. It has far more features and can easily hook to my phone so I don't have to have separate service like other models. Keeps track of health things like sleep and stress, and also has the ability to fast answer texts or get reminders.",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AFAYKNOU52ZGBHWO2XINU4YYWRXA",
                        "is_verified": true,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C792QRW6",
                "product_name": "SAMSUNG Galaxy Watch 6 40mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:15:50",
            "updated_at": "2024-10-17 11:16:07",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252638437092636673",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0C792QRW6",
                "page": 5,
                "pages": 134,
                "reviews": [
                    {
                        "id": "R28UAP5GDUGCD7",
                        "title": "5.0 out of 5 stars Works very well.",
                        "author": "Matt Sutton",
                        "rating": 5,
                        "content": "The watch works very well after 5 weeks of use. This includes a trip to Disney where the watch tracked my non-stop hiking through the parks.Sleep monitoring is my favorite feature. I can't speak to the accuracy, but the watch is consistent in what it monitors so it is easy to find anomalies in behavior to help correct.Wearable (phone app) by Samsung is easy to use.Works with Google Fitbit and Virgin Pulse.You will need to spend an hour or so adjusting the settings on your watch or app to dial in what you want to track or monitor. Monitoring everything can burn through battery power. So pick what is important to you.Minor annoyance: The charger came with a USB-C (?) cord. The new one. The one that doesn't match any outlet, adapter, nor any port on any computer of mine. I had to go out and buy a separate adaptor to charge my watch.",
                        "timestamp": "Reviewed in the United States August 6, 2024",
                        "profile_id": "AHAMFWDQ4OZVBFC7TZQQGDXYZT7Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1NYI5HAUBLYAI",
                        "title": "5.0 out of 5 stars Returning to GalaxyWatch after years of Fitbit",
                        "author": "Princhessa",
                        "rating": 5,
                        "content": "Very easy setup if you already have a Samsung account, phone, etc... I literally didn't have to do much at all - registering it online with the SN visible on the back side of the watch was so easy - and seemed to automatically connect with phone. I swear, I blinked and was set up!It's been as far back as the when I replaced my first Galaxy watch (was it a 2?) with the Fitbit Charge, and from then forward I was enjoying the FB's app and displays, and cheaper pricing. I stuck with that.This Galaxy comes out at a time shortly after Google purchasing FB, and the changes are just not as appealing. I wanted something more universal, so I've returned to GalaxyWatch!It is heavier than I'd thought it would be, but even that and the extra thickness after wearing it for a few hours, I'm not even noticing it. I currently have the FB on the right wrist, and Galaxy on left.Figuring out how to use some of the features like O2 and ECG was a little tricky, but it gives you a step by step both on the phone and/or on the watch itself and walks you through it. On the O2, if you're not holding it like it says - it doesn't actually prompt to start. That had me flustered for a bit until finally the button was there to start.Setting targets for weight/muscle/fat% was a bit confusing, but a simple Google search led to some clarity, and even that's set up now with my first 2 week goal. Use the watch to scan for body composition, and then step on a scale and record that to get your starting numbers... then there's a button to add a target. It would be nice to be able to set up several targets at once, but will have to revisit and set those small goals or just set a larger goal and watch progress as you go. I set only the weight as target and it adjusted the rest to match up. If you try to enter all 3 manually, you're likely to get an error because it doesn't quite match up between the 3 figures. Pick one and done!So, yes... only a few hours in, but these are the highlights I noticed in my excitement to share... so many clock faces available, so many customizable settings for each of the faces as well... FB was only just really getting to this point. Be wary, they're not all free... but there are more than enough free ones, and the ones I saw for a price, were 0.49 and 0.99 - definitely manageable if it's a must have!I'll have to revisit this review as I get more acquainted and find more pluses and minuses!PS - size... since I was going with the Classic, I hoped as I ordered the 43mm would be big enough for my aging eyes - and yes, it is perfectly fine! I'm actually thankful I did not go with the 47mm, because this one is just perfect. I do not have petite arms, but I do have smaller wrists, and it looks just fine. I would say, if you're very petite, and/or dainty... the regular 6 in the smaller of the 2 options is probably better. But I wouldn't go with the 47mm unless you really have a larger arm or it really may seem too big/bulky.Definitely glad I bit during the pre-order!",
                        "timestamp": "Reviewed in the United States August 16, 2023",
                        "profile_id": "AHBASPOJ3YTQELHOINGPUP5LX6RA",
                        "is_verified": true,
                        "helpful_count": 42,
                        "product_attributes": "Color: BlackSize: 43mmStyle: BluetoothPattern Name: Watch6 Classic"
                    },
                    {
                        "id": "RM67V47Y784SQ",
                        "title": "4.0 out of 5 stars So far its working perfect...",
                        "author": "D-M0NEY",
                        "rating": 4,
                        "content": "I'm sure there's a few watches out there with issues, hence the multiple one-star reviews. No brand is perfect. But mine works great. I bought it when it went on sale after the 7 came out. I couldn't justify the price for the 7 when the 6 is nearly identical. The battery isn't super impressive but it'll last almost 2 days with normal use. But the glass screen is very strong. It's waterproof. Tons of modern features (my last smart watch was an LG from 2014, so this thing is hi-tech AF to me). I'll update to 5 stars if it lasts a few months without issues. I haven't tested the sleep mode yet, I keep forgetting. I always take my watch off before bed. But a watch isn't gonna fix your sleep habits, just tell you that you sleep like shhhhh...",
                        "timestamp": "Reviewed in the United States July 28, 2024",
                        "profile_id": "AEBYBT3MOZAKMGDQIXXA3S6XKFRA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: SilverSize: 44mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1PYSYJPM5EVLQ",
                        "title": "4.0 out of 5 stars i received an empty box",
                        "author": "Amazon Customer",
                        "rating": 4,
                        "content": "i received an empty box but luckily when i contacted Amazon they replaced it immediately. my mom loves the watch",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEQRUEGOI7GT7BZKJLSD5XS4ZSWQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R2YS4YH7V7GIF8",
                        "title": "5.0 out of 5 stars Just what I needed to make my granddaughter happy.",
                        "author": "Ken220",
                        "rating": 5,
                        "content": "I asked my teenaged granddaughter what she wanted for her birthday. She said that she needed a new watch. I told her to check out the different types of watches and let me know what she wanted. This Samsung Galaxy Watch 6 40mm Bluetooth Smartwatch is what she decided on. She has had it over four months and still says that she loves it. She likes the way it connects to her phone and puts so much of the information on her watch. She's happy with it.",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AHM3Z3D4SFZBN5EU7T3VBT2XIGFA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3TJARV5ODSPE8",
                        "title": "4.0 out of 5 stars Satisfied",
                        "author": "Junior wickham",
                        "rating": 4,
                        "content": "I was disappointed at first when I saw the size of my screen, I guess I would take the blame, with that said I'm loving the experience with my Samsung smart watch 6",
                        "timestamp": "Reviewed in the United States October 2, 2024",
                        "profile_id": "AET2IJNW55Q5UOJLONTIQVAE5PFQ",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3HMLO6PDAPRK6",
                        "title": "4.0 out of 5 stars Short Battery",
                        "author": "Kendra",
                        "rating": 4,
                        "content": "I love the watch. I went from a fitbit to this. The only issue is the battery just lasts a day. I charged it at 5 last night and it is at 26% the next day at 11 am. I don't want to be charging it all the time. I track my sleep with it at night to charge is not an option. So during the day randomly I have to charge it. It also takes way longer than my versa to charge. I see that as really the only down fall of this. Honestly, it would have to be 100% charge in the morning to even last the whole day. And I'd you charge while you get ready in the morning it takes more than an hour to charge. Bummer.",
                        "timestamp": "Reviewed in the United States July 24, 2024",
                        "profile_id": "AHPNO2SVW4NPJZOSQZEBFJETJHNA",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1KM2D8WPPWTIG",
                        "title": "5.0 out of 5 stars Good watch",
                        "author": "Angela Scott",
                        "rating": 5,
                        "content": "Only complaint is that you cannot take your blood pressure with this watch. They imply you can (which you can). They imply you can but ypu cannot in the USA as it does not have FDA approval. You can do heart rate and ekg. Most other things work great.)",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AFTJFF2S7T6XIDTIBGY22WFKVB2A",
                        "is_verified": true,
                        "product_attributes": "Color: GoldSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R1T872TH1X7UU8",
                        "title": "5.0 out of 5 stars Love it",
                        "author": "S.T",
                        "rating": 5,
                        "content": "EasyFun new toy. Very helpful being that I can't always hold my phone-medical issues",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AEAO3LSJRYTC443TADSEGUPDEUHA",
                        "is_verified": true,
                        "product_attributes": "Color: GraphiteSize: 40mmStyle: BluetoothPattern Name: Watch6"
                    },
                    {
                        "id": "R3ETI1F19CUS8H",
                        "title": "5.0 out of 5 stars Battery length, and the variety of watch faces",
                        "author": "Lou",
                        "rating": 5,
                        "content": "This watch is so much more accurate than my 4 and I love all of the face customizable choices I get. The charge lasts over three days instead of one and the fit is great. I bought it for an amazing price and it tracks my sleep much better than my old one. It even tracks temperature. I love the look with thee band I chose I hope it lasts for a very long time.",
                        "timestamp": "Reviewed in the United States September 3, 2024",
                        "profile_id": "AHDPCT67MIPH5POWRCVIURMCDDFA",
                        "is_verified": true,
                        "product_attributes": "Color: SilverSize: 44mmStyle: LTEPattern Name: Watch6"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0C792QRW6",
                "product_name": "SAMSUNG Galaxy Watch 6 40mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:15:50",
            "updated_at": "2024-10-17 11:16:08",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0C792QRW6?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252638437092636673",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:15:50",
        "domain": "com",
        "geo_location": null,
        "id": "7252638437092636673",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0C792QRW6",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:16:08",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252638437092636673",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252638437092636673/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252638437092636673/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252638437092636673/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252638437092636673/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}