{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0D2P1SHNP",
                "page": 1,
                "pages": 62,
                "reviews": [
                    {
                        "id": "R220C9XP1S8LYV",
                        "title": "5.0 out of 5 stars Good product",
                        "author": "joni turner",
                        "rating": 5,
                        "content": "The Togala Smartwatch offers a good mix of functionality and style. It features a phone function and message reminders, making it convenient to stay connected without constantly checking your phone. The watch is designed for both men and women, with a sleek, modern look that suits various outfits and occasions. It tracks health metrics like heart rate, steps, and sleep, making it a useful fitness companion. The user interface is straightforward, and the battery life is decent for daily use. Overall, it’s a solid option for those looking for an affordable, feature-packed smartwatch",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AG6PLEMUSWX2FT3IY4NJ7RKV4Q3Q",
                        "is_verified": true,
                        "helpful_count": 5,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2B4BSAGJOFNRD",
                        "title": "5.0 out of 5 stars *\"Exceptional Timepiece! Highly Recommended",
                        "author": "mendy weiss",
                        "rating": 5,
                        "content": "I'm thoroughly impressed with this smartwatch! The sleek design and comfortable fit make it perfect for both men and women. The user interface is intuitive, and the features are top-notch.1. Accurate fitness tracking2. Long battery life3. Stylish and durable construction4. Affordable price pointThis smartwatch has exceeded my expectations. The GPS tracking, heart rate monitoring, and customizable watch faces are just a few of the many features that make it an outstanding value.Whether you're looking for a fashion accessory or a reliable fitness companion, this smartwatch delivers.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AFDXDZBBRREX7VYPU6OLVCRG5H5A",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2FI2HGR2MTZDC",
                        "title": "5.0 out of 5 stars Great Smartwatch and Great Customer Service",
                        "author": "DaNa",
                        "rating": 5,
                        "content": "this’is such a great value for the price! The battery life is fantastic, lasting several days with plenty of charge left, and it’s so easy to use. The heart rate monitoring is accurate, which I love and also sleep monitor .the watch itself is lightweight and comfortable to wear every day and night.. Plus, the customizable notification settings and themes are a nice touch. It’s durable too, handling daily wear and tear like a champ. Honestly, it’s unbeatable at this price point!",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AEAQ6QHZ2GLQW5ONTL23XGUGDHSQ",
                        "is_verified": true,
                        "helpful_count": 11,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R1GIOFKE9BLY6B",
                        "title": "5.0 out of 5 stars Great smart watch for beginners and on a low budget!",
                        "author": "Nick",
                        "rating": 5,
                        "content": "This is my first smart-watch. I don't have anything to compare it with, but I am quite happy with the features, looks and feel of it. It has many features and everything seems to work great. For me health-related features were most important - heart rate, oxygen meter, and sleep pattern; also exercise and a pedometer are all great features to have.It also has many other features - a stopwatch, timer, alarm, message notifications, and music player; you can make a call (haven't figured out if I can receive calls on it yet). It pairs with your phone and you can see and control some features from the phone app too.Battery life is great - probably going to last 4-5 days on full charge with regular use.",
                        "timestamp": "Reviewed in the United States September 15, 2024",
                        "profile_id": "AFLTKDJKSVEP2TTRXGA7SCW6KUBA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3H0941JQ2WK79",
                        "title": "5.0 out of 5 stars An affordable and high-quality smartwatch",
                        "author": "Lea Nguyen",
                        "rating": 5,
                        "content": "The Togala Smartwatch is an excellent choice for anyone looking for a feature-packed wearable at an affordable price. It offers a sleek design, accurate health tracking (heart rate, sleep, and fitness), and a user-friendly interface. Its long battery life and compatibility with both Android and iOS make it a reliable daily companion. Ideal for those seeking both style and functionality in a smartwatch. Highly recommended!",
                        "timestamp": "Reviewed in the United States September 8, 2024",
                        "profile_id": "AHVB2WWHL6NYSEXDPBZXJCLP772Q",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R17YU2WWXZB32K",
                        "title": "5.0 out of 5 stars nice design",
                        "author": "dave",
                        "rating": 5,
                        "content": "The Togala Smartwatch offers a good mix of functionality and style. It features a phone function and message reminders, making it convenient to stay connected without constantly checking your phone. The watch is designed for both men and women, with a sleek, modern look that suits various outfits and occasions. It tracks health metrics like heart rate, steps, and sleep, making it a useful fitness companion. The user interface is straightforward, and the battery life is decent for daily use. Overall, it’s a solid option for those looking for an affordable, feature-packed smartwatch",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AH37XNPIHYKKNKHJVWLWX2XG2T3A",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R3MTD3JD9VXX5U",
                        "title": "5.0 out of 5 stars Good watch",
                        "author": "Bishwa",
                        "rating": 5,
                        "content": "Great smartwatch with excellent features! The display is bright, clear, and easy to navigate. Fitness tracking is accurate, and the battery life lasts several days. Seamless notifications and easy to sync with my phone. Overall, a solid purchase for the price!",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AFSMSZDW4YTWWZBKP3KN36TP2TMA",
                        "is_verified": true,
                        "product_attributes": "Color: light red"
                    },
                    {
                        "id": "RGME10MBYKDF4",
                        "title": "5.0 out of 5 stars I am very happy. Unbeatable price.",
                        "author": "Gus79",
                        "rating": 5,
                        "content": "Very light weight, The watch performs perfectly, with pretty accurate heart rate monitoring and an impressively battery life.With all the health, fitness tracking features and its incredible resistance to shocks and elements, it's unbeatable for this price.I use it for a week and I just give it to my girlfriend 7 years old daughter and is wearing it every day. Very confortable and looks like is waterproof. After 5 days, still at 55% battery left.The screen is bright but I was keeping it at 50%. The Bluetooth had a good range, 2-3 rooms distance in the house.",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AFDMI4PFOGUIYRZ3DITR7A4BUFPQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R30V0BVIV9FMSF",
                        "title": "4.0 out of 5 stars Good value, but not customizable enough",
                        "author": "Andrew J. Holland",
                        "rating": 4,
                        "content": "I wanted a simple Smart Watch. A dumb Smart Watch, if you will. Something that tells time and can be charged without the constant need for replacement watch batteries. With that goal in mind, this watch mostly delivers, though a few things need tweaking. All are firmware-related. Firstly, if you have the watch set to turn on when you raise it and it's working for you, congratulations, because mine doesn't. The software requires a widget (component) to the right of the main watch face screen. You have to pick at least one and it can't be deleted. Why? There was no airplane mode I could find. The settings are pretty limited. Being able to import your own image (companion app only) is a nice feature, but your custom faces aren't saved in the app. Not even one at a time. Zero. It sends the image to your watch via Bluetooth and that's it. I don't want or need the heart rate feature, but if you're setting your own background, you have to have the heart icon in the upper right corner. It can't be removed, even if you turn off the monitor in settings. On the plus side, the watch is comfortable and lightweight, and if you get it on sale as I did for 30 bucks, it's well worth that amount, but the settings need more features. The companion app as well is fairly barebones.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AGPRY6V3ODRKCXMX3QMLUKO426TA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3F8NM8LRP8108",
                        "title": "5.0 out of 5 stars Everything about this watch!!!",
                        "author": "Lifelover",
                        "rating": 5,
                        "content": "Okay, first of all, I’ll start by saying that I’ve never own an Apple Watch (and I don’t think I need it). This watch has everything I’ve wanted! I’ve had 2 smartwatches in the past (few years) and this is by far my favorite! The size I guess is like a normal smart watch, charging speed is great, it looks exactly like an expensive smartwatch, it tracks my sleep (which that’s one of the reasons I chose it), it is SO easy to set up, you can make phone calls!!! The sound quality is great (for being a watch!), I did a whole call from there, the best part and crazy part that it was a zoom call, and my watch took over when my AirPods stopped working (I mention that because my phone doesn’t work for calls), what else? Text messages! You can read them through your phone (or calls) if you don’t have your phone near you, just answer the call through your watch :) I love it!",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AFHJXSTGI2HK73F4EA34WFX7OHQQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D2P1SHNP",
                "product_name": "Smart Watch for Men Women Answer/Make Calls, 1.96\" HD Fitness Watch with Heart Rate Monitor Sleep Monitor, 113+ Sports Activity Trackers with Step Counter, IP68 Waterproof, Smartwatch for Android/iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:08:24",
            "updated_at": "2024-10-17 11:08:28",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252636566303020033",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0D2P1SHNP",
                "page": 2,
                "pages": 62,
                "reviews": [
                    {
                        "id": "R3N6GXZJ4TKEIN",
                        "title": "5.0 out of 5 stars This little smartwatch does EVERYTHING!!",
                        "author": "JKL",
                        "rating": 5,
                        "content": "I can’t begin to say enough about this little watch! Any features could imagine a smartwatch or fitness type tracker doing, this does and more! There are many more types of activities you can select for it to recognize than my name brand fitness tracker. I also love how you can add your own image to the watch face too, not just an image from their library. My only complaint was that the instructions were soooo tiny even with magnifiers I couldn’t read them. But I played around with the watch and found the settings and easily downloaded the app and paired it with my phone effortlessly. I have big thick wrists and the band fits me perfectly. I would buy this little watch over and over again!!",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AH2LXW6Z7QPGMHBPFWOHAMQGHUIA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2D13R8C9EBDUB",
                        "title": "5.0 out of 5 stars Fantastic fitness watch with long battery life",
                        "author": "Jen Hillyard",
                        "rating": 5,
                        "content": "This watch has all the functionality of the Apple Watch without the crazy price tag. Connecting to my phone was simple and quick and synchronizes each time I open up the app. Love being able to track my steps, sleep and heart rate and only charge it once a week. Calls sound great, no text replies, but can read all texts and notifications pushed from my phone. The touch screen display responds really well and the color is excellent and very sharp. The flexible strap is super comfy to wear and I don’t even need to take it off in the shower. I love being able to customize the watch face, just wish I could modify the ringtone. So much to love about this watch!",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AGXVN437IR5S6SIA72EUA2Q4LBKA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2BQ3SO3UMPJAQ",
                        "title": "5.0 out of 5 stars Simple and easy to navigate",
                        "author": "matikalik",
                        "rating": 5,
                        "content": "I got this watch to try as an alternative to my Apple Watch. I really like the watch face that shows your steps although there are other many other watch faces through the app to choose from. It feels lighter than an Apple Watch and the size of the face is comparable to the larger Apple Watches. The band is a true watch band with quite a bit of adjustment.You can raise to wake the watch or press the dial which I like because I always seem to bump my other watch and start a workout or timer inadvertently.If you want a simple smart watch without all the bloated apps or features, this is definitely a great choice for the price.",
                        "timestamp": "Reviewed in the United States October 10, 2024",
                        "profile_id": "AETFFQQXOLBPWUUU2WOVLQ4SEFUQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R32YHAXJJPBSOH",
                        "title": "5.0 out of 5 stars Versatile Smartwatch with Exceptional Features",
                        "author": "Raphael",
                        "rating": 5,
                        "content": "This smartwatch has exceeded my expectations! The 1.96\" HD display is vibrant, and the call-making feature is super convenient. I love the fitness tracking options, with 113+ sports modes that cover everything I need. The heart rate and sleep monitor are accurate, providing great health insights. It’s also waterproof (IP68), so I don’t worry about wearing it during workouts or in the rain. The compatibility with both Android and iOS is seamless. Overall, an outstanding, versatile smartwatch that’s great for both fitness and daily use! Highly recommend!",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFMB4URCQRQ734EJCBPQWVQ6SFZA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R15G7GK1YCI99H",
                        "title": "5.0 out of 5 stars Togala Smart Watches Is a Top Choice for Budget-Conscious Buyers",
                        "author": "Emma",
                        "rating": 5,
                        "content": "I recently picked up the Togala Smart Watches, and it’s been a pleasant surprise. Here are two main points that make this smartwatch stand out:Battery Life: The battery life on this smartwatch is impressive. I’ve been using it consistently for about a week, and it’s still going strong. It easily lasts through my daily activities and then some, so you won’t find yourself constantly hunting for the charger. For anyone tired of frequent recharges, this is a real game-changer.Value for Money: This smartwatch offers exceptional value at its price point. It packs in features typically found in more expensive models, including fitness tracking, notifications, and customizable watch faces, all without breaking the bank. It’s a fantastic option if you want to balance cost and functionality.Overall: The Togala Smart Watches delivers on all fronts—easy setup, long-lasting battery, and a price that won’t hurt your wallet. If you’re in the market for a smartwatch that covers the basics and more, this one is worth considering.",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AGDSX3ZQAXTNYSKJVFE275FUTCVA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2K3MSL170DSR0",
                        "title": "5.0 out of 5 stars So far, so good!",
                        "author": "Caudie",
                        "rating": 5,
                        "content": "Once I got the app and watch communicating, it worked great! On my first attempt at installing the app, I chose auto setup (which was a mistake). After uninstalling and reinstalling using manual setup, there have been no problems. I'm looking forward to checking out the sleep statistics, which I'll do as soon as I can get used to wearing a watch to bed. Seller is fast in responding to inquiries. No complaints here. This is my first smart watch so I really didn't know what all to expect.",
                        "timestamp": "Reviewed in the United States October 5, 2024",
                        "profile_id": "AFFFRBBP32NR6QFRGRWRWCSTV2EA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R210L82ED8ZHJ7",
                        "title": "5.0 out of 5 stars Best watch for the price",
                        "author": "Tiffany Moore",
                        "rating": 5,
                        "content": "The Togala Smart Watch is a fantastic watch. It does everything I need it to do and beat my expectation. My two favorite things are the size which I can see the screen well but it’s not heavy on my wrist at all. I also love the sleep monitoring. I have trouble sleeping often so it’s great to see where I truly stand. I am also an active person so the step count is nice as well. The battery life and fact that it’s waterproof are both bonuses. I will be buying these for Christmas presents this year.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AGTVDNQNUBRBQNEBXFG4D6R2SOPA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2V87VKJI770YX",
                        "title": "5.0 out of 5 stars Good looking, Higher Battery life and impressive design/ Features.",
                        "author": "Sue",
                        "rating": 5,
                        "content": "Just got my Watch Togala today, and honestly, I’m impressed! The design is sleek and modern – looks even better in person than it does in pictures. It’s lightweight but feels solid, and the strap is super comfortable. The display is sharp and easy to navigate, plus it’s got all the features I need without being overwhelming.I used it after full charge ,battery life is holding up well so far,satisfactory, and I love the notifications feature – saves me from constantly checking my phone. I haven’t tested all the fitness tracking features yet, but it seems pretty accurate with the basics. Definitely a solid buy for the price!",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AHZ3NURUAE5HUHBT47UKBJFVYNWA",
                        "is_verified": true,
                        "helpful_count": 8,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RPYWVRU25WCZO",
                        "title": "5.0 out of 5 stars Great for the cost",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I received this watch about a week ago and have been wearing it since. It works great, I used to wear an Apple Watch and it is comparable. It seems accurate. For me, the most important things are tracking my steps, and monitoring my heart rate and this watch did that. The sleep tracking is very interesting, not sure how accurate because I am asleep! , I do wish it came with a smaller face, I have very small wrists and find this watch face to be a little too big for me however not big enough to make me not wear it but the size of it is hard for me to wear while sleeping so I probably won’t continue to do that. Bottom line is that it is a great product for the cost!",
                        "timestamp": "Reviewed in the United States September 5, 2024",
                        "profile_id": "AFCFFYCSTKXEOHOS7DUIFT7HMN6A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1PLCIKLLUIPAC",
                        "title": "5.0 out of 5 stars Best Smart Watch-Highly recommend!",
                        "author": "ProDrum",
                        "rating": 5,
                        "content": "Highly recommend!The watch is lightweight and comfortable, making it perfect for everyday wear. I love being able to answer calls directly from my wrist without needing to reach for my phone. The notifications from apps like Facebook and Instagram are seamlessly integrated and super convenient.The heart rate monitor and sleep tracker are highly accurate, giving me valuable insights into my health. As someone who values fitness, the watch's ability to track over when I in the gym, has been incredibly useful in helping me optimize my workouts. The waterproof rating also means I never have to worry about taking it off when washing my hands or running in the rain.Overall, this smartwatch is an incredible value for anyone looking for a comprehensive fitness tracker and a stylish, functional accessory. Highly recommend!",
                        "timestamp": "Reviewed in the United States September 9, 2024",
                        "profile_id": "AGTM3NSXGNI4VWJGX3IS7ZKA3SPQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D2P1SHNP",
                "product_name": "Smart Watch for Men Women Answer/Make Calls, 1.96\" HD Fitness Watch with Heart Rate Monitor Sleep Monitor, 113+ Sports Activity Trackers with Step Counter, IP68 Waterproof, Smartwatch for Android/iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:08:24",
            "updated_at": "2024-10-17 11:08:29",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252636566303020033",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0D2P1SHNP",
                "page": 3,
                "pages": 62,
                "reviews": [
                    {
                        "id": "R1XLS658GPE5BI",
                        "title": "5.0 out of 5 stars Great quality",
                        "author": "Lance begoon",
                        "rating": 5,
                        "content": "This is an amazing watch for the price. The battery lasts for ever and it doesn’t feel like a cheap watch. I love how easy you can read everything. Better than an Apple Watch. The only thing I wish it the you could respond to texts with it.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AGMOLNFG5PV2I7IMTAROVMGGPDIA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R35J6LZZKE0RP",
                        "title": "3.0 out of 5 stars Just OK",
                        "author": "Baruch",
                        "rating": 3,
                        "content": "This watch promises more than it delivers. It purports to measure your pulse, but I find it seriously inaccurate. The values are all over the place, from 50 BPM to over 130 BPM. There is no way I could have been at 130 BPM without my knowing it - I'd have been gasping for breath. I doubt my pulse ever gets down to 50 BPM, either. I'm just not that laid back.The manufacturer says that for greater accuracy you need to wear the watch more tightly om your wrist. When I tried that I found that my skin couldn't breathe, which caused it to become irritated. So the values are just going to be inaccurate.It doesn't seem to know when I go to sleep, either. Often before I turn in, I read for a bit. At such times I am immobile, so the watch thinks I'm sleeping. If I have to get up to pee in the night, the watch thinks I've gotten up for 20-40 minutes or so.It purports to measure blood oxygen saturation levels, which for all I know it might be doing. I have never found any use for that particular function.It annoyingly is connected to my phone such that when I get a call, my watch starts making a lot of noise. I have not yet found the way to stop this. The instructions are inadequate. This is highly annoying, because almost every call is spam.One feature that seems to work well is its keeping track of my steps. That's useful, and is a reminder to me to keep walking. Once upon a time I had a pedometer that I used. That's all it did - measure my steps. I wanted that. So if this watch did nothing more, I would still like it as a pedometer.Overall I am disappointed in this watch. I probably wouldn't buy it again. I might recommend it to someone I didn't like.",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AHNT4OJ7TUQARMCBTAAHFGK6D5XA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2ED0RBXCO57TT",
                        "title": "5.0 out of 5 stars Works well",
                        "author": "Bargain Hunter",
                        "rating": 5,
                        "content": "This watch is so cute! I basically wear it to track my walking workouts and it worked like a charm. It is very easy to ready while moving due to the cool graphics. It's very lightweight, yet sturdy too. It provides a decent amount of feedback on your workout.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AFACVCN4ZF62ZJ56OUYPALEHMLBA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R38MY7V54T0AZL",
                        "title": "5.0 out of 5 stars Beautiful and fancy",
                        "author": "Harold",
                        "rating": 5,
                        "content": "This waterproof smart watch has a very unique look with a design that is so neat and attractive combined with a very elegant black color adds to the value of this watch which is very suitable for women, men, children and all groupsThe benefits I get from this smart watch:1. As a Reminder Alarm2. Know the weather forecast3. Helps regulate sleep patterns4. Controls Calorie IntakeVery worth it with a price that matches the benefits provided by this item itself, this item is highly recommended to be purchased because there are so many good benefits. So far I am satisfied with what this product has presented",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AGEP5RUC5Y5SU3GHXNNABWIBWZCQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2GKRGD0X7YXNA",
                        "title": "5.0 out of 5 stars It was very easy to connect with my phone",
                        "author": "Karen farias",
                        "rating": 5,
                        "content": "I think the watch is amazing, I can receive calls and the microphone is heard very well. I can receive messages too. I can sleep with the watch and measure my sleep frequency, I went to the gym and I was able to monitor calories, training time, my heart rate, and I can also use the watch to measure rest time. The battery also lasts a long time.",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AHQVPPYHU72OWLEEWDMSDPI7HQ2Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3N8UC591COANB",
                        "title": "5.0 out of 5 stars Togala Watch Bought it for my husband & he loves it !",
                        "author": "Carol Jeffery",
                        "rating": 5,
                        "content": "The watch is easy to charge. Love the App that goes with our phone. Tracks, movement, heart rate, sleeping patterns, oxygen levels, tells temperature, texts. Did not want the purple band but now does not matter he wears it all the time ! The instructions were very hard to read, very small. Great watch !",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AFTRV5QBP4DM6WEDU3KDN3ZXZMPQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R34941FFDHYFQ2",
                        "title": "5.0 out of 5 stars Review for Togala Smart Watch, 1.96 inch Full Touchscreen Fitness Watch",
                        "author": "Henry",
                        "rating": 5,
                        "content": "I recently purchased the Togala Smart Watch, and it has exceeded all my expectations, especially at this price point! The 1.96-inch full touchscreen is incredibly responsive, with a crisp, high-resolution display that makes navigation easy and enjoyable. The fitness tracking features are comprehensive, including heart rate and sleep tracking, making it a great companion for maintaining a healthy lifestyle.One of the standout features is the ability to make and answer calls directly from the watch after connecting it to my phone via Bluetooth. It keeps me connected even when I'm on the go. The watch also handles notifications seamlessly, keeping me updated without needing to constantly check my phone.The battery life is impressive, lasting several days on a single charge, which is perfect for someone with a busy lifestyle. The watch is also very comfortable to wear, with a stylish design that looks great on my wrist.Overall, the Togala Smart Watch offers a lot of value for its price. It's packed with features that you'd expect from much more expensive models, making it an excellent choice for anyone looking for a reliable and feature-rich smartwatch without breaking the bank. Highly recommended!",
                        "timestamp": "Reviewed in the United States August 9, 2024",
                        "profile_id": "AHP47MLZ3FU4FQEI4B5P2RJTHT3Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RBTM95XO8EJWZ",
                        "title": "5.0 out of 5 stars Good watch!",
                        "author": "Ponchito251",
                        "rating": 5,
                        "content": "The interface is smooth and the watch is very lightweight with great battery life. I wish I could just connect it via Bluetooth without the app but doesn't seem like it, I guess most watches are like that.The English grammar on the box and instructions could use a little more refining to be more fluent to understand it better. All in all I like the watch and the company has other good products as well.",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AE3VQ5KHK2JACW4JGIFOO6RGFXNQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R12ANB6XRUSYLX",
                        "title": "4.0 out of 5 stars Amazing watch - just missing Blood Pressure???",
                        "author": "Rugby Hawk",
                        "rating": 4,
                        "content": "This watch is wonderful. It is large, colorful, has many options, a comfortable watch band, and is sleek enough that I could definitely wear it with my work clothes. The only issue was discovered by my wife - no blood pressure reader- which is an important feature for my family. So, until that is resolved, I have to go elsewhere. Please resolve and I will be back. This was an excellent smartwatch that I really wanted to keep.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AEUNARV4OWYKAAWPTTWLC5FFTGDQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3C70TSHS609VM",
                        "title": "5.0 out of 5 stars work great for older people",
                        "author": "Rebecca",
                        "rating": 5,
                        "content": "It's a great deal as a birthday present for my mom. And now she is off the phone with this convenient watch when she has any phone calls and messages. The benefit for older people is that one of the functions can remind her to move around when she is sitting too long time. Meanwhile, it also can monitor her sleeping and heart rate for the health concern. All in all, I think it's perfect for older people.",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AH42AYXFK3GFRW4KZGN34HFF6F2Q",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D2P1SHNP",
                "product_name": "Smart Watch for Men Women Answer/Make Calls, 1.96\" HD Fitness Watch with Heart Rate Monitor Sleep Monitor, 113+ Sports Activity Trackers with Step Counter, IP68 Waterproof, Smartwatch for Android/iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:08:24",
            "updated_at": "2024-10-17 11:08:31",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252636566303020033",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0D2P1SHNP",
                "page": 4,
                "pages": 62,
                "reviews": [
                    {
                        "id": "R2NU3J1H18CTZM",
                        "title": "5.0 out of 5 stars Great smart watch great price.",
                        "author": "Freddy",
                        "rating": 5,
                        "content": "I've had this watch for 3 weeks now. Great affordable smart watch. Get my calls and texts. And the price is hard to beat. The charge on it last a few days and is quick to charge. I wish the light red one was cheaper since my wife wants that one. But will definitely buy again.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AGAXT6W2SWKSPUCVCAQSCN4XLT7Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1H2YA84GSZ2HD",
                        "title": "5.0 out of 5 stars Love it!!!",
                        "author": "Anjana",
                        "rating": 5,
                        "content": "I brought this for my kid. he just love it and wearing it for all time. I brought black and its looks amzing. it has multiple features like running and multiple sports setting. Just perfect for my kid.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AEFUVZQBV72QUZOHCFB7TMCNVUYA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1WA9N563TL8JY",
                        "title": "5.0 out of 5 stars For my mother and she loves it",
                        "author": "sdiebels",
                        "rating": 5,
                        "content": "It's super cool and fast. It has different faces that you can use and it syncs right up to her phone. She hasn't stopped playing with it since I got it for her. It fits perfectly and has so many different functions. She loves it and since she has a bad heart, the heart monitor feature is amazing.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AGLFLIKPGENCWDCB7QGA7RITZ4OA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R107PCWY10OLIB",
                        "title": "5.0 out of 5 stars Smart watch",
                        "author": "M Wooten",
                        "rating": 5,
                        "content": "Best smart watch ever.it keep track of every movement in your daily life.its all in one.the features of this smart watch is awesome. Never miss a 📞,monitor your steps,heart beat & more . I recommend to all . Tell one tell all. This is the best gadget in keeping and staying on track and the key to living a healthier life. This is truly a game changer. Please buy and get your life back on track today.Lets Go 🤗🤗🤗♥️",
                        "timestamp": "Reviewed in the United States September 20, 2024",
                        "profile_id": "AFXHMIGCOGNXK73RUFR7YUXI5IJA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2NZ33EZ7JRBRG",
                        "title": "5.0 out of 5 stars Good for the price!",
                        "author": "illusion_c",
                        "rating": 5,
                        "content": "I’m heading out for a camping trip and temporarily need a smartwatch that can make calls. Since it’s just for temporary use, I’m looking to buy a simple not fancy one for the occasion. But this watch is surprisingly good, very useful for me when I'm outdoor for walking and running. It provides heart rate, walking step monitoring. App is very easy to setup and connect to my phone. And the battery life is also good, I only charging once for my 3 days trip. Overall, It's very good for the price!",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AEYM7NV3OWWBJNKUZ2OXAINH5TUQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R2B2IEFIFE066C",
                        "title": "5.0 out of 5 stars It's just like it says in the description",
                        "author": "Cliente de Kindle",
                        "rating": 5,
                        "content": "I love it, it brings all the functions I need, it constantly measures my heart rate and the volume of the watch is excellent, it sounds very good and connects to any type of phone.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHIJ54OHCWEW35P7QTYSQOBPROLQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2EFQB60Z8R879",
                        "title": "5.0 out of 5 stars You'll like it.",
                        "author": "Amazon Customer",
                        "rating": 5,
                        "content": "I bought this watch to give it to my son and I was blown away by the value for money! For the price of a traditional watch, you can buy a watch with all the features that such a watch can offer. In addition, it is so light that you can hardly feel its wrist. In short, I highly recommend this product!",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AGOWBLW5E5LSIL43ZJFYUTIHA5JA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2EYZ4W47351QK",
                        "title": "5.0 out of 5 stars A wide range of features.",
                        "author": "V.Hill",
                        "rating": 5,
                        "content": "I like this smartwatch, it is very intuitive and functions well. Pattern heart rate, oxygen, pedometer, calories. Ideal for training and walking. The surface treatment is very good and the quality of the material is also very good. My favorite is the built-in speakers, which allow you to listen to music without connecting headphones. I'll buy more for my family.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AFGVDRJMB7BYYYVXD76H2VLTB6JA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2VJTWRWOTCNJ6",
                        "title": "4.0 out of 5 stars Decent",
                        "author": "Pink Percy",
                        "rating": 4,
                        "content": "Decent watch. Nice large screen. Weather on watch doesn't update unless you go to the app and refresh which makes it kind of useless. Text notifications rarely work. Phone calls are very clear and the call out feature is nice. It's a decent watch. Step counter works well",
                        "timestamp": "Reviewed in the United States October 15, 2024",
                        "profile_id": "AGOKSZEH3HMR7P5OVW2KLBHEAMQA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R14K7NWWCZGT8Y",
                        "title": "5.0 out of 5 stars Best product and design perfect",
                        "author": "Patrick McSwain",
                        "rating": 5,
                        "content": "The Smart Watch for Men and Women is an exceptional smartwatch that offers a range of innovative features that make it a game-changer in the world of wearable technology. While there may be some minor issues with the watch's durability and compatibility with certain devices, these are minor complaints compared to the overall excellence of this product",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AHYY5HDOESJ3TB2UJIXFWK5Q3UJQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D2P1SHNP",
                "product_name": "Smart Watch for Men Women Answer/Make Calls, 1.96\" HD Fitness Watch with Heart Rate Monitor Sleep Monitor, 113+ Sports Activity Trackers with Step Counter, IP68 Waterproof, Smartwatch for Android/iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:08:24",
            "updated_at": "2024-10-17 11:08:32",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252636566303020033",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0D2P1SHNP",
                "page": 5,
                "pages": 62,
                "reviews": [
                    {
                        "id": "RONZV2CC3MP7I",
                        "title": "5.0 out of 5 stars Amazing Quality",
                        "author": "Phuong Hoang",
                        "rating": 5,
                        "content": "I love this watch because it measures your heartbeat. My favorite thing to do is hula hoops. It measures my calories while I exercise. I can also listen to music while doing hula hoops at the same time. I also enjoy baking. The timer in the watch is very useful. It keeps track of time so the cakes don’t get burnt while in the oven. Last I love the color. The orange is bright and it feels energizing when wearing it. I love the useful watch!",
                        "timestamp": "Reviewed in the United States September 8, 2024",
                        "profile_id": "AGRIAEKZF3IXFUXXMSKN4FCGAWGA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2KUFGFKXD5SKR",
                        "title": "5.0 out of 5 stars Simple and sleek",
                        "author": "pghgirl",
                        "rating": 5,
                        "content": "I liked the look of the watch and all the features. I tried to get it connected to my android several times as instructed but could not. I was able to figure out enough so that I was able to receive texts. The calls did not come through though. I wore this and my fitbit and there was a big difference in number of steps and kcal burned. This watch showed lower numbers in those areas. The pulse rate was similar though. This watch is easy to use, I just don't know how to connect for all the features or how accurate it's results are.",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AFCDUATDKTPI27U5ZNV4NT7FYXBQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1Y0D2IB92EK21",
                        "title": "5.0 out of 5 stars Muy bueno!",
                        "author": "Nay",
                        "rating": 5,
                        "content": "Me gusta este rejoj, hace su función, es de buena calidad, por su precio vale la pena 🤩",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AFPIAOQXL73UFZWCGIDM2MGMEH2Q",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RX5TE78KBBM6G",
                        "title": "5.0 out of 5 stars Great watch",
                        "author": "Macarena Piovano",
                        "rating": 5,
                        "content": "This watch is everything I could ask for!It not only has a great design, but also contains a ton of active and sport modes as well as sleeping track, heart rate and oxygen. Price-quality is great!! Buying it again for family members. I love it!!",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AHVBEIZA6VTBGS7VZ3DFXBVIT4VA",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "RJGWT0AYKQEXU",
                        "title": "5.0 out of 5 stars Beautiful Smartwatch with Customizable Display Screens",
                        "author": "MiraLee",
                        "rating": 5,
                        "content": "I’ve been using the Smart Watch and I’m quite pleased with it. The large display is clear and easy to read, and I love the ability to change display screens. There are various customizable watch faces to choose from, so you can easily switch up the look to match your style or mood.The fitness tracking provides good data on activity and health, helping me stay on top of my fitness goals. It’s a stylish and functional smartwatch that offers great value for the price.",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AHGCPCKFNXQLKS7FSZO56HZYKB7A",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R2H5GTTYDMYZOG",
                        "title": "5.0 out of 5 stars Best smart watch",
                        "author": "Efthakar",
                        "rating": 5,
                        "content": "Thus, I can say that the Togala Smart Watch has met and even crossed my expectations of a smartwatch with 1. Measuring 96 inches with full touchscreen technology the unit comes with a high quality touch screen that is very responsive and has very high resolution. Fitness tracking features are well rounded they include things like heart rate tracking and sleep tracking making it a good health companion. Due to the stylish appearance and good feeling on the wrist it can be utilized daily.,furthermore the navigation is very understandable. Notifications and alerts together with my phone, work in harmony making me connected while on the go. Battery life is satisfactory and you could be using it for several days on a go without having to recharge it.",
                        "timestamp": "Reviewed in the United States July 30, 2024",
                        "profile_id": "AHR3LBJJ4JZPIMR5BZV2ZLLL45MQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3BAINZQ4E3OFE",
                        "title": "5.0 out of 5 stars so excellent!!",
                        "author": "Kendall Nix",
                        "rating": 5,
                        "content": "I have received the order safely. the item is good, hopefully it can be useful and last long.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEMNPFHGHT3EMTVY4SVEX2XTWERQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2NLUCXHXYF2IV",
                        "title": "5.0 out of 5 stars Comfortable",
                        "author": "DCS",
                        "rating": 5,
                        "content": "Very comfortable on hand. Very good features",
                        "timestamp": "Reviewed in the United States October 6, 2024",
                        "profile_id": "AEHOHQ3FVLZNDGFLUQ5CRYTW6SYA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RXVE99A6HZMG9",
                        "title": "5.0 out of 5 stars Big display with everything at a glance",
                        "author": "Carla Hall",
                        "rating": 5,
                        "content": "Big display that I can see without my reading glasses. Tracking heart rate during physical activity is important to me as I need to monitor it. I hope it will encourage me to be more active by showing me on the face how many steps I've taken each day. This is my first smart watch and I'm still learning all the tricks it can do. I made a test phone call and that worked fine. Tracks my heart rate well.",
                        "timestamp": "Reviewed in the United States September 1, 2024",
                        "profile_id": "AHY43BXSCDFATYNOL4Q2ZMAOYJZQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R3OEK38DVYLTM5",
                        "title": "5.0 out of 5 stars Smartwatch.",
                        "author": "Kenneth Goins",
                        "rating": 5,
                        "content": "I have used other versions of this smart watch and this is the best. It's so light to wear. I use it to track my fitness but it does so much more. Making my life easier. I would definitely recommend with 6 stars.",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AHDNFRL247DXH7QDSWPK6OREVROA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D2P1SHNP",
                "product_name": "Smart Watch for Men Women Answer/Make Calls, 1.96\" HD Fitness Watch with Heart Rate Monitor Sleep Monitor, 113+ Sports Activity Trackers with Step Counter, IP68 Waterproof, Smartwatch for Android/iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:08:24",
            "updated_at": "2024-10-17 11:08:33",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0D2P1SHNP?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252636566303020033",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:08:24",
        "domain": "com",
        "geo_location": null,
        "id": "7252636566303020033",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0D2P1SHNP",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:08:33",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252636566303020033",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252636566303020033/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252636566303020033/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252636566303020033/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252636566303020033/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}