{
    "results": [
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=1",
                "asin": "B0D25ZL4FF",
                "page": 1,
                "pages": 115,
                "reviews": [
                    {
                        "id": "R2KER8ELNZNL80",
                        "title": "5.0 out of 5 stars Good product",
                        "author": "Andrea Robinson",
                        "rating": 5,
                        "content": "The Smart Watch for Men and Women offers an impressive array of features designed to cater to a variety of needs. With its 1.96\" HD display, the smartwatch delivers sharp and vibrant visuals, making it easy to interact with its interface and read notifications. The ability to answer and make calls directly from the watch is a convenient feature, ensuring that you can stay connected without having to reach for your phone.In terms of health and fitness, this smartwatch excels with its comprehensive monitoring capabilities. It tracks heart rate, sleep patterns, and steps, providing valuable insights into your well-being. The 113+ sports modes are a standout feature, catering to a wide range of activities from running to yoga, ensuring that the watch can adapt to various workout routines.The IP68 waterproof rating adds a layer of durability, allowing you to wear the watch while swimming or during intense workouts without worrying about water damage. Compatibility with both Android and iOS devices ensures that the watch can integrate seamlessly into most users' lifestyles.The pink color adds a stylish touch, making it a versatile accessory that can complement different outfits. Overall, this smartwatch combines functionality with style, making it a solid choice for anyone seeking a feature-rich, reliable, and aesthetically pleasing wearable.",
                        "timestamp": "Reviewed in the United States September 8, 2024",
                        "profile_id": "AGESVRLPMAIRU6HCPEKMHHOUYEMA",
                        "is_verified": true,
                        "helpful_count": 9,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R14PUOQU9JJQ2B",
                        "title": "5.0 out of 5 stars Perfect smartwatch for school!",
                        "author": "Irina Kh",
                        "rating": 5,
                        "content": "I ordered this smartwatch for my child to use in school, and it has exceeded my expectations! Pairing with phone was easy, and the connection is stable. The screen design is perfect for her to easily and quickly see the information. Today after first day at school, my child was incredibly pleased with it. Since phones aren’t allowed out during school hours, this watch has been a fantastic way for her to stay connected. She can easily check my messages, which is a great comfort for both of us. The ability to view messages and check the time without needing to pull out a phone has made her feel secure and connected throughout the day. The watch is not only practical but also comfortable to wear. It’s lightweight and durable, which suits her active school day perfectly. The various features, including fitness tracking, are an added bonus that she enjoys!",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AFSV6ELFZWMHTIVBQFOHLG7X4BJA",
                        "is_verified": true,
                        "helpful_count": 7,
                        "product_attributes": ""
                    },
                    {
                        "id": "R3L98PSZB7PSOS",
                        "title": "1.0 out of 5 stars Doesn't work",
                        "author": "Matt Wilcox",
                        "rating": 1,
                        "content": "I liked the look and feel of it, and the battery life is great. I was able to easily set it up on the app, however, I noticed many times it just not logging things. It said I didn't sleep at all when I had been sleeping for hours, the step tracker doesn't log all steps amd freezes at certain intervals, and the pulse and calorie estimates don't always work. Pulse was reading about half of what it actually was during workouts, it pauses randomly during workouts, and when set to strength training, it only logged 75 calories in an intense one-hour workout. I'm returning. Very disappointing.",
                        "timestamp": "Reviewed in the United States October 4, 2024",
                        "profile_id": "AG6Q6AEX2WQNWOQNKG6UGRX5ZPWA",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RV0B2TSZAMVM9",
                        "title": "5.0 out of 5 stars Excellent smartwatch",
                        "author": "Vanessa Botia",
                        "rating": 5,
                        "content": "I've been using this smartwatch for a few weeks now, and I’m thoroughly impressed.i like it because:-The design is comfortable to wear all day.- The display is bright, responsive, and easy to read, even in direct sunlight.-The battery life is good-Syncing with my phone was quick and seamless, and the app provides a ton of customization options for watch faces and notifications.Overall, this smartwatch offers great value for the price.Highly recommended for anyone looking for a reliable and versatile smartwatch!",
                        "timestamp": "Reviewed in the United States September 18, 2024",
                        "profile_id": "AFRCA5CCNW3UIG5A65MUU5EOMP3A",
                        "is_verified": true,
                        "helpful_count": 3,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R2SQ8YI89OX03N",
                        "title": "5.0 out of 5 stars Stylish and Feature-Packed Smart Watch—A Must-Have for Everyone!",
                        "author": "Todd Faubel",
                        "rating": 5,
                        "content": "I’m thrilled with my new Smart Watch! It’s sleek, stylish, and packed with features. The display is clear and easy to navigate, and it tracks my fitness goals accurately. The battery life is impressive, lasting several days on a single charge. It’s also comfortable to wear all day. Whether you’re checking notifications or monitoring your health, this smart watch does it all effortlessly. Highly recommend it for anyone looking for a versatile and reliable smartwatch",
                        "timestamp": "Reviewed in the United States September 10, 2024",
                        "profile_id": "AG6UICRTEDYEOLCGQIYLEDHCE3XQ",
                        "is_verified": true,
                        "helpful_count": 4,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R2Z4KXTVHAJBNY",
                        "title": "3.0 out of 5 stars Issues with app",
                        "author": "Ne",
                        "rating": 3,
                        "content": "Cons: Frequently disconnects from the app, so certain features like sms only work intermittently. In app, I changed units to pounds and the metric system, but it continues to show units in the british system and weigh in kg. There's no option for a vibrate only alarm clock (without sound). Pros: cost, size, style, water repellent, calling capabilities, charges quickly and holds a charge for 2-3 days with moderate use. Sleep, HR, and Oxygen readers seem to be pretty accurate",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AE26E6UY67AF4FQRE7MSVHWDHDHQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RLLZKN8PJM35S",
                        "title": "5.0 out of 5 stars Health Options",
                        "author": "Susie",
                        "rating": 5,
                        "content": "Health Tracking: this smartwatch has features like heart rate monitoring, sleep tracking, and activity tracking, helping users manage their fitness and health. It also allows you to receive notifications for calls, texts, and apps directly on your wrist, making it easier to stay connected without constantly checking your phone. Long Battery Life also it offer impressive battery life, often lasting several days on a single charge.Overall the black colour is very cute.",
                        "timestamp": "Reviewed in the United States October 8, 2024",
                        "profile_id": "AEX7WULW6GB5K5Y37DBNLW4SYQSA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RI9RIDO3725GD",
                        "title": "4.0 out of 5 stars It's a decent smartwatch for the price.(FYI No blood pressure monitoring)",
                        "author": "Sgt. Slab Wrankle",
                        "rating": 4,
                        "content": "Got it hoping to better monitor my health as well as answer calls & receive texts while my phone is on the charger. O2 & heart rate seemed to work fine but it was missing a big important health monitoring feature most of all smart watches should have which is blood pressure monitoring it has everything(heart rate, sleep & O2) except blood pressure which I was kind of hoping it would have or at least be able to add. Otherwise good display, connecting to phone was a little wonky but does work eventually through their app. Will be returning for a similar smartwatch that has blood pressure monitoring.",
                        "timestamp": "Reviewed in the United States September 7, 2024",
                        "profile_id": "AFAMGPOV26EZJNSDGHKLF3YYW2UQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1U6QM48LV7WR9",
                        "title": "5.0 out of 5 stars Smart watch",
                        "author": "irina pokharel",
                        "rating": 5,
                        "content": "I got this watch for my mom. She loved it so much because it’s sleek design. She said now she can even answer her phone through watch while working. So it made her life easy. This watch can also track physical activity, heart rate, sleep pattern. If you want to have fashionable watch with in affordable range then you should definitely buy this one . This will be great option as gift too",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AHYXMREYXKLKJYBZLXUTH3DH774A",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R1SDBC0NYLD8L3",
                        "title": "3.0 out of 5 stars Not very accurate",
                        "author": "Kazoua thao",
                        "rating": 3,
                        "content": "Just received this yesterday, testing it out and, honestly the sensors aren't that great. It counted me taking steps over the course of the night hours when I was asleep, it also isn't as accurate with my sleep analysis. It still counted me for sleeping although I was already up for a good 30-40 minutes?? Like a few minutes is fine but that much time counted while awake is crazy. Also, so far the little button on the side (to turn it on and off), you can kinda roll it like a normal watch and what not, but so far, I haven't found it's purpose in being able to turn. It also doesn't register touch very well on the screen. Sometimes I have to press more than once for my music to come on and what not. I HAVE tried calling and it works pretty well so that's good. I've walked outside and it's pretty bright, and I can see, it also has a pretty good battery thus far, it's been over 10 hours after the first charge and it's going well. But keep in mind it's because I was sleeping. But anyways, the band strap is pretty good quality so my wrist isn't being destroyed which is good. Pretty easy set up with the app and what not, BUT, the app and the syncing is kinda slow. I had to update it 4 times for it to properly load my sleep analysis.Will update once I have used it longer.",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AGRWXSML33LAOPZ76DN73F23CNVA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D25ZL4FF",
                "product_name": "Smart Watch for Men Women (Answer/Make Call), 1.96\"HD Smartwatch with Heart Rate/Sleep Monitor/Pedometer/Calories, 113+ Sports Fitness Tracker Watch, IP68 Waterproof Activity Tracker for Android iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:34:26",
            "updated_at": "2024-10-17 11:34:30",
            "page": 1,
            "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=1",
            "job_id": "7252643117818452993",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=2",
                "asin": "B0D25ZL4FF",
                "page": 2,
                "pages": 115,
                "reviews": [
                    {
                        "id": "R8TS6ZV75T1AX",
                        "title": "4.0 out of 5 stars Nice watch but bulky",
                        "author": "Linda",
                        "rating": 4,
                        "content": "I wish it was sleeker. Has nice functions, Does not hold a charge like my other Smart watch.",
                        "timestamp": "Reviewed in the United States October 12, 2024",
                        "profile_id": "AGSZNWFUSPKU7H37KEVU3DBSTEPA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R7LN7I6GAK5OI",
                        "title": "5.0 out of 5 stars Great battery life",
                        "author": "Olivia livingston Harris",
                        "rating": 5,
                        "content": "This product is very user friendly. I tested it for about a month and a half before I submitted this review just to double check how well the battery life was going to be and it's still lasting me 3-4 days after I fully charge it. The only downfall is sometimes I have to reconnect the Bluetooth to my phone but I'm not sure if that's because I'm out of proximity of my phone that it unconnects or if it dies it unconnect. That's an easy fix!",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AEZS2PTVGPA7XKESEININ4FX5Y3A",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R36V7BCS9NX56I",
                        "title": "5.0 out of 5 stars Best watch ever",
                        "author": "edith james",
                        "rating": 5,
                        "content": "This watch is actually amazing, as a person that has multiple watches in the past, none have gone close to this, not only was this watch super good and weightless it also allowed me to have it for cheep with tons of features from tracking your sleep to even calling people and playing music! If you had to have a watch and your low on budget this is the best option.",
                        "timestamp": "Reviewed in the United States September 26, 2024",
                        "profile_id": "AE3DXH3NP675HLH43I6AUF6XMBDA",
                        "is_verified": true,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R2M8MGFZ01YH17",
                        "title": "4.0 out of 5 stars China smart watch",
                        "author": "dennis patterson",
                        "rating": 4,
                        "content": "No instruction on how to program it.",
                        "timestamp": "Reviewed in the United States September 29, 2024",
                        "profile_id": "AF6WE5CM6XQPCZVLI7N5XDEPWZXQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2RJ4V40JO5T8R",
                        "title": "4.0 out of 5 stars Perfect for active workouts",
                        "author": "Moscato",
                        "rating": 4,
                        "content": "I love that the watch is very easy to set up and sync with my phone. The contacts did not sync with it but I was still able to use it and see all the workouts that are available to track. It reminds me a lot of my Apple Watch with the exception of it being more focused on the touchscreen than the dial on the side to move around. I can’t wait to use it in the gym as it is only Day 2! The watch band can easily come off",
                        "timestamp": "Reviewed in the United States August 2, 2024",
                        "profile_id": "AF3WPRZSWRB56PPNPKHUKPZMEACA",
                        "is_verified": true,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R2DXYWAMK347IQ",
                        "title": "4.0 out of 5 stars Good Watch",
                        "author": "Roberto Bouza",
                        "rating": 4,
                        "content": "I like the style and great price",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AGDHFLEZRI63IUHZKDCQFKKVFQ2A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1XHL84QCTNF1I",
                        "title": "4.0 out of 5 stars Got the pink watch",
                        "author": "Kimberly Shoff",
                        "rating": 4,
                        "content": "Love it ! But wish you could answer your text messages on you the watch.",
                        "timestamp": "Reviewed in the United States September 17, 2024",
                        "profile_id": "AGWAV7AKVIVAOJWJAHIRBUR3XEYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R2E625M9KF40AQ",
                        "title": "5.0 out of 5 stars Husband Likes",
                        "author": "Wanda B.",
                        "rating": 5,
                        "content": "Like this one because of heart rate he could check and sleep monitoring. But we both thought the phone would work with our phone off for calls, your phone have to be on to make calls and receive them",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AEBT7HXE6EPJ4F5M3HD3BVWK5CSQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2LE74JWM5OPW9",
                        "title": "5.0 out of 5 stars Good quality, beautiful design",
                        "author": "Azat",
                        "rating": 5,
                        "content": "I've been using this Smart Watch for a few days now, and I'm quite impressed. The design is sleek and modern, making it a stylish accessory that complements any outfit. The build quality feels solid, and the display is vibrant and easy to read.One of the standout features for me is the battery life. It holds a charge remarkably well, lasting well beyond a day of regular use. This is a significant advantage, as I don't have to worry about charging it multiple times throughout the day.Overall, I'm very pleased with the Smart Watch.",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AEKKVTA7ZMBEYQWYBZRJBBXTWUPQ",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": ""
                    },
                    {
                        "id": "R37DDBFF42746E",
                        "title": "5.0 out of 5 stars Easy to use",
                        "author": "George Bell",
                        "rating": 5,
                        "content": "It was easy setting it up to my Iphone. Plenty of watch faces to choose. Very comfortable to wear. This is the 2nd “cheap” smart watch I have had and it has it all for me. For the price so far so good.",
                        "timestamp": "Reviewed in the United States September 30, 2024",
                        "profile_id": "AEOYOGMO7QVFBSSW5IAOJWWKX7BQ",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D25ZL4FF",
                "product_name": "Smart Watch for Men Women (Answer/Make Call), 1.96\"HD Smartwatch with Heart Rate/Sleep Monitor/Pedometer/Calories, 113+ Sports Fitness Tracker Watch, IP68 Waterproof Activity Tracker for Android iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:34:26",
            "updated_at": "2024-10-17 11:34:32",
            "page": 2,
            "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=2",
            "job_id": "7252643117818452993",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=3",
                "asin": "B0D25ZL4FF",
                "page": 3,
                "pages": 115,
                "reviews": [
                    {
                        "id": "RS5NAVVETVYST",
                        "title": "5.0 out of 5 stars I’m impressed",
                        "author": "FallToArms",
                        "rating": 5,
                        "content": "Very impressive for price. Easy to install to phone, and app is simple. I highly recommend this item.",
                        "timestamp": "Reviewed in the United States October 14, 2024",
                        "profile_id": "AFB6ACZNXWV2ALDAWBFGVJBKMMYQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RI9FKMDF6FYTS",
                        "title": "5.0 out of 5 stars Valuable Smart Watch",
                        "author": "Vicky Jaminez",
                        "rating": 5,
                        "content": "Best purchase I’ve made in years! Pretty pale pink band with gold accents is true to what it looked like on Amazon. Very pretty and soft silicone band. Also in the package is the manufacturer’s email and if you email them they will send you two additional watch bands of your choice. They have three different texture options in many colors to choose from.",
                        "timestamp": "Reviewed in the United States September 14, 2024",
                        "profile_id": "AG6CGFHL22FMEEXB4KMFCFXKOTFA",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R1O7WVGNR623H8",
                        "title": "5.0 out of 5 stars Very fit",
                        "author": "Tracey Main",
                        "rating": 5,
                        "content": "The band is very comfortable, it's an affordable everyday smartwatch, I can make phone calls with it and it also records my heart rate in detail, which was the main feature I was interested in, this watch exceeded my expectations!",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AH5C7SEFZW7W7IT3SSOUCC2O2CAQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R1RZVKA2JJE8DG",
                        "title": "5.0 out of 5 stars The connection with my phone is stable.",
                        "author": "Daynon Gnant",
                        "rating": 5,
                        "content": "It was easy to sync with my phone, and the watch's related app showed my health data better and more completely than the phone's \"health\" app. This is a very cost-effective smart watch.",
                        "timestamp": "Reviewed in the United States September 27, 2024",
                        "profile_id": "AHX5G3WILI52Y3FRJM2NVRUUBSDQ",
                        "is_verified": true,
                        "product_attributes": "Color: Purple"
                    },
                    {
                        "id": "R2VAIM4VDO6LS3",
                        "title": "5.0 out of 5 stars Great functionality",
                        "author": "Sina Khalesidoost",
                        "rating": 5,
                        "content": "It was functional, easy to pair and use, lots of features. Happy with my purchase",
                        "timestamp": "Reviewed in the United States October 7, 2024",
                        "profile_id": "AE5SSRRB2S2WZPBIHHQFLVCCPIRA",
                        "is_verified": true,
                        "product_attributes": "Color: Purple"
                    },
                    {
                        "id": "R2WW3QDM8J3G83",
                        "title": "5.0 out of 5 stars watch",
                        "author": "Bohdana Furiaka",
                        "rating": 5,
                        "content": "I like it very much. It matches the picture. I am delighted.",
                        "timestamp": "Reviewed in the United States October 9, 2024",
                        "profile_id": "AHWLDUXLU2JGYKWIKRYE2XYMGD2Q",
                        "is_verified": true,
                        "product_attributes": "Color: Pink"
                    },
                    {
                        "id": "R2PPDYE9A4S5I1",
                        "title": "3.0 out of 5 stars Features Failures",
                        "author": "Omar Diaz",
                        "rating": 3,
                        "content": "The watch is nice, but the following features do not work or do not work well,1) Heart rate2) The watch does not show calories, time, and heart rate for one training session. Instead, it shows accumulated time, steps, and calories.3) Troubles connecting with Bluetooth, most time.In addition, you would set up the watch to monitor your sleep since it does not have an automatic option.",
                        "timestamp": "Reviewed in the United States October 13, 2024",
                        "profile_id": "AGSAN7RGFTOKP6HV6A3J44WES35A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1610E7QIFLLH7",
                        "title": "5.0 out of 5 stars Buen precio",
                        "author": "Jose C.",
                        "rating": 5,
                        "content": "Buena calidad y entrega rápida",
                        "timestamp": "Reviewed in the United States October 11, 2024",
                        "profile_id": "AGAUL5MBN56GKRJQA7PMNM5QWMBA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1A88WCWW4WTPD",
                        "title": "5.0 out of 5 stars Best Purple Jugeman Smart Watch, 1.96\" Smartwatch for the Performance and Price",
                        "author": "Gerald H.",
                        "rating": 5,
                        "content": "I purchased this Purple Jugeman Smart Watch, 1.96\" Smartwatch for my wife and I tell you she could not be happier. All the features and performance you get from this wife could not be beat. She uses it to check her heart rate, steps, oxygen level and text messages. It has too many features to list, but needless to say, my wife is extremely happy with her watch.I highly recommend this watch for your spouse, daughter, grandchild, or niece.",
                        "timestamp": "Reviewed in the United States August 25, 2024",
                        "profile_id": "AFOYFNO6FEBAXJWZZ7Z57MBPTQYQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R33M5J7HAHIKX3",
                        "title": "5.0 out of 5 stars Costo - beneficio",
                        "author": "Camilo Téllez",
                        "rating": 5,
                        "content": "La relación entre costo y beneficio es alta. Un muy buen precio para la calidad del reloj. Sus funciones son buenas, la calidad es muy buena, duración de la batería super.Es una muy buena opcion.",
                        "timestamp": "Reviewed in the United States September 13, 2024",
                        "profile_id": "AEO7FVBYZQ2SCFPKRKUSDBGMKJVA",
                        "is_verified": true,
                        "product_attributes": ""
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D25ZL4FF",
                "product_name": "Smart Watch for Men Women (Answer/Make Call), 1.96\"HD Smartwatch with Heart Rate/Sleep Monitor/Pedometer/Calories, 113+ Sports Fitness Tracker Watch, IP68 Waterproof Activity Tracker for Android iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:34:26",
            "updated_at": "2024-10-17 11:34:34",
            "page": 3,
            "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=3",
            "job_id": "7252643117818452993",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=4",
                "asin": "B0D25ZL4FF",
                "page": 4,
                "pages": 115,
                "reviews": [
                    {
                        "id": "R37UMAMMRB572Y",
                        "title": "5.0 out of 5 stars Love It!",
                        "author": "Cogline",
                        "rating": 5,
                        "content": "I don't think there is a smartwatch this good for the price anywhere. I wanted one that constantly monitors my heart rate. None of my previous ones did this. I don't mind that it doesn't measure blood pressure as my bp is always good. It can measure blood oxygen as often as you like automatically. I also wanted one that could make/receive calls. Just sync with your contacts. Make sure to allow all permissions for it on your phone. And sleep monitoring is a must for me. It displays the current local temperature, something my last one didn't do properly. It has Many exercises to choose from. Many watch faces too, though I like the default face. You can make a custom background pic if you want, but it will only display pulse, time, date, and day. It is easy to sync and set up if you know basic phone settings. The band color is a quite unique light purple. It got here in 1 day in an Amazon box. I got a similar one for my daughter",
                        "timestamp": "Reviewed in the United States July 12, 2024",
                        "profile_id": "AFARPCMOSB4WTHL7HL4DFBZOJJSA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": ""
                    },
                    {
                        "id": "R38ZCDJ4SNAJDD",
                        "title": "3.0 out of 5 stars Good but not great",
                        "author": "Kayla",
                        "rating": 3,
                        "content": "Let’s start with cons:Hurts — I’ve adjust the tightness but it’s not really a comfortable fit. The watch face is bigger and the band has more friction. I that’s why.Hard to connect — took me way too long to figure out how to sync and multiple attempts.Not everything connects — still have things I can’t get to connect like my contactsPros:Clean screenHas music optionMore features than previous version2.8/5",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AGQWU5I7DL33MYOCA4WR6AUR725Q",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R320FKFXNU5RLX",
                        "title": "5.0 out of 5 stars Love this",
                        "author": "donna evans",
                        "rating": 5,
                        "content": "Just got it yesterday-so far, it’s great — easy to set up, bright, easy to read.I like this a lot",
                        "timestamp": "Reviewed in the United States September 21, 2024",
                        "profile_id": "AGRVWWGI73MOHBLNL5J2NTJ6XD2A",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R34A89P1DGHJH6",
                        "title": "5.0 out of 5 stars Wonderful Service",
                        "author": "Angie Perez",
                        "rating": 5,
                        "content": "Both the product and service were wonderful. I’m very happy with this purchase",
                        "timestamp": "Reviewed in the United States September 25, 2024",
                        "profile_id": "AHBIA3Q32EQWB4A4HS64MPMLEDEQ",
                        "is_verified": true,
                        "product_attributes": "Color: Beige"
                    },
                    {
                        "id": "R1FDM7JH7TOAKC",
                        "title": "5.0 out of 5 stars Good buy",
                        "author": "Sam O.",
                        "rating": 5,
                        "content": "Very pleased with the watch settings it up wasn't that bad either tks sam",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AFX3TDDUCZ2FC45IFACB7RRHFJTA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R1F7T2MCTHXIL8",
                        "title": "5.0 out of 5 stars Light weight and beautiful color",
                        "author": "Blue Sky ITW",
                        "rating": 5,
                        "content": "I buy this watch to myself. Very easy to control and connect with Bluetooth to my phone and I can make a phone call and text. I can just put my cellphone on my backpack. And every time I can control how many step for my walk.",
                        "timestamp": "Reviewed in the United States September 2, 2024",
                        "profile_id": "AGRFGMI4M4WH2JAT6N5CO4JC77ZQ",
                        "is_verified": true,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R3AIATJTFGOQUJ",
                        "title": "5.0 out of 5 stars 1.96” HD Smartwatch: Call, Track Fitness & Health, Waterproof, 113+ Sports Modes – For Men & Women",
                        "author": "CARLOS",
                        "rating": 5,
                        "content": "The Smart Watch for Men and Women is a top-tier accessory for those seeking a blend of style and functionality. Its 1.96\" HD display offers clear visuals for managing calls, while the heart rate, sleep monitor, and pedometer keep your health in check. With 113+ sports modes and an IP68 waterproof rating, it's built for both fitness enthusiasts and daily wear. The vibrant orange design adds a bold touch, and its compatibility with Android and iOS makes it an essential tech companion for staying connected and healthy on the go.",
                        "timestamp": "Reviewed in the United States August 11, 2024",
                        "profile_id": "AFLSKMRTYKHO6UJU5J53DEVR35VQ",
                        "is_verified": true,
                        "product_attributes": "Color: Orange"
                    },
                    {
                        "id": "RL3096HCXU96S",
                        "title": "5.0 out of 5 stars Excelente",
                        "author": "LISBET GARCIA SUNIAGA",
                        "rating": 5,
                        "content": "Me funciona para la tensión arterial",
                        "timestamp": "Reviewed in the United States September 28, 2024",
                        "profile_id": "AFHGGMGFC4MCYTW6JO3CLNJHDTWQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R20HWPS9E3SKEN",
                        "title": "5.0 out of 5 stars Good exercise & sleep tracker",
                        "author": "Svetlana",
                        "rating": 5,
                        "content": "Bought this watches as a gift to my dad. He especially likes how big the screen is.Easy to set up. Great exercise & sleep tracker.Good quality, weight, and they also look pretty stylish.Happy with the purchase",
                        "timestamp": "Reviewed in the United States September 4, 2024",
                        "profile_id": "AG2L5JDMXV7K45WFRTVCRHP5CHYA",
                        "is_verified": true,
                        "helpful_count": 2,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RV4HQ7QXUQJYB",
                        "title": "3.0 out of 5 stars Not accurate for counting steps",
                        "author": "Amazon Customer",
                        "rating": 3,
                        "content": "Super nice watch, I was looking for a step counter(per doc orders) and decided to give this watch a try. And is fun to wear and easy to use, but not accurate for counting step. My phone claimed I walked 5607 steps, but watch said about half that. Nice watch just not what I needed.",
                        "timestamp": "Reviewed in the United States October 1, 2024",
                        "profile_id": "AFBZFID34UIMRTDVKTPW7VSRBKMA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D25ZL4FF",
                "product_name": "Smart Watch for Men Women (Answer/Make Call), 1.96\"HD Smartwatch with Heart Rate/Sleep Monitor/Pedometer/Calories, 113+ Sports Fitness Tracker Watch, IP68 Waterproof Activity Tracker for Android iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:34:26",
            "updated_at": "2024-10-17 11:34:35",
            "page": 4,
            "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=4",
            "job_id": "7252643117818452993",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        },
        {
            "content": {
                "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=5",
                "asin": "B0D25ZL4FF",
                "page": 5,
                "pages": 115,
                "reviews": [
                    {
                        "id": "R2RL3WFM33903H",
                        "title": "5.0 out of 5 stars Very cool watch",
                        "author": "JASON J",
                        "rating": 5,
                        "content": "This pretty watch pretty watch seems to get more valuable every time I put it on. It's so much better than having a regular watch I have my weather time and my bio info add my fingertips without having to open my phone. There's an app to connect to your phone so you can read your text messages and make phone calls without having to use the actual cell phone. For $25 this is an excellent buy.",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AEEZWG74DUS7ERHPVL6P7UEFZDSA",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R1MVN0AF6YJ1CC",
                        "title": "3.0 out of 5 stars No messages?",
                        "author": "Cruz F. Tineo",
                        "rating": 3,
                        "content": "The watch would of met my needs for the price and features Time/Weather/Monitoring. But the most important feature was lacking - SMS messages notifications, which i could never get it to work. Tried everything - restarting, setting permissions, etc. but nothing worked. I only could get Outlook messages notification to work. After reviewing forums and the app comments, I wasn't the only buyer that had the problem.",
                        "timestamp": "Reviewed in the United States September 19, 2024",
                        "profile_id": "AFKZS6JMW3K36XHV54GXXU5LS6OA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R3MFGYPBR073F5",
                        "title": "5.0 out of 5 stars Surpassed Expectations",
                        "author": "M",
                        "rating": 5,
                        "content": "The watch and function surpassed my expectations. Once I figured out to sync with the app the set up went well. The face is large for a small wrist. I just got it the other day- time will tell -no pun intended",
                        "timestamp": "Reviewed in the United States August 30, 2024",
                        "profile_id": "AFATQ6F53HYFITAWQOBETOYD2ZZA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R376XGWIM203NB",
                        "title": "5.0 out of 5 stars Great value",
                        "author": "Tentime",
                        "rating": 5,
                        "content": "So far watch works great!",
                        "timestamp": "Reviewed in the United States September 24, 2024",
                        "profile_id": "AFH7UCSR55BGRLO4LOLGPKJLDMMA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "RLPY3M98A5PMI",
                        "title": "5.0 out of 5 stars Stylish",
                        "author": "Tim Phillips",
                        "rating": 5,
                        "content": "This is a great smartwatch for the price. Very useful and looks good. I’ve had no problems. Great value.",
                        "timestamp": "Reviewed in the United States September 12, 2024",
                        "profile_id": "AGFWVCFRF4MVFUMUY36BBPCDTP3A",
                        "is_verified": true,
                        "helpful_count": 1,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R3TDJFBSVHGVC5",
                        "title": "5.0 out of 5 stars Battery life is great",
                        "author": "Chase Vaseleou",
                        "rating": 5,
                        "content": "I came from a Apple watch while this doesn't have as many features. It does exactly what I wanted. Track my health stats and notify of incoming calls and text. Battery life is still 80% after 4 days.",
                        "timestamp": "Reviewed in the United States August 28, 2024",
                        "profile_id": "AF4EAQFG4Z6GRM74MG75C7RLF5DQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R1R3OK64EUVFMY",
                        "title": "5.0 out of 5 stars Cool watch with reasonable price",
                        "author": "ZMZ chughtai",
                        "rating": 5,
                        "content": "Its a cool watch with a reasonable price. First of all it is quite easy to set up, battery life is satisfactorily long, can go a bit more than two days. Straps are comfortable with good looking design and really helpful in tracking health routine. Until now with use of almost two weeks I haven't found any problem.",
                        "timestamp": "Reviewed in the United States August 18, 2024",
                        "profile_id": "AEM4OOANZR4WPG4BEAYQ5V7UM5WQ",
                        "is_verified": true,
                        "helpful_count": 6,
                        "product_attributes": "Color: light grey"
                    },
                    {
                        "id": "R66QI6L2591Q8",
                        "title": "5.0 out of 5 stars Good watch",
                        "author": "helene",
                        "rating": 5,
                        "content": "I've wanted to keep track of my sleeping ever since I wanted to nap in the afternoon. I enjoy the sleep feature alot. The rest of the features are bonuses.",
                        "timestamp": "Reviewed in the United States August 31, 2024",
                        "profile_id": "AGWHH4WAHTFEY3CG4ICTQ36WVMKQ",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    },
                    {
                        "id": "R2RK0WI4K7ZF9W",
                        "title": "5.0 out of 5 stars really like this watch!",
                        "author": "Shelly Smallwood",
                        "rating": 5,
                        "content": "i Love the color, the face is big enough to put one of my personal pictures on it. the fit is good, i'd only shorten the length of the band....its a skosh too long but workable. it was easy to connect to the Gloryfit app on my phone.overall, very happy with my purchase!! would recommend!",
                        "timestamp": "Reviewed in the United States August 15, 2024",
                        "profile_id": "AGSVKADZXST55TICIWFO4W3SYXMQ",
                        "is_verified": true,
                        "product_attributes": ""
                    },
                    {
                        "id": "R10Z88B368ZAB5",
                        "title": "5.0 out of 5 stars Great Smart Watch for the price",
                        "author": "vicky",
                        "rating": 5,
                        "content": "Bought for a gift for my husband. He loves it. Big screen for him to see. Has all the bells and whistles the expensive smart watch has. Glad I got it for him.",
                        "timestamp": "Reviewed in the United States August 27, 2024",
                        "profile_id": "AEFBRMFGF2XDY4X6QGL5KVU3MILA",
                        "is_verified": true,
                        "product_attributes": "Color: Black"
                    }
                ],
                "page_type": "Question",
                "asin_in_url": "B0D25ZL4FF",
                "product_name": "Smart Watch for Men Women (Answer/Make Call), 1.96\"HD Smartwatch with Heart Rate/Sleep Monitor/Pedometer/Calories, 113+ Sports Fitness Tracker Watch, IP68 Waterproof Activity Tracker for Android iOS",
                "parse_status_code": 12000
            },
            "created_at": "2024-10-17 11:34:26",
            "updated_at": "2024-10-17 11:34:37",
            "page": 5,
            "url": "https://www.amazon.com/product-reviews/B0D25ZL4FF?reviewerType=all_reviews&pageNumber=5",
            "job_id": "7252643117818452993",
            "is_render_forced": false,
            "status_code": 200,
            "parser_type": ""
        }
    ],
    "job": {
        "callback_url": null,
        "client_id": 83505,
        "context": [
            {
                "key": "force_headers",
                "value": null
            },
            {
                "key": "force_cookies",
                "value": false
            },
            {
                "key": "hc_policy",
                "value": null
            },
            {
                "key": "check_empty_geo",
                "value": null
            },
            {
                "key": "safe_search",
                "value": true
            }
        ],
        "created_at": "2024-10-17 11:34:26",
        "domain": "com",
        "geo_location": null,
        "id": "7252643117818452993",
        "limit": 10,
        "locale": null,
        "pages": 5,
        "parse": true,
        "parser_type": null,
        "parsing_instructions": null,
        "browser_instructions": null,
        "render": null,
        "url": null,
        "query": "B0D25ZL4FF",
        "source": "amazon_reviews",
        "start_page": 1,
        "status": "done",
        "storage_type": null,
        "storage_url": null,
        "subdomain": "www",
        "content_encoding": "utf-8",
        "updated_at": "2024-10-17 11:34:37",
        "user_agent_type": "desktop",
        "session_info": null,
        "statuses": [],
        "client_notes": null,
        "_links": [
            {
                "rel": "self",
                "href": "http://data.oxylabs.io/v1/queries/7252643117818452993",
                "method": "GET"
            },
            {
                "rel": "results",
                "href": "http://data.oxylabs.io/v1/queries/7252643117818452993/results",
                "method": "GET"
            },
            {
                "rel": "results-content",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/1/content",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/2/content",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/3/content",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/4/content",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/5/content"
                ],
                "method": "GET"
            },
            {
                "rel": "results-html",
                "href": "http://data.oxylabs.io/v1/queries/7252643117818452993/results?type=raw",
                "method": "GET"
            },
            {
                "rel": "results-content-html",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/1/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/2/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/3/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/4/content?type=raw",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/5/content?type=raw"
                ],
                "method": "GET"
            },
            {
                "rel": "results-parsed",
                "href": "http://data.oxylabs.io/v1/queries/7252643117818452993/results?type=parsed",
                "method": "GET"
            },
            {
                "rel": "results-content-parsed",
                "href_list": [
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/1/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/2/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/3/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/4/content?type=parsed",
                    "http://data.oxylabs.io/v1/queries/7252643117818452993/results/5/content?type=parsed"
                ],
                "method": "GET"
            }
        ]
    }
}